{
    "para": [
      {
        "name": "آلم",
        "totalAyat":12,
        "totalSajda":0,
        "para": 1,
        "data": [{
          "part":1,
          "aya":[
          {
            "isSurahChange": true,
            "surat": "اَلْفَاتِحَة",
            "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
            "translation1": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا۔",
            "translation2": "اللہ کے نام سے شروع جو نہایت مہربان ، رحمت والاہے۔",
            "ayatNumber": 0
          },
          {
            "arabic": "اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِیْنَ(1)",
            "translation1": "سب خوبیاں اللہ کو جو مالک سارے جہان والوں کا۔",
            "translation2": "سب تعریفیں اللہ کے لئے ہیں جو تمام جہان والوں کاپالنے والا ہے۔",
            "ayatNumber": 1
          },
          {
            "arabic": "الرَّحْمٰنِ الرَّحِیْمِ(2)",
            "translation1": "بہت مہربان رحمت والا۔",
            "translation2": "بہت مہربان رحمت والا۔",
            "ayatNumber": 2
          },
          {
            "arabic": "مٰلِكِ یَوْمِ الدِّیْنِﭤ(3)",
            "translation1": "روزِ جزاء کا مالک۔",
            "translation2": "جزا کے دن کامالک۔",
            "ayatNumber": 3
          },
          {
            "arabic": "اِیَّاكَ نَعْبُدُ وَ اِیَّاكَ نَسْتَعِیْنُﭤ(4)",
            "translation1": "ہم تجھی کو پوجیں اور تجھی سے مدد چاہیں۔",
            "translation2": "ہم تیری ہی عبادت کرتے ہیں اور تجھ ہی سے مدد چاہتے ہیں ۔",
            "ayatNumber": 4
          },
          {
            "arabic": "اِهْدِنَا الصِّرَاطَ الْمُسْتَقِیْمَ(5)",
            "translation1": "ہم کو سیدھا راستہ چلا۔",
            "translation2": "ہمیں سیدھے راستے پر چلا۔",
            "ayatNumber": 5
          },
          {
            "arabic": "صِرَاطَ الَّذِیْنَ اَنْعَمْتَ عَلَیْهِمْ ﴰ",
            "translation1": "راستہ اُن کا جن پر تُو نے احسان کیا،",
            "translation2": "ان لوگوں کا راستہ جن پر تو نے احسان کیا",
            "ayatNumber": 6
          },
          {
            "arabic": "غَیْرِ الْمَغْضُوْبِ عَلَیْهِمْ وَ لَا الضَّآلِّیْنَ(7)",
            "translation1": "نہ ان کا جن پر غضب ہوا اور نہ بہکے ہوؤں کا۔",
            "translation2": "نہ کہ ان کا راستہ جن پر غضب ہوا اور نہ بہکے ہوؤں کا۔",
            "ayatNumber": 7
          },
          {
            "isRuko": true,
            "Surat": 1,
            "rakuNumber": 1,
            "ayaAfterRako": 7,
            "Place": "ﻉ",
            "ayaBeforeRako": 1,
            "Diff": 7,
            "bottomNumber": 1,
            "arabic": null,
            "translation1": null,
            "translation2": null,
            "ayatNumber": null
          },
          {
            "isSurahChange": true,
            "surat": "اَلْبَقَرَة",
            "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
            "translation1": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا۔",
            "translation2": "اللہ کے نام سے شروع جو نہایت مہربان ، رحمت والاہے۔",
            "ayatNumber": 0
          },
          {
            "arabic": "الٓمّٓ(1)",
            "translation1": "",
            "translation2": "الم۔",
            "ayatNumber": 1
          },
          {
            "arabic": "ذٰلِكَ الْكِتٰبُ لَا رَیْبَ ﶈ فِیْهِ ۚۛ-هُدًى لِّلْمُتَّقِیْنَ(2)",
            "translation1": "وہ بلند رتبہ کتاب (قرآن) کوئی شک کی جگہ نہیں اس میں ہدایت ہے ڈر والوں کو ۔                    ",
            "translation2": "وہ بلند رتبہ کتاب جس میں کسی شک کی گنجائش نہیں ۔اس میں ڈرنے والوں کے لئے ہدایت ہے۔                    ",
            "ayatNumber": 2
          },
          {
            "arabic": "الَّذِیْنَ یُؤْمِنُوْنَ بِالْغَیْبِ وَ یُقِیْمُوْنَ الصَّلٰوةَ وَ مِمَّا رَزَقْنٰهُمْ یُنْفِقُوْنَ(3)                    ",
            "translation1": "وہ جو بے دیکھے ایمان لائیں اور نماز قائم رکھیں اور ہماری دی ہوئی روزی میں سے ہماری راہ میں اٹھائیں ۔                    ",
            "translation2": "وہ لوگ جو بغیر دیکھے ایمان لاتے ہیں اور نماز قائم کرتے ہیں اور ہمارے دئیے ہوئے رزق میں سے کچھ(ہماری راہ میں ) خرچ کرتے ہیں ۔                    ",
            "ayatNumber": 3
          },
          {
            "arabic": "وَ الَّذِیْنَ یُؤْمِنُوْنَ بِمَاۤ اُنْزِلَ اِلَیْكَ وَ مَاۤ اُنْزِلَ مِنْ قَبْلِكَۚ-وَ بِالْاٰخِرَةِ هُمْ یُوْقِنُوْنَﭤ(4)                    ",
            "translation1": "اور وہ کہ ایمان لائیں اس پر جو اے محبوب تمہاری طرف اترا اور جو تم سے پہلے اترا اور آخرت پر یقین رکھیں ۔                    ",
            "translation2": "اور وہ ایمان لاتے ہیں اس پر جو تمہاری طرف نازل کیا اور جو تم سے پہلے نازل کیا گیا اور وہ آخرت پر یقین رکھتے ہیں ۔                    ",
            "ayatNumber": 4
          },
          {
            "arabic": "اُولٰٓىٕكَ عَلٰى هُدًى مِّنْ رَّبِّهِمْۗ-وَ اُولٰٓىٕكَ هُمُ الْمُفْلِحُوْنَ(5)                    ",
            "translation1": "وہی لوگ اپنے رب کی طرف سے ہدایت پر ہیں اور وہی مراد کو پہنچنے والے۔                    ",
            "translation2": "یہی لوگ اپنے رب کی طرف سے ہدایت پر ہیں اوریہی لوگ کامیابی حاصل کرنے والے ہیں ۔                    ",
            "ayatNumber": 5
          },
          {
            "arabic": "اِنَّ الَّذِیْنَ كَفَرُوْا سَوَآءٌ عَلَیْهِمْ ءَاَنْذَرْتَهُمْ اَمْ لَمْ تُنْذِرْهُمْ لَا یُؤْمِنُوْنَ(6)                    ",
            "translation1": "بیشک وہ جن کی قسمت میں کفر ہے انہیں برابر ہے چاہے تم انہیں ڈراؤیا نہ ڈراؤ وہ ایمان لانے کے نہیں۔                    ",
            "translation2": "بیشک وہ لوگ جن کی قسمت میں کفر ہے ان کے لئے برابر ہے کہ آپ انہیں ڈرائیں یا نہ ڈرائیں ،یہ ایمان نہیں لائیں گے۔                    ",
            "ayatNumber": 6
          },
          {
            "arabic": "خَتَمَ اللّٰهُ عَلٰى قُلُوْبِهِمْ وَ عَلٰى سَمْعِهِمْؕ-وَ عَلٰۤى اَبْصَارِهِمْ غِشَاوَةٌ٘-وَّ لَهُمْ عَذَابٌ عَظِیْمٌ(7)                    ",
            "translation1": "اللہ نے ان کے دلوں پر اور کانوں پر مہر کردی اور ان کی آنکھوں پر گھٹاٹوپ ہے اور ان کے لئے بڑا عذاب۔                    ",
            "translation2": "اللہ نے ان کے دلوں پر اور ان کے کانوں پر مہرلگادی ہے اور ان کی آنکھوں پرپردہ پڑا ہواہے اور ان کے لئے بہت بڑا عذاب ہے۔                    ",
            "ayatNumber": 7
          },
          {
            "isRuko": true,
            "Surat": 2,
            "rakuNumber": 1,
            "ayaAfterRako": 7,
            "Place": "ﻉ",
            "ayaBeforeRako": 8,
            "Diff": 7,
            "bottomNumber": 1,
            "arabic": null,
            "translation1": null,
            "translation2": null,
            "ayatNumber": null
          },
          {
            "arabic": "وَ مِنَ النَّاسِ مَنْ یَّقُوْلُ اٰمَنَّا بِاللّٰهِ وَ بِالْیَوْمِ الْاٰخِرِ وَ مَا هُمْ بِمُؤْمِنِیْنَﭥ(8)                    ",
            "translation1": "اور کچھ لوگ کہتے ہیں کہ ہم اللہ اور پچھلے دن پر ایمان لائے اور وہ ایمان والے نہیں۔                    ",
            "translation2": "اور کچھ لوگ کہتے ہیں کہ ہم اللہ پر اورآخرت کے دن پر ایمان لے آئے ہیں حالانکہ وہ ایمان والے نہیں ہیں ۔                    ",
            "ayatNumber": 8
          },
          {
            "arabic": "یُخٰدِعُوْنَ اللّٰهَ وَ الَّذِیْنَ اٰمَنُوْا ۚ-وَ مَا یَخْدَعُوْنَ اِلَّاۤ اَنْفُسَهُمْ وَ مَا یَشْعُرُوْنَﭤ(9)                    ",
            "translation1": "فریب دیا چاہتے ہیں اللہ اور ایمان والوں کو اور حقیقت میں فریب نہیں دیتے مگر اپنی جانوں کو اور انہیں شعور نہیں۔                    ",
            "translation2": "یہ لوگ اللہ کو اور ایمان والوں کو فریب دینا چاہتے ہیں حالانکہ یہ صرف اپنے آپ کو فریب دے رہے ہیں اور انہیں شعور نہیں ۔                    ",
            "ayatNumber": 9
          },
          {
            "arabic": "فِیْ قُلُوْبِهِمْ مَّرَضٌۙ-فَزَادَهُمُ اللّٰهُ مَرَضًاۚ-وَ لَهُمْ عَذَابٌ اَلِیْمٌۢ ﳔ بِمَا كَانُوْا یَكْذِبُوْنَ(10)                    ",
            "translation1": "ان کے دلوں میں بیماری ہے تو اللہ نے ان کی بیماری اور بڑھائی اور ان کے لئے دردناک عذاب ہے بدلہ ان کے جھوٹ کا ۔                    ",
            "translation2": "ان کے دلوں میں بیماری ہے تو اللہ نے ان کی بیماری میں اور اضافہ کردیا اور ان کے لئے ان کے جھوٹ بولنے کی وجہ سے دردناک عذاب ہے۔                    ",
            "ayatNumber": 10
          },
          {
            "arabic": "وَ اِذَا قِیْلَ لَهُمْ لَا تُفْسِدُوْا فِی الْاَرْضِۙ-قَالُوْۤا اِنَّمَا نَحْنُ مُصْلِحُوْنَ(11)                    ",
            "translation1": "اورجو اُن سے کہا جائے زمین میں فساد نہ کرو تو کہتے ہیں ہم تو سنوارنے والے ہیں۔                    ",
            "translation2": "اورجب ان سے کہا جائے کہ زمین میں فساد نہ کرو تو کہتے ہیں ہم توصرف اصلاح کرنے والے ہیں ۔                    ",
            "ayatNumber": 11
          },
          {
            "arabic": "اَلَاۤ اِنَّهُمْ هُمُ الْمُفْسِدُوْنَ وَ لٰـكِنْ لَّا یَشْعُرُوْنَ(12)                    ",
            "translation1": "سنتا ہے وہی فسادی ہیں مگر انہیں شعور نہیں۔                    ",
            "translation2": "سن لو:بیشک یہی لوگ فساد پھیلانے والے ہیں مگر انہیں (اس کا)شعور نہیں ۔                    ",
            "ayatNumber": 12
          },
          {
            "arabic": "وَ اِذَا قِیْلَ لَهُمْ اٰمِنُوْا كَمَاۤ اٰمَنَ النَّاسُ قَالُوْۤا اَنُؤْمِنُ كَمَاۤ اٰمَنَ السُّفَهَآءُؕ-اَلَاۤ اِنَّهُمْ هُمُ السُّفَهَآءُ وَ لٰـكِنْ لَّا یَعْلَمُوْنَ(13)                    ",
            "translation1": "اور جب ان سے کہا جائے ایمان لاؤجیسے اور لوگ ایمان لائے ہیں تو کہیں کیا ہم احمقوں کی طرح ایمان لے آئیں؟ سنتا ہے! وہی احمق ہیں مگر جانتے نہیں ۔",
            "translation2": "    اور جب ان سے کہا جائے کہ تم اسی طرح ایمان لاؤ جیسے اور لوگ ایمان لائے توکہتے ہیں :کیا ہم بیوقوفوں کی طرح ایمان لائیں ؟ سن لو: بیشک یہی لوگ بیوقوف ہیں مگر یہ جانتے نہیں ۔                    ",
            "ayatNumber": 13
          },
          {
            "arabic": " وَ اِذَا لَقُوا الَّذِیْنَ اٰمَنُوْا قَالُوْۤا اٰمَنَّاۚۖ-وَ اِذَا خَلَوْا اِلٰى شَیٰطِیْنِهِمْۙ-قَالُوْۤا اِنَّا مَعَكُمْۙ-اِنَّمَا نَحْنُ مُسْتَهْزِءُوْنَ(14)                    ",
            "translation1": "اور جب ایمان والوں سے ملیں تو کہیں ہم ایمان لائے اور جب اپنے شیطانوں کے پاس اکیلے ہوں تو کہیں ہم تمہارے ساتھ ہیں ہم تو یونہی ہنسی کرتے ہیں ۔                    ",
            "translation2": "اور جب یہ ایمان والوں سے ملتے ہیں تو کہتے ہیں :ہم ایمان لاچکے ہیں اور جب اپنے شیطانوں کے پاس تنہائی میں جاتے ہیں تو کہتے ہیں کہ ہم تمہارے ساتھ ہیں ، ہم توصرف ہنسی مذاق کرتے ہیں ۔                    ",
            "ayatNumber": 14
          },
          {
            "arabic": "اَللّٰهُ یَسْتَهْزِئُ بِهِمْ وَ یَمُدُّهُمْ فِیْ طُغْیَانِهِمْ یَعْمَهُوْنَ(15)                    ",
            "translation1": "اللہ ان سے استہزاء فرماتا ہے ( جیسا اس کی شان کے لائق ہے) اور انہیں ڈھیل دیتا ہے کہ اپنی سرکشی میں بھٹکتے رہیں۔                    ",
            "translation2": "اللہ ان کی ہنسی مذاق کا انہیں بدلہ دے گا اور (ابھی)وہ انہیں مہلت دے رہا ہے کہ یہ اپنی سرکشی میں بھٹکتے رہیں ۔                    ",
            "ayatNumber": 15
          },
          {
            "arabic": "اُولٰٓىٕكَ الَّذِیْنَ اشْتَرَوُا الضَّلٰلَةَ بِالْهُدٰى۪-فَمَا رَبِحَتْ تِّجَارَتُهُمْ وَ مَا كَانُوْا مُهْتَدِیْنَ(16)                    ",
            "translation1": "یہ وہ لوگ ہیں جنہوں نے ہدایت کے بدلے گمراہی خریدی تو ان کا سودا کچھ نفع نہ لایا اور وہ سودے کی راہ جانتے ہی نہ تھے ۔                    ",
            "translation2": "یہی وہ لوگ ہیں جنہوں نے ہدایت کے بدلے گمراہی خریدلی تو ان کی تجارت نے کوئی نفع نہ دیا اوریہ لوگ راہ جانتے ہی نہیں تھے۔                    ",
            "ayatNumber": 16
          },
          {
            "arabic": "مَثَلُهُمْ كَمَثَلِ الَّذِی اسْتَوْقَدَ نَارًاۚ-فَلَمَّاۤ اَضَآءَتْ مَاحَوْلَهٗ ذَهَبَ اللّٰهُ بِنُوْرِهِمْ وَ تَرَكَهُمْ فِیْ ظُلُمٰتٍ لَّا یُبْصِرُوْنَ(17)                    ",
            "translation1": "ان کی کہاوت اس کی طرح ہے جس نے آگ روشن کی تو جب اس سے آس پاس سب جگمگا اٹھا اللہ ان کا نور لے گیا اور انہیں اندھیریوں میں چھوڑ دیا کہ کچھ نہیں سوجھتا ۔                    ",
            "translation2": ":ان کی مثال اس شخص کی طرح ہے جس نے آگ روشن کی پھر جب اس آگ نے اس کے آس پاس کو روشن کردیا تواللہ ان کا نور لے گیا اور انہیں تاریکیوں میں چھوڑ دیا،انہیں کچھ دکھائی نہیں دے رہا۔                    ",
            "ayatNumber": 17
          },
          {
            "arabic": "صُمٌّۢ بُكْمٌ عُمْیٌ فَهُمْ لَا یَرْجِعُوْنَ(18)                    ",
            "translation1": "بہرے گونگے اندھے تو وہ پھر آنے والے نہیں۔                    ",
            "translation2": "بہرے، گونگے، اندھے ہیں پس یہ لوٹ کر نہیں آئیں گے۔                    ",
            "ayatNumber": 18
          },
          {
            "arabic": "اَوْ كَصَیِّبٍ مِّنَ السَّمَآءِ فِیْهِ ظُلُمٰتٌ وَّ رَعْدٌ وَّ بَرْقٌۚ-یَجْعَلُوْنَ اَصَابِعَهُمْ فِیْۤ اٰذَانِهِمْ مِّنَ الصَّوَاعِقِ حَذَرَ الْمَوْتِؕ-وَ اللّٰهُ مُحِیْطٌۢ بِالْكٰفِرِیْنَ(19)                    ",
            "translation1": "یا جیسے آسمان سے اترتا پانی کہ اس میں اندھیریاں ہیں اور گرج اور چمک اپنے کانوں میں انگلیاں ٹھونس رہے ہیں کڑک کے سبب موت کے ڈر سے اور اللہ کافروں کو گھیرے ہوئے ہے ۔                    ",
            "translation2": "یا (ان کی مثال) آسمان سے اترنے والی بارش کی طرح ہے جس میں تاریکیاں اور گرج اور چمک ہے ۔ یہ زور دار کڑک کی وجہ سے موت کے ڈر سے اپنے کانوں میں انگلیاں ٹھونس رہے ہیں حالانکہ اللہ کافروں کو گھیرے ہوئے ہے۔                    ",
            "ayatNumber": 19
          },
          {
            "arabic": "یَكَادُ الْبَرْقُ یَخْطَفُ اَبْصَارَهُمْؕ-كُلَّمَاۤ اَضَآءَ لَهُمْ مَّشَوْا فِیْهِۗۙ-وَ اِذَاۤ اَظْلَمَ عَلَیْهِمْ قَامُوْاؕ-وَ لَوْ شَآءَ اللّٰهُ لَذَهَبَ بِسَمْعِهِمْ وَ اَبْصَارِهِمْؕ-اِنَّ اللّٰهَ عَلٰى كُلِّ شَیْءٍ قَدِیْرٌ(20)                    ",
            "translation1": "بجلی یوں معلوم ہوتی ہے کہ ان کی نگاہیں اچک لے جائے گی جب کچھ چمک ہوئی اس میں چلنے لگے اور جب اندھیرا ہوا کھڑے رہ گئے اور اللہ چاہتا تو ان کے کان اور آنکھیں لے جاتا بیشک اللہ سب کچھ کرسکتا ہے۔                    ",
            "translation2": "بجلی یوں معلوم ہوتی ہے کہ ان کی نگاہیں اچک کرلے جائے گی۔ (حالت یہ کہ)جب کچھ روشنی ہوئی تو اس میں چلنے لگے اور جب ان پر اندھیرا چھا گیا تو کھڑے رہ گئے اور اگراللہ چاہتا تو ان کے کان اور آنکھیں سلَب کر لیتا۔ بیشک اللہ ہر شے پر قادرہے۔                    ",
            "ayatNumber": 20
          },
          {
            "isRuko": true,
            "Surat": 2,
      "rakuNumber": 2,
      "ayaAfterRako": 20,
      "Place": "ﻉ",
      "ayaBeforeRako": 21,
      "Diff": 13,
      "bottomNumber": 2,
            "arabic": null,
            "translation1": null,
            "translation2": null,
            "ayatNumber": null
          },
          {
            "arabic": "یٰۤاَیُّهَا النَّاسُ اعْبُدُوْا رَبَّكُمُ الَّذِیْ خَلَقَكُمْ وَ الَّذِیْنَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُوْنَ(21)                    ",
            "translation1": "اے لوگو اپنے رب کو پوجو جس نے تمہیں اور تم سے اگلوں کو پیدا کیا یہ امید کرتے ہوئے کہ تمہیں پرہیزگاری ملے ۔                    ",
            "translation2": "اے لوگو!اپنے رب کی عبادت کرو جس نے تمہیں اور تم سے پہلے لوگوں کو پیدا کیا۔ یہ امید کرتے ہوئے(عبادت کرو) کہ تمہیں پرہیزگاری مل جائے۔                    ",
            "ayatNumber": 21
          },
          {
            "arabic": "الَّذِیْ جَعَلَ لَكُمُ الْاَرْضَ فِرَاشًا وَّ السَّمَآءَ بِنَآءً۪-وَّ اَنْزَلَ مِنَ السَّمَآءِ مَآءً فَاَخْرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزْقًا لَّكُمْۚ-فَلَا تَجْعَلُوْا لِلّٰهِ اَنْدَادًا وَّ اَنْتُمْ تَعْلَمُوْنَ(22)                    ",
            "translation1": " اورجس نے تمہارے لئے زمین کو بچھونا اور آسمان کو عمارت بنایا اور آسمان سے پانی اتارا تو اس سے کچھ پھل نکالے تمہارے کھانے کو تو اللہ کے لئے جان بوجھ کر برابر والے نہ ٹھہراؤ ۔                    ",
            "translation2": "جس نے تمہارے لئے زمین کو بچھونا اور آسمان کو چھت بنایا اور اس نے آسمان سے پانی اتاراپھر اس پانی کے ذریعے تمہارے کھانے کے لئے کئی پھل پیدا کئے تو تم جان بوجھ کر اللہ کے شریک نہ بناؤ۔                    ",
            "ayatNumber": 22
          },
          {
            "arabic": "وَ اِنْ كُنْتُمْ فِیْ رَیْبٍ مِّمَّا نَزَّلْنَا عَلٰى عَبْدِنَا فَاْتُوْا بِسُوْرَةٍ مِّنْ مِّثْلِهٖ۪-وَ ادْعُوْا شُهَدَآءَكُمْ مِّنْ دُوْنِ اللّٰهِ اِنْ كُنْتُمْ صٰدِقِیْنَ(23)                    ",
            "translation1": "اور اگر تمہیں کچھ شک ہو اس میں جو ہم نے اپنے ان خاص بندے پر اتارا تو اس جیسی ایک سورت تو لے آؤ اور اللہ کے سوا اپنے سب حمائتیوں کو بلالو اگر تم سچے ہو۔                    ",
            "translation2": "اور اگر تمہیں اس کتاب کے بارے میں کوئی شک ہو جو ہم نے اپنے خاص بندے پرنازل کی ہے تو تم اس جیسی ایک سورت بنالاؤ اور اللہ کے علاوہ اپنے سب مددگاروں کو بلالو اگر تم سچے ہو۔                    ",
            "ayatNumber": 23
          },
          {
            "arabic": "فَاِنْ لَّمْ تَفْعَلُوْا وَ لَنْ تَفْعَلُوْا فَاتَّقُوا النَّارَ الَّتِیْ وَ قُوْدُهَا النَّاسُ وَ الْحِجَارَةُ ۚۖ-اُعِدَّتْ لِلْكٰفِرِیْنَ(24)                    ",
            "translation1": "پھر اگر نہ لا سکو اور ہم فرمائے دیتے ہیں کہ ہر گز نہ لا سکو گے تو ڈرو اس آگ سے جس کا ایندھن آدمی اور پتھر ہیں تیار رکھی ہے کافروں کے لیے ۔                    ",
            "translation2": "پھر اگر تم یہ نہ کرسکواور تم ہر گز نہ کرسکو گے تو اس آگ سے ڈروجس کا ایندھن آدمی اور پتھر ہیں ۔ وہ کافروں کے لئے تیار کی گئی ہے۔                    ",
            "ayatNumber": 24
          },
          {
            "arabic": "وَ بَشِّرِ الَّذِیْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ اَنَّ لَهُمْ جَنّٰتٍ تَجْرِیْ مِنْ تَحْتِهَا الْاَنْهٰرُؕ-كُلَّمَا رُزِقُوْا مِنْهَا مِنْ ثَمَرَةٍ رِّزْقًاۙ-قَالُوْا هٰذَا الَّذِیْ رُزِقْنَا مِنْ قَبْلُۙ-وَ اُتُوْا بِهٖ مُتَشَابِهًاؕ-وَ لَهُمْ فِیْهَاۤ اَزْوَاجٌ مُّطَهَّرَةٌۗۙ-وَّ هُمْ فِیْهَا خٰلِدُوْنَ(25)                    ",
            "translation1": "اور خوشخبری دے انہیں جو ایمان لائے اور اچھے کام کیے کہ ان کے لیے باغ ہیں جن کے نیچے نہریں رواں جب انہیں ان باغوں سے کوئی پھل کھانے کو دیا جائے گاصورت دیکھ کر کہیں گے یہ تو وہی رزق ہے جو ہمیں پہلے ملا تھا اور وہ صورت میں ملتا جلتا انہیں دیا گیا اور ان کے لیے ان باغوں میں ستھری بیبیاں ہیں اور وہ ان میں ہمیشہ رہیں گے ۔                    ",
            "translation2": "اور ان لوگوں کوخوشخبری دو جو ایمان لائے اورانہوں نے اچھے عمل کئے کہ ان کے لئے ایسے باغات ہیں جن کے نیچے نہریں بہہ رہی ہیں ۔جب انہیں ان باغوں سے کوئی پھل کھانے کو دیا جائے گا تو کہیں گے، یہ تو وہی رزق ہے جو ہمیں پہلے دیا گیاتھا حالانکہ انہیں ملتا جلتا پھل (پہلے )دیا گیا تھا اور ان (جنتیوں )کے لئے ان باغوں میں پاکیزہ بیویاں ہوں گی اور وہ ان باغوں میں ہمیشہ رہیں گے۔                    ",
            "ayatNumber": 25
          },
          {
            "arabic": "اِنَّ اللّٰهَ لَا یَسْتَحْیٖۤ اَنْ یَّضْرِبَ مَثَلًا مَّا بَعُوْضَةً فَمَا فَوْقَهَاؕ-فَاَمَّا الَّذِیْنَ اٰمَنُوْا فَیَعْلَمُوْنَ اَنَّهُ الْحَقُّ مِنْ رَّبِّهِمْۚ-وَ اَمَّا الَّذِیْنَ كَفَرُوْا فَیَقُوْلُوْنَ مَا ذَاۤ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًاۘ-یُضِلُّ بِهٖ كَثِیْرًاۙ-وَّ یَهْدِیْ بِهٖ كَثِیْرًاؕ-وَ مَا یُضِلُّ بِهٖۤ اِلَّا الْفٰسِقِیْنَ(26)                    ",
            "translation1": "بیشک اللہ اس سے حیا نہیں فرماتا کہ مثال سمجھانے کو کیسی ہی چیز کا ذکر فرمائے مچھر ہو یا اس سے بڑھ کر تو وہ جو ایمان لائے وہ تو جانتے ہیں کہ یہ ان کے رب کی طرف سے حق ہے رہے کافر وہ کہتے ہیں ایسی کہاوت میں اللہ کا کیا مقصود ہے اللہ بہتیروں کو اس سے گمراہ کرتا ہے اور بہتیروں کو ہدایت فرماتا ہے اور اس سے انہیں گمراہ کرتا ہے جو بے حکم ہیں ۔                    ",
            "translation2": "بیشک اللہ اس سے حیا نہیں فرماتا کہ مثال سمجھانے کے لئے کیسی ہی چیز کا ذکر فرمائے مچھر ہو یا اس سے بڑھ کر۔ بہرحال ایمان والے تو جانتے ہیں کہ یہ ان کے رب کی طرف سے حق ہے اور رہے کافر تو وہ کہتے ہیں ، اس مثال سے اللہ کی مراد کیا ہے؟ اللہ بہت سے لوگوں کواس کے ذریعے گمراہ کرتا ہے اور بہت سے لوگوں کو ہدایت عطا فرماتا ہے اور وہ اس کے ذریعے صرف نافرمانوں ہی کو گمراہ کرتا ہے۔                    ",
            "ayatNumber": 26
          },
          {
            "arabic": "الَّذِیْنَ یَنْقُضُوْنَ عَهْدَ اللّٰهِ مِنْۢ بَعْدِ مِیْثَاقِهٖ۪-وَ یَقْطَعُوْنَ مَاۤ اَمَرَ اللّٰهُ بِهٖۤ اَنْ یُّوْصَلَ وَ یُفْسِدُوْنَ فِی الْاَرْضِؕ-اُولٰٓىٕكَ هُمُ الْخٰسِرُوْنَ(27)                    ",
            "translation1": "وہ جو اللہ کے عہد کو توڑ دیتے ہیں پکا ہونے کے بعد اور کاٹتے ہیں اُس چیز کو جس کے جوڑنے کا خدا نے حکم دیا اور زمین میں فساد پھیلاتے ہیں وہی نقصان میں ہیں۔                    ",
            "translation2": "وہ لوگ جو اللہ کے وعدے کو پختہ ہونے کے بعد توڑ ڈالتے ہیں اوراس چیز کو کاٹتے ہیں جس کے جوڑنے کااللہ نے حکم دیا ہے اور زمین میں فساد پھیلاتے ہیں تو یہی لوگ نقصان اٹھانے والے ہیں ۔                    ",
            "ayatNumber": 27
          },
          {
            "arabic": "كَیْفَ تَكْفُرُوْنَ بِاللّٰهِ وَ كُنْتُمْ اَمْوَاتًا فَاَحْیَاكُمْۚ-ثُمَّ یُمِیْتُكُمْ ثُمَّ یُحْیِیْكُمْ ثُمَّ اِلَیْهِ تُرْجَعُوْنَ(28)                    ",
            "translation1": "بھلا تم کیوں کر خدا کے منکر ہو گے حالانکہ تم مردہ تھے اس نے تمہیں جِلایا پھر تمہیں مارے گا پھر تمہیں جِلائے گا پھر اسی کی طرف پلٹ کر جاؤ گے ۔                    ",
            "translation2": "تم کیسے اللہ کے منکر ہوسکتے ہو حالانکہ تم مردہ تھے تواس نے تمہیں پیدا کیا پھر وہ تمہیں موت دے گا پھر تمہیں زندہ کرے گا پھر اسی کی طرف تمہیں لوٹایا جائے گا۔                    ",
            "ayatNumber": 28
          },
          {
            "arabic": "هُوَ الَّذِیْ خَلَقَ لَكُمْ مَّا فِی الْاَرْضِ جَمِیْعًاۗ-ثُمَّ اسْتَوٰۤى اِلَى السَّمَآءِ فَسَوّٰىهُنَّ سَبْعَ سَمٰوٰتٍؕ-وَ هُوَ بِكُلِّ شَیْءٍ عَلِیْمٌ(29)                    ",
            "translation1": "وہی ہے جس نے تمہارے لئے بنایا جو کچھ زمین میں ہے پھر آسمان کی طرف اِسْتِوا (قصد) فرمایا تو ٹھیک سات آسمان بنائے اور وہ سب کچھ جانتا ہے ۔                    ",
            "translation2": "وہی ہے جس نے جو کچھ زمین میں ہے سب تمہارے لئے بنایا پھر اس نے آسمان کے بنانے کاقصد فرمایا تو ٹھیک سات آسمان بنائے اوروہ ہر شے کا خوب علم رکھتا ہے۔                    ",
            "ayatNumber": 29
          },
          {
            "isRuko": true,
            "Surat": 2,
            "rakuNumber": 3,
            "ayaAfterRako": 29,
            "Place": "ﻉ",
            "ayaBeforeRako": 30,
            "Diff": 9,
            "bottomNumber": 3,
            "arabic": null,
            "translation1": null,
            "translation2": null,
            "ayatNumber": null
          },
          {
            "arabic": "وَ اِذْ قَالَ رَبُّكَ لِلْمَلٰٓىٕكَةِ اِنِّیْ جَاعِلٌ فِی الْاَرْضِ خَلِیْفَةًؕ-قَالُوْۤا اَتَجْعَلُ فِیْهَا مَنْ یُّفْسِدُ فِیْهَا وَ یَسْفِكُ الدِّمَآءَۚ-وَ نَحْنُ نُسَبِّحُ بِحَمْدِكَ وَ نُقَدِّسُ لَكَؕ-قَالَ اِنِّیْۤ اَعْلَمُ مَا لَا تَعْلَمُوْنَ(30)                    ",
            "translation1": "اور یاد کرو جب تمہارے رب نے فرشتوں سے فرمایامیں زمین میں اپنا نائب بنانے والا ہوں بولے کیا ایسے کو نائب کرے گا جو اس میں فساد پھیلائے اور خونریزیاں کرے اور ہم تجھے سراہتے ہوئے تیری تسبیح کرتے اور تیری پاکی بولتے ہیں فرمایا مجھے معلوم ہے جو تم نہیں جانتے ۔                    ",
            "translation2": "اور یاد کرو جب تمہارے رب نے فرشتوں سے فرمایا: میں زمین میں اپنا نائب بنانے والا ہوں تو انہوں نے عرض کیا : کیا تو زمین میں اسے نائب بنائے گا جو اس میں فساد پھیلائے گا اور خون بہائے گاحالانکہ ہم تیری حمد کرتے ہوئے تیری تسبیح کرتے ہیں اور تیری پاکی بیان کرتے ہیں ۔ فرمایا:بیشک میں وہ جانتاہوں جو تم نہیں جانتے۔                    ",
            "ayatNumber": 30
          },
          {
            "arabic": "وَ عَلَّمَ اٰدَمَ الْاَسْمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمْ عَلَى الْمَلٰٓىٕكَةِۙ-فَقَالَ اَنْۢبِـٴُـوْنِیْ بِاَسْمَآءِ هٰۤؤُلَآءِ اِنْ كُنْتُمْ صٰدِقِیْنَ(31)                    ",
            "translation1": "اور اللہ تعالیٰ نے آدم کو تمام اشیاء کے نام سکھائے پھر سب اشیاء ملائکہ پر پیش کرکے فرمایا سچے ہو تو ان کے نام تو بتاؤ ۔                    ",
            "translation2": "اور اللہ تعالیٰ نے آدم کو تمام اشیاء کے نام سکھادیے پھر ان سب اشیاء کو فرشتوں کے سامنے پیش کرکے فرمایا: اگر تم سچے ہو تو ان کے نام تو بتاؤ۔                    ",
            "ayatNumber": 31
          },
          {
            "arabic": "قَالُوْا سُبْحٰنَكَ لَا عِلْمَ لَنَاۤ اِلَّا مَا عَلَّمْتَنَاؕ-اِنَّكَ اَنْتَ الْعَلِیْمُ الْحَكِیْمُ(32)                    ",
            "translation1": "بولے پاکی ہے تجھے ہمیں کچھ علم نہیں مگر جتنا تو نے ہمیں سکھایا بے شک تو ہی علم و حکمت والا ہے ۔                    ",
            "translation2": "۔(فرشتوں نے)عرض کی: (اے اللہ !)تو پاک ہے ۔ ہمیں تو صرف اتنا علم ہے جتنا تو نے ہمیں سکھا دیا ، بے شک تو ہی علم والا، حکمت والا ہے۔                    ",
            "ayatNumber": 32
          },
          {
            "arabic": "قَالَ یٰۤاٰدَمُ اَنْۢبِئْهُمْ بِاَسْمَآىٕهِمْۚ-فَلَمَّاۤ اَنْۢبَاَهُمْ بِاَسْمَآىٕهِمْۙ-قَالَ اَلَمْ اَقُلْ لَّكُمْ اِنِّیْۤ اَعْلَمُ غَیْبَ السَّمٰوٰتِ وَ الْاَرْضِۙ-وَ اَعْلَمُ مَا تُبْدُوْنَ وَ مَا كُنْتُمْ تَكْتُمُوْنَ(33)                    ",
            "translation1": "فرمایا اے آدم بتادے انہیں سب اشیاء کے نام جب آدم نے انہیں سب کے نام بتادئیے فرمایا میں نہ کہتا تھا کہ میں جانتا ہوں آسمانوں اور زمین کی سب چھپی چیزیں اور میں جانتا ہوں جو کچھ تم ظاہر کرتے اور جو کچھ تم چھپاتے ہو ۔                    ",
            "translation2": "۔(پھر اللہ نے)فرمایا: اے آدم!تم انہیں ان اشیاء کے نام بتادو۔ تو جب آدم نے انہیں ان اشیاء کے نام بتادیئے تو(اللہ نے)فرمایا :(اے فرشتو!)کیا میں نے تمہیں نہ کہا تھا کہ میں آسمانوں اور زمین کی تمام چھپی چیزیں جانتا ہوں اور میں جانتا ہوں جو کچھ تم ظاہر کرتے اور جو کچھ تم چھپاتے ہو۔                    ",
            "ayatNumber": 33
          },
          {
            "arabic": "وَ اِذْ قُلْنَا لِلْمَلٰٓىٕكَةِ اسْجُدُوْا لِاٰدَمَ فَسَجَدُوْۤا اِلَّاۤ اِبْلِیْسَؕ-اَبٰى وَ اسْتَكْبَرَ ﱪ وَ كَانَ مِنَ الْكٰفِرِیْنَ(34)                    ",
            "translation1": "اور یاد کرو جب ہم نے فرشتوں کو حکم دیا کہ آدم کو سجدہ کرو تو سب نے سجدہ کیا سوائے ابلیس کے منکر ہوا اور غرور کیا اور کافر ہوگیا۔                    ",
            "translation2": "اوریاد کروجب ہم نے فرشتوں کو حکم دیا کہ آدم کو سجدہ کرو تو ابلیس کے علاوہ سب نے سجدہ کیا ۔اس نے انکار کیا اور تکبرکیا اور کافر ہوگیا۔                    ",
            "ayatNumber": 34
          },
          {
            "arabic": "وَ قُلْنَا یٰۤاٰدَمُ اسْكُنْ اَنْتَ وَ زَوْجُكَ الْجَنَّةَ وَ كُلَا مِنْهَا رَغَدًا حَیْثُ شِئْتُمَا۪-وَ لَا تَقْرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوْنَا مِنَ الظّٰلِمِیْنَ(35)                    ",
            "translation1": "اور ہم نے فرمایا اے آدم تو اور تیری بی بی اس جنت میں رہو اور کھاؤ اس میں سے بے روک ٹوک جہاں تمہارا جی چاہے مگر اس پیڑ کے پاس نہ جانا کہ حد سے بڑھنے والوں میں ہوجاؤ گے ۔                    ",
            "translation2": "اور ہم نے فرمایا: اے آدم!تم اورتمہاری بیوی جنت میں رہو اوربغیر روک ٹوک کے جہاں تمہارا جی چاہے کھاؤ البتہ اس درخت کے قریب نہ جانا ورنہ حد سے بڑھنے والوں میں شامل ہوجاؤ گے۔                    ",
            "ayatNumber": 35
          },
          {
            "arabic": "فَاَزَلَّهُمَا الشَّیْطٰنُ عَنْهَا فَاَخْرَجَهُمَا مِمَّا كَانَا فِیْهِ۪-وَ قُلْنَا اهْبِطُوْا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّۚ-وَ لَكُمْ فِی الْاَرْضِ مُسْتَقَرٌّ وَّ مَتَاعٌ اِلٰى حِیْنٍ(36)                    ",
            "translation1": "تو شیطان نے جنت سے انہیں لغزش دی اور جہاں رہتے تھے وہاں سے انہیں الگ کردیا اور ہم نے فرمایا نیچے اترو آپس میں ایک تمہارا دوسرے کا دشمن اور تمہیں ایک وقت تک زمین میں ٹھہرنا اور برتنا ہے ۔                    ",
            "translation2": "توشیطان نے ان دونوں کو جنت سے لغزش دی پس انہیں وہاں سے نکلوا دیا جہاں وہ رہتے تھے اور ہم نے فرمایا :تم نیچے اترجاؤ۔ تم ایک دوسرے کے دشمن بنو گے اور تمہارے لئے ایک خاص وقت تک زمین میں ٹھکانہ اور (زندگی گزارنے کا)سامان ہے۔                    ",
            "ayatNumber": 36
          },
          {
            "arabic": "فَتَلَقّٰۤى اٰدَمُ مِنْ رَّبِّهٖ كَلِمٰتٍ فَتَابَ عَلَیْهِؕ-اِنَّهٗ هُوَ التَّوَّابُ الرَّحِیْمُ(37)                    ",
            "translation1": "پھر سیکھ لیے آدم نے اپنے رب سے کچھ کلمے تو اللہ نے اس کی توبہ قبول کی بیشک وہی ہے بہت توبہ قبول کرنے والا مہربان۔                    ",
            "translation2": "پھر آدم نے اپنے رب سے کچھ کلمات سیکھ لئے تو اللہ نے اس کی توبہ قبول کی۔ بیشک وہی بہت توبہ قبول کرنے والا بڑامہربان ہے۔                    ",
            "ayatNumber": 37
          },
          {
            "arabic": "قُلْنَا اهْبِطُوْا مِنْهَا جَمِیْعًاۚ-فَاِمَّا یَاْتِیَنَّكُمْ مِّنِّیْ هُدًى فَمَنْ تَبِـعَ هُدَایَ فَلَا خَوْفٌ عَلَیْهِمْ وَ لَا هُمْ یَحْزَنُوْنَ(38)                    ",
            "translation1": "ہم نے فرمایا تم سب جنت سے اتر جاؤ پھر اگر تمہارے پاس میری طرف سے کوئی ہدایت آئے تو جو میری ہدایت کا پیرو ہوا اسے نہ کوئی اندیشہ نہ کچھ غم۔                    ",
            "translation2": "ہم نے فرمایا: تم سب جنت سے اتر جاؤ پھر اگر تمہارے پاس میری طرف سے کوئی ہدایت آئے تو جو میری ہدایت کی پیروی کریں گے انہیں نہ کوئی خوف ہوگا اور نہ وہ غمگین ہوں گے۔                    ",
            "ayatNumber": 38
          },
          {
            "arabic": "وَ الَّذِیْنَ كَفَرُوْا وَ كَذَّبُوْا بِاٰیٰتِنَاۤ اُولٰٓىٕكَ اَصْحٰبُ النَّارِۚ-هُمْ فِیْهَا خٰلِدُوْنَ(39)                    ",
            "translation1": "اور وہ جو کفر کریں اور میری آیتیں جھٹلائیں گے وہ دوزخ والے ہیں ان کو ہمیشہ اس میں رہنا۔                    ",
            "translation2": "اور وہ جو کفر کریں اور میری آیتیں جھٹلائیں گے وہ دوزخ والے ہیں ان کو ہمیشہ اس میں رہنا۔                    ",
            "ayatNumber": 39
          },
          {
            "isRuko": true,
            "Surat": 2,
            "rakuNumber": 4,
            "ayaAfterRako": 39,
            "Place": "ﻉ",
            "ayaBeforeRako": 40,
            "Diff": 10,
            "bottomNumber": 4,
            "arabic": null,
            "translation1": null,
            "translation2": null,
            "ayatNumber": null
          },
          {
            "arabic": "یٰبَنِیْۤ اِسْرَآءِیْلَ اذْكُرُوْا نِعْمَتِیَ الَّتِیْۤ اَنْعَمْتُ عَلَیْكُمْ وَ اَوْفُوْا بِعَهْدِیْۤ اُوْفِ بِعَهْدِكُمْۚ-وَ اِیَّایَ فَارْهَبُوْنِ(40)                    ",
            "translation1": " اے یعقوب کی اولاد یاد کرو میرا وہ احسان جو میں نے تم پر کیا اور میرا عہد پورا کرو میں تمہارا عہد پورا کروں گا اور خاص میرا ہی ڈر رکھو ۔                    ",
            "translation2": "اے یعقوب کی اولاد! یاد کرو میرا وہ احسان جو میں نے تم پر کیا اور میراعہد پورا کرو میں تمہاراعہد پورا کروں گا اورصرف مجھ سے ڈرو۔                    ",
            "ayatNumber": 40
          },
          {
            "arabic": "وَ اٰمِنُوْا بِمَاۤ اَنْزَلْتُ مُصَدِّقًا لِّمَا مَعَكُمْ وَ لَا تَكُوْنُوْۤا اَوَّلَ كَافِرٍۭ بِهٖ۪-وَ لَا تَشْتَرُوْا بِاٰیٰتِیْ ثَمَنًا قَلِیْلًا٘-وَّ اِیَّایَ فَاتَّقُوْنِ(41)                    ",
            "translation1": "اور ایمان لاؤ اس پر جو میں نے اتارا اس کی تصدیق کرتا ہوا جو تمہارے ساتھ ہے اور سب سے پہلے اس کے منکر نہ بنو اور میری آیتوں کے بدلے تھوڑے دام نہ لو اور مجھی سے ڈرو۔                    ",
            "translation2": "اور ایمان لاؤ اس (کتاب )پر جو میں نے اتاری ہے وہ تمہارے پاس موجود کتاب کی تصدیق کرنے والی ہے اور سب سے پہلے اس کا انکار کرنے والے نہ بنو اور میری آیتوں کے بدلے تھوڑی قیمت نہ وصول کرواور مجھ ہی سے ڈرو۔                    ",
            "ayatNumber": 41
          },
          {
            "arabic": "وَ لَا تَلْبِسُوا الْحَقَّ بِالْبَاطِلِ وَ تَكْتُمُوا الْحَقَّ وَ اَنْتُمْ تَعْلَمُوْنَ(42)                    ",
            "translation1": "اور حق سے باطل کو نہ ملاؤ اور دیدہ و دانستہ حق نہ چھپاؤ۔                    ",
            "translation2": "اور حق کو باطل کے ساتھ نہ ملاؤ اورجان بوجھ کر حق نہ چھپاؤ۔                    ",
            "ayatNumber": 42
          },
          {
            "arabic": "وَ اَقِیْمُوا الصَّلٰوةَ وَ اٰتُوا الزَّكٰوةَ وَ ارْكَعُوْا مَعَ الرّٰكِعِیْنَ(43)                    ",
            "translation1": "اور نماز قائم رکھو اور زکوٰۃ دو اور رکوع کرنے والوں کے ساتھ رکوع کرو ۔                    ",
            "translation2": "اور نماز قائم رکھو اور زکوٰۃ ادا کرو اور رکوع کرنے والوں کے ساتھ رکوع کرو۔                    ",
            "ayatNumber": 43
          },
          {
            "arabic": "اَتَاْمُرُوْنَ النَّاسَ بِالْبِرِّ وَ تَنْسَوْنَ اَنْفُسَكُمْ وَ اَنْتُمْ تَتْلُوْنَ الْكِتٰبَؕ-اَفَلَا تَعْقِلُوْنَ(44)                    ",
            "translation1": "کیا لوگوں کو بھلائی کا حکم دیتے ہو اور اپنی جانوں کو بھولتے ہو حالانکہ تم کتاب پڑھتے ہو تو کیا تمہیں عقل نہیں ۔                    ",
            "translation2": "کیا تم لوگوں کو بھلائی کا حکم دیتے ہو اوراپنے آپ کو بھولتے ہو حالانکہ تم کتاب پڑھتے ہو تو کیا تمہیں عقل نہیں ۔                    ",
            "ayatNumber": 44
          },
          {
            "arabic": "وَ اسْتَعِیْنُوْا بِالصَّبْرِ وَ الصَّلٰوةِؕ-وَ اِنَّهَا لَكَبِیْرَةٌ اِلَّا عَلَى الْخٰشِعِیْنَ(45)                    ",
            "translation1": "اور صبر اور نماز سے مدد چاہو اور بیشک نماز ضرور بھاری ہے مگر ان پر جو دل سے میری طرف جھکتے ہیں ۔                    ",
            "translation2": "اور صبر اور نماز سے مددحاصل کرواور بیشک نماز ضرور بھاری ہے مگر ان پر جو دل سے میری طرف جھکتے ہیں ۔                    ",
            "ayatNumber": 45
          },
          {
            "arabic": "الَّذِیْنَ یَظُنُّوْنَ اَنَّهُمْ مُّلٰقُوْا رَبِّهِمْ وَ اَنَّهُمْ اِلَیْهِ رٰجِعُوْنَ(46)                    ",
            "translation1": "جنہیں یقین ہے کہ انہیں اپنے رب سے ملنا ہے اور اسی کی طرف پھرنا ۔                    ",
            "translation2": "جنہیں یقین ہے کہ انہیں اپنے رب سے ملنا ہے اور انہیں اسی کی طرف لوٹ کر جانا ہے۔                    ",
            "ayatNumber": 46
          },
          {
            "isRuko": true,
            "Surat": 2,
            "rakuNumber": 5,
            "ayaAfterRako": 46,
            "Place": "ﻉ",
            "ayaBeforeRako": 47,
            "Diff": 7,
            "bottomNumber": 5,
            "arabic": null,
            "translation1": null,
            "translation2": null,
            "ayatNumber": null
          }
          
        ]}
      ]
      }
    ]
    }