const duaData = [
  {
    "title":"سوتے وقت کی دعا",
    "arabic":"اَللّٰھُمَّ بِاسْمِکَ اَمُوْتُ وَاَحْیٰی۔",
    "urdu":"اے اللہ ! میں تیرا نام لے کر مرتا اور جیتا ہوں۔"
  },
  {
    "title":"روزہ افطار کرنے کی دعا",
    "arabic":"اَللّٰهُمَّ اِنَّی لَکَ صُمْتُ وَبِکَ اٰمَنْتُ وَعَلَيْکَ تَوَکَّلْتُ وَعَلٰی رِزْقِکَ اَفْطَرْتُ.",
    "urdu":"’’اے اللہ!میں نے تیری خاطر روزہ رکھا اور تیرے اوپر ایمان لایا اور تجھ پر بھروسہ کیا اورتیرے رزق سے اسے کھول رہا ہوں۔‘‘"
  },
  {
    "title":"روزہ رکھنے کی نیت",
    "arabic":"وَبِصَوْمِ غَدٍ نَّوَيْتُ مِنْ شَهْرِ رَمَضَانَ.",
    "urdu":"’’اورمیں نے ماہ رمضان کے کل کے روزے کی نیت کی.‘‘"
  },
  {
    "title":"جلنے کے بعد کی دعا",
    "arabic":"أَذْهِبِ الْبَأْسَ رَبَّ النَّاسِ اشْفِ أَنْتَ الشَّافِي لَا شَافِيَ إِلَّا أَنْتَ",
    "urdu":"اے اللہ! تو تمام لوگوں کا رب ہے، بیماری کو دور کر دے اور اسے شفا عطا فرما، تو ہی شفا دینے والا ہے، تیر ی شفاع کے علاوہ اور کوئی شفاع نہیں۔"
  },
  {
    "title":"زندگی اور موت کی دعا",
    "arabic":"اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرٌ لِي وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرَاً لِي",
    "urdu":"اے اللہ! جب تک میرے لیے زندگی بہتر ہے مجھے زندہ رکھیو اور جب میرے لیے موت بہتر ہو تو مجھے اٹھا لیجیو۔"
  },
  {
    "title":"درد اور بخار کی دعا",
    "arabic":"بِسْمِ اللَّهِ الْكَبِيرِ أَعُوذُ بِاللَّهِ الْعَظِيمِ مِنْ شَرِّ كُلِّ عَرَقٍ نَعَّارٍ وَمِنْ شَرِّ حَرِّ النَّارِ",
    "urdu":"شروع اللہ کے نام سے جو کبریائی والا ہے اور میں اس اللہ کی پناہ میں آتا ہوں جو عظمت والا ہے پھڑکتی رگ اور آگ کی گرمی سے"
  },
  {
    "title":"آنکھ میں درد کی دعا",
    "arabic":"اللَّهُمَّ مَتِّعْنِي بِبَصَرِي وَاجْعَلْهُ الْوَارِثَ مِنِّي وَأَرِنِي فِي الْعَدُوِّ ثَأْرِي وَانْصُرْنِي عَلَى مَنْ ظَلَمَنِي",
    "urdu":"اے اللہ! میری بینائی سے مجھے نفع پہنچا اور میرے مرتے دم تک اسے باقی رکھ اور دشمن میں میر ا نتقام مجھے دکھا اور جس نے مجھ پر ظلم کیا اس کے مقابلے میں میری مدد فرما۔"
  },
  {
    "title":"استخارہ کی دعا",
    "arabic":"اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ وَتَعْلَمُ وَلَا أَعْلَمُ وَأَنْتَ عَلَّامُ الْغُيُوبِ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ ارْضِنِي بِهِ",
    "urdu":"اے اللہ! بے شک میں تجھ سے تیرے علم کے ساتھ بھلائی طلب کرتا ہوں اور تجھ سے تیری قدرت کے ساتھ طاقت طلب کرتا ہوں اور میں تجھ سے تیرے فضل عظیم کا سوال کرتا ہوں کیونکہ تو قدرت رکھتا ہے اور میں قدرت نہیں رکھتا ، تو جانتا ہے اور میں نہہیں جانتا اور تو غیبوں کو خوب جانتا ہے۔ اے اللہ اگر تو جانتا ہے کہ بے شک یہ کا م (اس کام کا نام لے) میرے لئے میرے دین ، میرے معاش اور میرے انجا م کار کے لحاظ سے بہتر ہے تو اس کا میرے حق میں فیصلہ کر دے اور اسے میرے لئے آسان کر دے ، پھر میرے لئے اس میں برکت ڈال دے اور اگر تو جانتا ہے کہ بے شک یہ کام (اس کام کا نام لے) میرے لئے میرے دین، میرے معاش اور میرے انجام کارکے لحاظ سے برا ہے تو اسے مجھ سے دور کر دے اور مجھے اس سے دور کر دے اور میرے لئے بھلائی کا فیصلہ کر دے جہاں بھی وہ ہو ، پھر مجھے اس پر راضی کر دے ۔"
  },
  {
    "title":"کوئی چیز گم ہ جانے کے بعد کی دعا",
    "arabic":"اللَّهُمَّ رَادَّ الضَّالَّةِ وَهَادِي الضَّالَّةِ أَنْتَ تَهْدِي مِنَ الضَّلَالَةِ ارْدُدْ عَلَيَّ ضَالَّتِي بِقُدْرَتِكَ وَسُلْطَانِكَ فَإِنَّهَا مِنْ عَطَائِكَ وَفَضْلِكَ",
    "urdu":""
  },
  {
    "title":"بارش کے وقت کی دعا",
    "arabic":"اللَّهُمَّ صَيِّبَاً نَافِعَاً",
    "urdu":"اے اللہ اسے نفع دینے والی بارش بنا دے"
  },
  {
    "title":"بجلی کی کڑک کے وقت کی دعا",
    "arabic":"اللَّهُمَّ لَا تَقْتُلْنَا بِغَضَبِكَ وَلَا تُهْلِكْنَا بِعَذَابِكَ وَعَافِنَا قَبْلَ ذَلِكَ",
    "urdu":""
  },
  {
    "title":"رزق میں برکت کی دعا",
    "arabic":"اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ وَعَلَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَعَلَى الْمُسْلِمِينَ وَالْمُسْلِمَاتِ",
    "urdu":""
  },
  {
    "title":"قربانی کے وقت کی دعا",
    "arabic":"إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّماَوَاتِ وَالأَرْضَ مِلَّةَ إِبْرَاهِيمَ حَنِيفَاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ . إِنَّ صَلاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ العَالَمِينَ لاَ شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا أَوَّلُ المُسْلِمِينَ ، اللَّهُمَّ مِنْكَ وَلَكَ",
    "urdu":""
  },
  {
    "title":"آب زم زم پیتے وقت کی دعا",
    "arabic":"اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمَاً نَافِعَاًً وَرِزْقَاً وَاسِعَاًَ وَشِفَاءً مِنْ كُلِّ دَاءٍ",
    "urdu":"الٰہی عزوجل میں تجھ سے علم نافع کا اور رزق کی کشادگی کا اور بیماری سے شفایابی کا سوال کرتا ہوں۔"
  },

  {
    "title":"چھینک آنے پر الحمد للہ کہنے والے کے لئے دعا",
    "arabic":"يَرْحَمُكَ اللَّهُ",
    "urdu":"اللہ عزوجل تجھ پر رحم کرے۔"
  },
  {
    "title":"کھانے سے پہلے کی دعا",
    "arabic":"بِسْمِ اللَّهِ وَعَلَى بَرَكَةِ اللَّهِ",
    "urdu":"میں نے الله کے نام کے ساتھ اور الله کی برکت پر کھانا شروع کیا"
  },
  {
    "title":"صبح کی دعا",
    "arabic":"اَصْبَحْنَا وَاَصْبَحَ الْمُلْکُ لِلّٰہِ رَبِّ الْعَالَمِیْنَ اَللّٰھُمَّ اِنِّیْ اَسْاَلُکَ خَیْرَ ھٰذَاالْیَومِ وَفَتْحَہ وَنَصْرَہ وَنُوْرَہ وَبَرَ کَتَہ وَھُدَاہُ وَاَعُوْذُبِکَ مِنْ شَرِّ مَافِیْہِ وَشَرِّ مَابَعْدَہ۔",
    "urdu":"ہم نے اللہ کے ملک میں صبح کی جوتمام جہانوں کا رب ہے، اے اللہ! میں آپ سے سؤال کرتا ہوں اس دن کی بھلائی کا ، فتح ونصرت،نوروبرکت اور ہدایت کا ،اور اس دن کے بعد کی برائیوں سے پناہ مانگتا ہوں۔"
  },
  {
    "title":"گھر سے نکلنے کی دعا",
    "arabic":"بِسْمِ اللّٰہِ تَوَکَّلْتُ عَلَی اللّٰہِ لَاحَوْلَ وَلَاقُوَّةَ اِلَّابِاللّٰہِ۔",
    "urdu":"اللہ تعالیٰ کے نام کے ساتھ گھر سے نکلتا ہوں،اللہ تعالیٰ پر میں نے بھروسہ کیا ،گناہوں سے بچنے اور عبادت کرنے کی توفیق اللہ تعالیٰ ہی دیتے ہیں۔"
  },
  {
    "title":"روزہ افطار کرتے وقت کی دعا",
    "arabic":"اَللّٰھُمَّ لَکَ صُمْتُ وَعَلٰی رِزْقِکَ اَفْطَرْتُ ۔",
    "urdu":"اے اللہ !میں نے تیری رضا کے لئے روزہ رکھا اور تیرے ہی رزق پر افطار کیا ۔"
  },{
    "title":"افطارکرنے کے بعد کی دعا",
    "arabic":"ذَھَبَ الظَّمَأُوَابْتَلَّتِ الْعُرُوْقُ وَثَبَتَ الْاَجْرُ اِنْ شَآئَ اللّٰہُ۔",
    "urdu":"پیاس جاتی رہی اور رگیں تر ہوگئیں اور ثواب ثابت ہوگیا ان شاء اللہ تعالیٰ۔"
  },
  {
    "title":"کھانے کے شروع میں بسم اللہ پڑھنا بھول جائے",
    "arabic":"بِسْمِ اللّٰہِ اَوَّلَہ وَاٰخِرَہ۔",
    "urdu":"اول وآخر اللہ تعالیٰ کے نام ہی سے شروع کرتا ہوں۔"
  },{
    "title":"فرض نماز کے بعد کی دعا",
    "arabic":"اَسْتَغْفِرُاللّٰہَ (ثلٰث مرات) اَللّہُمَّ اَنْتَ السَّلَامُ وَمِنْکَ السَّلَامُ تَبَارَکْتَ یَاذَاالْجَلَالِ وَالْاِکْرَامِ ۔",
    "urdu":"میں اللہ سے معافی مانگتا ہوں (تین مرتبہ کہے) اے اللہ ! تو سلامت رہنے والا ہے اور تجھ سے ہی سلامتی مل سکتی ہے ، تو بابرکت ہے اے بزرگی اور عظمت والے!۔"
  },
  {
    "title":"وضؤ کے بعد کی دعاء",
    "arabic":"اَشْھَدُاَنْ لَّا اِلٰہَ اِلَّا اللّٰہُ وَحْدَہ لَاشَرِیْکَ لَہ وَاَشْھَدُ اَ نَّ مُحَمَّدًا عَبْدُہ وَرَسُوْلُہ اَللّٰہُمَّ اجْعَلْنِیْ مِنَ التَّوَّابِیْنَ وَاجْعَلْنِیْ مِنَ الْمُتَطَھِّرِیْنَ۔",
    "urdu":"میں دل سے اقرار کرتا ہوں کہ اللہ کے سوا کوئی معبود نہیں ،وہ اکیلا ہے ،اس کاکوئی شریک نہیں ،اور اقرار کرتا ہوں کہ بے شک محمدۖ اللہ کے بندے اور اس کے رسول ہیں، اے اللہ ! مجھے تو بہ کرنے والوں میں سے بنادے اور مجھے پاک وصاف لوگوں میں سے کردیجئے۔"
  },
  {
    "title":"اذان کے بعد کی دعا",
    "arabic":"اَللّٰہُمَّ رَبَّ ھٰذِہِ الدَّعْوَةِ التَّآمَّةِ وَالصَّلٰوةِ الْقَآئِمَةِ اٰتِ مُحَمَّدَنِ الْوَسِیْلَةَ وَالْفَضِیْلَةَ وَابْعَثْہُ مَقَامًا مَّحْمُوْدَنِ الَّذِیْ وَعَدْتَّہ ۔",
    "urdu":"یااللہ !اس کامل اعلان اور قائم ہونے والی نماز کے مالک، محمدۖکو مقامِ وسیلہ عطا فرما اور ان کی فضیلت میں اضافہ فرما اور ان کو مقامِ محمود پر پہنچا جس کا تو نے ان سے وعدہ کیا ہے ۔"
  },{
    "title":"مسجد میں داخل ہونے کی دعاء",
    "arabic":"اَللّٰہُمَّ افْتَحْ لِیْ اَبْوَابَ رَحْمَتِکَ۔",
    "urdu":"اے اللہ !میرے لئے اپنی رحمت کے دروازے کھول دیجئے۔"
  },
  {
    "title":"مسجد سے نکلنے کی دعاء",
    "arabic":"اَللّٰھُمَّ اِنِّیْ اَسْئَلُکَ مِنْ فَضْلِکَ ۔",
    "urdu":"اے اللہ !میں آپ کا فضل مانگتا ہوں۔"
  },
  {
    "title":"دودھ پینے کے بعدکی دعاء",
    "arabic":"اَللّٰھُمَّ بَارِکْ لَنَافِیْہِ وَزِدْنَامِنْہُ۔",
    "urdu":"اے اللہ !اس میں ہمارے لئے برکت عطا فرما اوراس سے زیادہ عطا فرما۔"
  },{
    "title":"پسندیدہ چیز دیکھتے وقت کی دعا",
    "arabic":"اَلْحَمْدُ لِلّٰہِ الَّذِیْ بِنِعْمَتِہ تَتِمُّ الصَّالِحَاتُ۔",
    "urdu":"شکر ہے اللہ کا جس کے انعام سے اچھی چیزیں کمال کو پہنچتی ہیں ۔"
  },
  {
    "title":"قبرستان میں داخل ہوتے وقت کی دع",
    "arabic":"اَلسَّلَامُ عَلَیْکُمْ اَھْلَ الدِّیَارِ مِنَ الْمُؤْمِنِیْنَ وَالْمُسْلِمِیْنَ ،وَاِنَّااِنْ شَآئَ اللّٰہُ بِکُمْ لَلاَحِقُوْنَ أَسْأَلُ اللّٰہَ لَنَا وَلَکُمُ الْعَافِیَةَ۔",
    "urdu":"اے مؤمنو !تم پر سلام ہو ،ہم آپ کے پاس جلد آنے والے ہیں ، اپنے لئے اور آپ کے لئے اللہ تعالیٰ سے عافیت وخیریت مانگتے ہیں۔"
  },
  {
    "title":"نیا چاند دیکھنے کی دعا",
    "arabic":"اَللّٰہُ اَکْبَرُ، اَللّٰہُمَّ اَھِلَّہ عَلَیْنَابِالْیُمْنِ وَالْاِیْمَانِ وَالسَّلَامَةِ وَالْاِسْلَامِ ،رَبِّیْ وَرَبُّکَ اللّٰہُ ۔",
    "urdu":"اللہ بہت بڑا ہے ،یااللہ! اس چاند کو ہم پر برکت ، ایمان ، سلامتی اور اسلام کے ساتھ نکالنا ،(اے چاند) میرااور تیرا رب اللہ ہے ۔"
  },{
    "title":"کسی مصیبت زدہ یافاسق کو دیکھے تو یہ دعاء پڑھے",
    "arabic":"اَلْحَمْدُ لِلّٰہِ الَّذِیْ عَافَانِیْ مِمَّاابْتَلاَ کَ بِہ وَفَضَّلَنِیْ عَلٰی کَثِیْرٍ مِّمَّنْ خَلَقَ تَفْضِیْلاً۔",
    "urdu":"تمام تعریفیں اس اللہ تعالیٰ کی ہیں جس نے بچایا مجھے اس مصیبت سے جس میں تجھے مبتلا کیا اور مجھے اپنی مخلوق میں سے بہت ساروں پر فضیلت دی ۔"
  },
  {
    "title":"نکاح کے بعد دولہا اور دلہن کے لئے دعا",
    "arabic":"بَارَکَ اللّٰہُ لَکَ وَبَارَکَ عَلَیْکَ وَجَمَعَ بَیْنَکُمَا فِیْ خَیْرٍ ۔",
    "urdu":"اللہ تعالیٰ آ پ دونوں (زوجین)پر برکتیں نازل فرمائیں اور دونوں کو حسن معاشرت عطافرمائیں۔"
  },
  {
    "title":"صحت ،خیریت اور عافیت کی دعا",
    "arabic":"اَللّٰھُمَّ اغْفِرْلِیْ وَارْحَمْنِیْ وَاھْدِنِیْ وَعَافِنِیْ وَارْزُقْنِیْ۔",
    "urdu":"اے اللہ !مجھے ہدایت پر استقامت نصیب فرمااور مجھے رزق عطا فرما اور مجھے معاف فرما اور مجھ پر رحم فرما۔"
  },
  {
    "title":"کوئی مصیبت آئے تو یہ دعاپڑھے",
    "arabic":"اِنَّالِلّٰہِ وَاِنَّااِلَیْہِ رَاجِعُوْنَ،اَللّٰھُمَّ أْجُرْنِیْ فِیْ مُصِیْبَتِیْ وَاَخْلِفْ لِیْ خَیْرًامِّنْھَا۔",
    "urdu":"ہم تو اللہ ہی کے ہیں اور اس کی طرف لوٹ کر جانے والے ہیں ، اے اللہ !مجھے اپنی مصیبت میں اجر دے اوراس کا نعم البدل عطا فرما۔"
  },{
    "title":"مریض کی عیادت کی دعا",
    "arabic":"لَابَأْسَ طُہُوْر اِنْ شَآ ئَ اللّٰہ۔",
    "urdu":"کچھ ڈرنہیں، ان شاء اللہ تعالیٰ یہ بیماری گناہوں سے پاک کرنے والی ہے ۔"
  },
  {
    "title":"بازار جائے تویہ دعا پڑھے",
    "arabic":"بِسْمِ اللّٰہِ، اَللّٰھُمَّ اِنِّیْ اَسْئَلُکَ خَیْرَ ھٰذِہِ السُّوْقِ وَخَیْرَمَافِیْھَاوَاَعُوْذُبِکَ مِنْ شَرِّ ھَا وَشَرِّمَافِیْھَااَللّٰھُمَّ اِنِّیْ اَعُوذُبِکَ اَنْ اُصِیْبَ فِیْھَایَمِیْنًا فَاجِرَةً اَوْصَفْقَةً خَاسِرَةً۔",
    "urdu":"اللہ کے نام سے بازار میں داخل ہوتا ہوں،یااللہ! میں آپ سے اس بازار کی بھلائی مانگتاہوں اور اس چیز کی بھلائی جو اس میں ہے اور آپ کی پناہ چاہتا ہوں اس کی برائی سے اوراس چیز کی برائی سے جو اس میں ہے، یااللہ! میں آپ کی پناہ چاہتا ہوں اس سے کہ میں اس بازار میں جھوٹی قسم اور خسارہ کے معاملہ میں پڑجائوں۔"
  },
  {
    "title":"کسی منزل پر پہنچنے کی دعاء",
    "arabic":"اَعُوْذُبِکَلِمَاتِ اللّٰہِ التَّآمَّاتِ مِنْ شَرِّ مَاخَلَقَ۔",
    "urdu":"میں پناہ پکڑتاہوں اللہ تعالیٰ کی کامل باتوں کی ،تمام مخلوق کی برائی سے۔"
  },
  {
    "title":"کپڑے پہننے کی دعا",
    "arabic":"اَلْحَمْدُ لِلّٰہِ الَّذِیْ کَسَانِیْ ھٰذَا وَرَزَقَنِیْہِ مِنْ غَیْرِ حَوْلٍ مِّنِّیْ وَلَاقُوَّةٍ۔",
    "urdu":"تمام تعریفیں اس ذات گرامی کی جس نے ہمیں یہ پہنایا اوربغیر میری قوت وطاقت کے مجھے نوازا۔"
  },
  {
    "title":"بیت الخلاء میں داخل ہونے سے پہلے کی دعا",
    "arabic":"اَللّٰہُمَّ اِنِّیْ اَعُوْذُبِکَ مِنَ الْخُبُثِ وَالْخَبَآئِثِ۔",
    "urdu":"اے اللہ !میں آپ کی پناہ پکڑتا ہوں تمام شیاطین (مردوں اورعورتوں) کے شرسے۔"
  },{
    "title":"بیت الخلاء سے باہر آنے کے بعد کی دعا",
    "arabic":"اَلْحَمْدُ لِلّٰہِ الَّذِیْ اَذْھَبَ عَنِّی الْاَذٰی وَعَافَانِیْْ ۔",
    "urdu":"شکر ہے اس اللہ کا جس نے مجھ سے گندگی دور کردی اور مجھ کوعافیت دی۔"
  },
  {
    "title":"نیند میں ڈرجائے یا برا خواب دیکھنے کے بعد کی دعا",
    "arabic":"اَعُوْذُبِکَلِمَاتِ اللہِ التَّآمَّۃِ مِنْ غَضَبِہ وَعِقَابِہ وَمِنْ شَرِّ عِبَادِہ وَمِنْ ھَمَزَاتِ الشَّیَاطِیْنِ وَاَنْ یَّحْضُرُوْنِ۔",
    "urdu":"میں اللہ تعالیٰ کی پکی باتوں کی پناہ پکڑتا ہوں اس کے غصہ، اس کے عذاب اور اس کی مخلوق کے شر سے اور شیطانوں کی چھیڑسے اور اس سے کہ وہ میرے قریب آئیں ۔ "
  },
  {
    "title":"کسی کورخصت کرنے کی دعا",
    "arabic":"اَسْتَوْدِعُ اللّٰہَ دِیْنَکَ وَاَمَانَتَکَ وَخَوَاتِیْمَ عَمَلِکَ ۔",
    "urdu":"آپ کا دین ،آپ کی ایمانداری اور اعمال کا اچھا انجام اللہ تعالیٰ کے سپر د کرتا ہوں۔"
  },
  {
    "title":"دشمن کا خوف ہو تو یہ دعا پڑھے",
    "arabic":"اَللّٰہُمَّ اِنَّا نَجْعَلُکَ فِیْ نُحُوْرِ ھِمْ وَنَعُوْذُبِکَ مِنْ شُرُوْرِ ھِمْ ۔",
    "urdu":"یااللہ !آپ ہی کو دشمن کے سامنے لاتے ہیں اور ان کی شرارتوں سے آپ کی پناہ مانگتے ہیں۔"
  },
  {
    "title":"شام کی دعا",
    "arabic":"اَمْسَیْنَاوَاَمْسَی الْمُلْکُ لِلّٰہِ رَبِّ الْعَالَمِیْنَ اَللّٰہُمَّ اِنِّیْ اَسْئَلُکَ خَیْرَ ھَذِہِ اللَّیْلَةِ وَفَتْحَھَاوَنَصْرَھَا وَنُوْرَھَا وَبَرَکَتَہَا وَھُدَاھَاوَاَعُوْذُ بِکَ مِنْ شَرِّ مَافِیْھَا وَشَرِّ مَابَعْدَھَا۔",
    "urdu":"ہم نے اللہ کے ملک میں شام کی ،اے اللہ !میں آپ سے اس رات کی بھلائی کا ،فتح و نصرت ،نوروبرکت اور ہدایت کا سؤال کرتا ہوں ،اور اس رات کی برائی اور اس کے بعد کی برائیوں سے پناہ مانگتا ہوں ۔"
  },
  {
    "title":"اداء قرض میں آسانی کی دعا",
    "arabic":"اَللّٰہُمَّ اَکْفِنِیْ بِحَلَالِکَ عَنْ حَرَامِکَ وَاَغْنِنِیْ بِفَضْلِکَ عَمَّنْ سِوَاکَ ۔",
    "urdu":"اے اللہ ! اپنے حلال کے ذریعے مجھے حرام سے بچا اورمجھے اپنے فضل سے اپنے ماسواسے مستغنی فرمادے۔"
  },
  {
    "title":"مریض کی شفایابی کی دعا",
    "arabic":"اَسْأَلُ اللّٰہَ الْعَظِیْمَ رَبَّ الْعَرْشِ الْعَظِیْمِ اَنْ یَّشْفِیَکَ۔ (سبع مرات)",
    "urdu":"عرش عظیم کے بلند وبالا خدا سے آپ کی صحت کا سؤال کرتا ہوں۔(سات مرتبہ)"
  },
  {
    "title":"سواری پربیٹھ کر یہ دعاء پڑھے",
    "arabic":"اَلْحَمْدُ لِلّٰہِ ،سُبْحٰنَ الَّذِیْ سَخَّرَلَنَاھٰذَاوَمَاکُنَّالَہ مُقْرِنِیْنَ وَاِنَّااِلٰی رَبِّنَالَمُنْقَلِبُوْنَ۔",
    "urdu":"شکر ہے اللہ کا ،پاکی ہے اس ذات کے لئے جس نے اِس کو ہمارے قبضہ میں کردیا اور ہم تواس کو قابو کرنے والے نہ تھے اور ہم پر وردگار کی طرف ضرور لوٹنے والے ہیں۔"
  },
];