List khalimasData = [
  {
    "title": "First Kalma",
    "meaning": "Tayyab",
    "arabic": "لَآ اِلٰہَ اِلَّا اللہُ مُحَمَّدٌ رَّسُوْلُ اللہِ",
    "translation": "اللہ کے سوا کوئی معبود نہیں محمد ﷺ اللہ کے رسول ہیں"
  },
  {
    "title": "Second Kalma",
    "meaning": "Shahdat",
    "arabic":
        "اَشْهَدُ اَنْ لَّآاِلٰهَ اِلَّا اللہُ وَحْدَهٗ لَا شَرِيْكَ لَهٗ وَ اَشْهَدُ اَنَّ مُحَمَّدً اعَبْدُهٗ وَرَسُولُهٗ ط",
    "translation":
        "میں گواہی دیتا ہو کہ اللہ کے سوا کوئی معبود نہیں وہاکیلا ہے اسکا کوئی شریک نہیں اور میں گواہی دیتا ہو کہمحمد ﷺ اسکے بندے اور رسول ہیں"
  },
  {
    "title": "Third Kalma",
    "meaning": "Tamjeed",
    "arabic":
        "سُبْحَانَ اللہِ وَ الْحَمْدُ لِلہ  وَ لَآ اِلٰهَ اِلَّا اللہُ وَ اللہُ اَكْبَرُ  ط    وَلَا حَوْلَ وَلَا قُوَّةَاِلَّا بِاللّٰہِ الْعَلِیِّ الْعَظِیْمِ",
    "translation":
        "اللہ کی ذات پاک ہے اور سب تعریف اللہ ہی کیلئے ہےاور اللہ کے سوا کوئی معبود نہیں اور اللہ بہت بڑا ہے گناہوں سے بچنے کی طاقت اور نیک کامکرنے کی توفیق اللہ ہی کی طرف سے ہے جو بہت بلند اور عظمت والا ہے۔"
  },
  {
    "title": "Forth Kalma",
    "meaning": "Tuheed",
    "arabic":
        " لَآ اِلٰهَ اِلَّا اللہُ وَحْدَهُ لَا شَرِيْكَ لَهٗ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْىٰ وَ يُمِيْتُ وَ هُوَحَىٌّ  لَّا يَمُوْتُ اَبَدًا اَبَدًا  طذُو الْجَلَالِ وَ الْاِكْرَامِ    ط      بِيَدِهِ الْخَيْرُ   طوَهُوَ عَلٰى كُلِّ شَیْ ءٍ قَدِيْرٌ    ط",
    "translation":
        "اللہ کے سوا کوئی معبود نہیں وہ اکیلا ہے اسکا کوئی شریک نہیں اسی کی بادشاہی ہے اور اس کے لیے تمام تعریفے ہے۔ وہ زندہ کرتا ہے اور وہ مرواتا ہے۔اور وہ ہمیشہ کیلئے زندہ ہے وہ مرے گا نہیں عظمت اور بزرگی والا ہے ، بہتری اسی کے ہاتھ میں ہےاور ہر چیز پر قادر ہے"
  },
  {
    "title": "Fifth Kalma",
    "meaning": "Istigfar",
    "arabic":
        " اَسْتَغْفِرُ اللہَ رَبِّىْ مِنْ كُلِّ ذَنْبٍ اَذْنَبْتُهٗعَمَدًا اَوْ خَطَاءً سِرًّا اَوْ عَلَانِيَةً وَاَتُوْبُ اِلَيْهِمِنَ الذَّنْبِ الَّذِىْٓ اَعْلَمُ وَ مِنَ الذَّنْبِ الَّذِىْ لَآ اَعْلَمُ اِنَّكَ اَنْتَ عَلَّامُ الغُيُوْبِوَ سَتَّارُ الْعُيُوْبِ وَ غَفَّارُ الذُّنُوْبِوَ لا حَوْلَ وَلا قُوَّةَ اِلَّا بِاللّٰہِ الْعَلِىِّ العَظِيْمِ  ط",
    "translation":
        "معافی مانگتا ہو اے میرے اللہ ہر گناہ سے جو میں نے جان بوجھ کر یا بھول کر کیا ہے، در پردہ یا کھلم کھلا اور میں توبہ کرتا ہوں اسکے حضور میں اس گناہ سے جو مجھے معلوم ہےاور اس گناہ سے جو مجھے معلوم نہیںبے شک تو غیبوں کو جاننے والا اور عیبوں کو چھپانے والا ہے اور گناہوں سے بخشنے والا ہے اور گناہوں سے بچنے کی طاقتاور نیک کام کرنے کی طاقت اللہ ہی کی طرف سے ہے۔ جو عالی شان اور عظمت والا ہے"
  },
  {
    "title": "Sixth Kalma",
    "meaning": "Radi Kufar",
    "arabic":
        " اَللّٰهُمَّ اِنِّیْ اَعُوْذُ بِكَ مِنْ اَنْ اُشْرِكَ بِكَ شَيْئًا وَّاَنَا اَعْلَمُ بِهٖ وَ اَسْتَغْفِرُكَ لِمَا لَآ اَعْلَمُ بِهٖ تُبْتُ عَنْهُ وَ تَبَرَّأْتُ مِنَ الْكُفْرِ وَ الشِّرْكِ وَ الْكِذْبِ وَ الْغِيْبَةِ وَ الْبِدْعَةِ وَ النَّمِيْمَةِ وَ الْفَوَاحِشِ وَ الْبُهْتَانِوَ الْمَعَاصِىْ كُلِّهَا وَ اَسْلَمْتُ وَ اَقُوْلُلَآ اِلٰهَ اِلَّا اللہُ مُحَمَّدٌ رَّسُوْلُ اللہِ     ط",
    "translation":
        "اے اللہ میں پناہ مانگتا ہو اس بات سے کہ میں کسی شے کو تیرا شریک بناؤںاورمجھے اس کا علم ہو اور میں بخشش مانگتا ہوںتجھ سے اس (گناہ) کی جو میں جانتا نہیں ہواور میں نے اس سے توبہ کی اور بیزار ہوا کفر سے اور شرک سےاور جھوٹ سے اور غیبت سے اور بدعت سے اور چغلی سے اور بے حیائی سے، اور بہتان سے اور تمام گناہوں سےاور میں ایمان لایا اور میں کہتا ہوکہاللہ کے سوا کوئی معبود نہیں اور محمد ﷺ اللہ کے رسول ہے"
  }
];
