

[
    {
        "nameUrdu":"سورة الفاتحة",
        "nameEnglish":"Surah Al-Fatiha",
        "aya":[
            {
                "arabic":"بِسۡمِ ٱللهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِيمِ",
                "urdu":"شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے"
            },
            {
                "arabic":"اَلۡحَمۡدُ لِلّٰهِ رَبِّ الۡعٰلَمِيۡنَۙ",
                "urdu":"سب طرح کی تعریف خدا ہی کو (سزاوار) ہے جو تمام مخلوقات کا پروردگار ہے"
            },
            {
                "arabic":"الرَّحۡمٰنِ الرَّحِيۡمِۙ",
                "urdu":" بڑا مہربان نہایت رحم والا"
            },{
                "arabic":"مٰلِكِ يَوۡمِ الدِّيۡنِؕ",
                "urdu":" انصاف کے دن کا حاکم"
            },{
                "arabic":"اِيَّاكَ نَعۡبُدُ وَاِيَّاكَ نَسۡتَعِيۡنُؕ",
                "urdu":"(اے پروردگار) ہم تیری ہی عبادت کرتے ہیں اور تجھ ہی سے مدد مانگتے ہیں"
            },{
                "arabic":"اِهۡدِنَا الصِّرَاطَ الۡمُسۡتَقِيۡمَۙ",
                "urdu":"ہم کو سیدھے رستے چلا"
            },{
                "arabic":"صِرَاطَ الَّذِيۡنَ اَنۡعَمۡتَ عَلَيۡهِمۡ ۙ غَيۡرِ الۡمَغۡضُوۡبِ عَلَيۡهِمۡ وَلَا الضَّآلِّيۡنَ",
                "urdu":" ان لوگوں کے رستے جن پر تو اپنا فضل وکرم کرتا رہا نہ ان کے جن پر غصے ہوتا رہا اور نہ گمراہوں کے"
            }
        ]
    },
    {
        "nameUrdu":"البقرة",
        "nameEnglish":"Al-Baqara",
        "aya":[{"arabic":" الٓمّٓۚ",
        "urdu":"الم",
       "english":"Alif. Lam. Mim."
       },{
       "arabic":" ذٰلِكَ الۡڪِتٰبُ لَا رَيۡبَۛۚۖ فِيۡهِۛۚ هُدًى لِّلۡمُتَّقِيۡنَۙ",
        "urdu":"یہ کتاب (قرآن مجید) اس میں کچھ شک نہیں (کہ کلامِ خدا ہے۔ خدا سے) ڈرنے والوں کی رہنما ہے",
       "english":"This is the Scripture whereof there is no doubt, a guidance unto those who ward off (evil)."
       },{
       "arabic":" الَّذِيۡنَ يُؤۡمِنُوۡنَ بِالۡغَيۡبِ وَ يُقِيۡمُوۡنَ الصَّلٰوةَ وَمِمَّا رَزَقۡنٰهُمۡ يُنۡفِقُوۡنَۙ",
        "urdu":"جو غیب پر ایمان لاتے اور آداب کے ساتھ نماز پڑھتے اور جو کچھ ہم نے ان کو عطا فرمایا ہے اس میں سے خرچ کرتے ہیں",
       "english":"Who believe in the Unseen, and establish worship, and spend of that We have bestowed upon them;"
       },{
       "arabic":" وَالَّذِيۡنَ يُؤۡمِنُوۡنَ بِمَآ اُنۡزِلَ اِلَيۡكَ وَمَآ اُنۡزِلَ مِنۡ قَبۡلِكَۚ وَبِالۡاٰخِرَةِ هُمۡ يُوۡقِنُوۡنَؕ",
        "urdu":"اور جو کتاب (اے محمدﷺ) تم پر نازل ہوئی اور جو کتابیں تم سے پہلے (پیغمبروں پر) نازل ہوئیں سب پر ایمان لاتے اور آخرت کا یقین رکھتے ہیں",
       "english":"And who believe in that which is revealed unto thee (Muhammad) and that which was revealed before thee, and are certain of the Hereafter."
       },{
       "arabic":" اُولٰٓٮِٕكَ عَلٰى هُدًى مِّنۡ رَّبِّهِمۡ‌ وَاُولٰٓٮِٕكَ هُمُ الۡمُفۡلِحُوۡنَ",
        "urdu":"یہی لوگ اپنے پروردگار (کی طرف) سے ہدایت پر ہیں اور یہی نجات پانے والے ہیں",
       "english":"These depend on guidance from their Lord. These are the successful."
       },{
       "arabic":" اِنَّ الَّذِيۡنَ كَفَرُوۡا سَوَآءٌ عَلَيۡهِمۡ ءَاَنۡذَرۡتَهُمۡ اَمۡ لَمۡ تُنۡذِرۡهُمۡ لَا يُؤۡمِنُوۡنَ",
        "urdu":"جو لوگ کافر ہیں انہیں تم نصیحت کرو یا نہ کرو ان کے لیے برابر ہے۔ وہ ایمان نہیں لانے کے",
       "english":"As for the Disbelievers, Whether thou warn them or thou warn them not it is all one for them; they believe not."
       },{
       "arabic":" خَتَمَ اللّٰهُ عَلَىٰ قُلُوۡبِهِمۡ وَعَلٰى سَمۡعِهِمۡ‌ؕ وَعَلٰٓى اَبۡصَارِهِمۡ غِشَاوَةٌ وَّلَهُمۡ عَذَابٌ عَظِيۡمٌ",
        "urdu":"خدا نے ان کے دلوں اور کانوں پر مہر لگا رکھی ہے اور ان کی آنکھوں پر پردہ (پڑا ہوا) ہے اور ان کے لیے بڑا عذاب (تیار) ہے",
       "english":"Allah hath sealed their hearing and their hearts, and on their eyes there is a covering. Theirs will be an awful doom."
       },{
       "arabic":" وَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ اٰمَنَّا بِاللّٰهِ وَبِالۡيَوۡمِ الۡاٰخِرِ وَمَا هُمۡ بِمُؤۡمِنِيۡنَ‌ۘ",
        "urdu":"اور بعض لوگ ایسے ہیں جو کہتے ہیں کہ ہم خدا پر اور روزِ آخرت پر ایمان رکھتے ہیں حالانکہ وہ ایمان نہیں رکھتے",
       "english":"And of mankind are some who say: We believe in Allah and the Last Day, when they believe not."
       },{
       "arabic":" يُخٰدِعُوۡنَ اللّٰهَ وَالَّذِيۡنَ اٰمَنُوۡا‌ۚ وَمَا يَخۡدَعُوۡنَ اِلَّاۤ اَنۡفُسَهُمۡ وَمَا يَشۡعُرُوۡنَؕ",
        "urdu":"یہ (اپنے پندار میں) خدا کو اور مومنوں کو چکما دیتے ہیں مگر (حقیقت میں) اپنے سوا کسی کو چکما نہیں دیتے اور اس سے بے خبر ہیں",
       "english":"They think to beguile Allah and those who believe, and they beguile none save themselves; but they perceive not."
       },{
       "arabic":"﴿ فِىۡ قُلُوۡبِهِمۡ مَّرَضٌۙ فَزَادَهُمُ اللّٰهُ مَرَضًا‌ۚ وَّلَهُمۡ عَذَابٌ اَلِيۡمٌۙۢ بِمَا كَانُوۡا يَكۡذِبُوۡنَ",
        "urdu":"ان کے دلوں میں (کفر کا) مرض تھا۔ خدا نے ان کا مرض اور زیادہ کر دیا اور ان کے جھوٹ بولنے کے سبب ان کو دکھ دینے والا عذاب ہوگا",
        "english":"In their hearts is a disease, and Allah increaseth their disease. A painful doom is theirs because they lie."
       },{
       "arabic":"﴿ وَاِذَا قِيۡلَ لَهُمۡ لَا تُفۡسِدُوۡا فِىۡ الۡاَرۡضِۙ قَالُوۡٓا اِنَّمَا نَحۡنُ مُصۡلِحُوۡنَ",
        "urdu":"اور جب ان سے کہا جاتا ہے کہ زمین میں فساد نہ ڈالو تو کہتے ہیں، ہم تو اصلاح کرنے والے ہیں",
       "english":"And when it is said unto them: Make not mischief in the earth, they say: We are peacemakers only."
       },{
       "arabic":"﴿ اَلَا ٓ اِنَّهُمۡ هُمُ الۡمُفۡسِدُوۡنَ وَلٰـكِنۡ لَّا يَشۡعُرُوۡنَ",
        "urdu":"دیکھو یہ بلاشبہ مفسد ہیں، لیکن خبر نہیں رکھتے",
       "english":"Are not they indeed the mischief-makers? But they perceive not."
       },{
       "arabic":"﴿ وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا كَمَآ اٰمَنَ النَّاسُ قَالُوۡٓا اَنُؤۡمِنُ كَمَآ اٰمَنَ السُّفَهَآءُ‌ؕ اَلَاۤ اِنَّهُمۡ هُمُ السُّفَهَآءُ وَلٰـكِنۡ لَّا يَعۡلَمُوۡنَ",
        "urdu":"اور جب ان سے کہا جاتا ہے کہ جس طرح اور لوگ ایمان لے آئے، تم بھی ایمان لے آؤ تو کہتے ہیں، بھلا جس طرح بےوقوف ایمان لے آئے ہیں اسی طرح ہم بھی ایمان لے آئیں؟ سن لو کہ یہی بےوقوف ہیں لیکن نہیں جانتے",
       "english":"And when it is said unto them: believe as the people believe, they say: shall we believe as the foolish believe? are not they indeed the foolish? But they know not."
       },{
       "arabic":"﴿ وَاِذَا لَقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡآ اٰمَنَّاۖۚ وَاِذَا خَلَوۡا اِلٰى شَيٰطِيۡنِهِمۡۙ قَالُوۡآ اِنَّا مَعَكُمۡۙ اِنَّمَا نَحۡنُ مُسۡتَهۡزِءُوۡنَ",
        "urdu":"اور یہ لوگ جب مومنوں سے ملتے ہیں تو کہتے ہیں کہ ہم ایمان لے آئے ہیں، اور جب اپنے شیطانوں میں جاتے ہیں تو (ان سے) کہتے ہیں کہ ہم تمھارے ساتھ ہیں اور (پیروانِ محمدﷺ سے) تو ہم ہنسی کیا کرتے ہیں",
       "english":"And when they fall in with those who believe, they say: We believe; but when they go apart to their devils they declare: Lo! we are with you; verily we did but mock."
       },{
       "arabic":"﴿ اَللّٰهُ يَسۡتَهۡزِئُ بِهِمۡ وَيَمُدُّهُمۡ فِىۡ طُغۡيَانِهِمۡ يَعۡمَهُوۡنَ",
        "urdu":"ان (منافقوں) سے خدا ہنسی کرتا ہے اور انہیں مہلت دیئے جاتا ہے کہ شرارت وسرکشی میں پڑے بہک رہے ہیں",
       "english":"Allah (Himself) doth mock them, leaving them to wander blindly on in their contumacy."
       },{
       "arabic":"﴿ اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى فَمَا رَبِحَتۡ تِّجَارَتُهُمۡ وَمَا كَانُوۡا مُهۡتَدِيۡنَ",
        "urdu":"یہ وہ لوگ ہیں جنہوں نے ہدایت چھوڑ کر گمراہی خریدی، تو نہ تو ان کی تجارت ہی نے کچھ نفع دیا اور نہ وہ ہدایت یاب ہی ہوئے",
       "english":"These are they who purchase error at the price of guidance, so their commerce doth not prosper, neither are they guided."
       },{
       "arabic":"﴿ مَثَلُهُمۡ كَمَثَلِ الَّذِىۡ اسۡتَوۡقَدَ نَارًا‌ۚ فَلَمَّآ اَضَآءَتۡ مَا حَوۡلَهٗ ذَهَبَ اللّٰهُ بِنُوۡرِهِمۡ وَتَرَكَهُمۡ فِىۡ ظُلُمٰتٍ لَّا يُبۡصِرُوۡنَ",
        "urdu":"ان کی مثال اس شخص کی سی ہے کہ جس نے (شبِ تاریک میں) آگ جلائی۔ جب آگ نے اس کے اردگرد کی چیزیں روشن کیں تو خدا نے ان کی روشنی زائل کر دی اور ان کو اندھیروں میں چھوڑ دیا کہ کچھ نہیں دیکھتے",
       "english":"Their likeness is as the likeness of one who kindleth fire, and when it sheddeth its light around him Allah taketh away their light and leaveth them in darkness, where they cannot see,"
       },{
       "arabic":"﴿ صُمٌّۢ بُكۡمٌ عُمۡىٌ فَهُمۡ لَا يَرۡجِعُوۡنَۙ",
        "urdu":"(یہ) بہرے ہیں، گونگے ہیں، اندھے ہیں کہ (کسی طرح سیدھے رستے کی طرف) لوٹ ہی نہیں سکتے",
       "english":"Deaf, dumb and blind; and they return not."
       },{
       "arabic":"﴿ اَوۡ كَصَيِّبٍ مِّنَ السَّمَآءِ فِيۡهِ ظُلُمٰتٌ وَّرَعۡدٌ وَّبَرۡقٌ‌ۚ يَجۡعَلُوۡنَ اَصَابِعَهُمۡ فِىۡٓ اٰذَانِهِمۡ مِّنَ الصَّوَاعِقِ حَذَرَ الۡمَوۡتِ‌ؕ وَاللّٰهُ مُحِيۡطٌ‌ۢ بِالۡكٰفِرِيۡنَ",
        "urdu":"یا ان کی مثال مینہ کی سی ہے کہ آسمان سے (برس رہا ہو اور) اس میں اندھیرے پر اندھیرا (چھا رہا) ہو اور (بادل) گرج (رہا) ہو اور بجلی (کوند رہی) ہو تو یہ کڑک سے (ڈر کر) موت کے خوف سے کانوں میں انگلیاں دے لیں اور الله کافروں کو (ہر طرف سے) گھیرے ہوئے ہے",
       "english":"Or like a rainstorm from the sky, wherein is darkness, thunder and the flash of lightning. They thrust their fingers in their ears by reason of the thunder-claps, for fear of death, Allah encompasseth the disbelievers (in His guidance, His omniscience and His omnipotence)."
       },{
       "arabic":"﴿ يَكَادُ الۡبَرۡقُ يَخۡطَفُ اَبۡصَارَهُمۡ‌ؕ كُلَّمَآ اَضَآءَ لَهُمۡ مَّشَوۡا فِيۡهِۙ وَاِذَآ اَظۡلَمَ عَلَيۡهِمۡ قَامُوۡا‌ؕ وَلَوۡ شَآءَ اللّٰهُ لَذَهَبَ بِسَمۡعِهِمۡ وَاَبۡصَارِهِمۡ‌ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ",
        "urdu":"قریب ہے کہ بجلی (کی چمک) ان کی آنکھوں (کی بصارت) کو اچک لے جائے۔ جب بجلی (چمکتی اور) ان پر روشنی ڈالی ہے تو اس میں چل پڑتے ہیں اور جب اندھیرا ہو جاتا ہے تو کھڑے کے کھڑے رہ جاتے ہیں اور اگر الله چاہتا تو ان کے کانوں (کی شنوائی) اور آنکھوں (کی بینائی دونوں) کو زائل کر دیتا ہے۔ بے شک الله ہر چیز پر قادر ہے",
       "english":"The lightning almost snatcheth away their sight from them. As often as it flasheth forth for them they walk therein, and when it darkeneth against them they stand still. If Allah willed, He could destroy their hearing and their sight. Lo! Allah is able to do all things."
       },{
       "arabic":"﴿ يٰٓاَيُّهَا النَّاسُ اعۡبُدُوۡا رَبَّكُمُ الَّذِىۡ خَلَقَكُمۡ وَالَّذِيۡنَ مِنۡ قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَۙ",
        "urdu":"لوگو! اپنے پروردگار کی عبات کرو جس نے تم کو اور تم سے پہلے لوگوں کو پیدا کیا تاکہ تم (اس کے عذاب سے) بچو",
       "english":"O mankind! worship your Lord, Who hath created you and those before you, so that ye may ward off (evil)."
       },{
        "arabic":"﴿ الَّذِىۡ جَعَلَ لَـكُمُ الۡاَرۡضَ فِرَاشًا وَّالسَّمَآءَ بِنَآءً وَّاَنۡزَلَ مِنَ السَّمَآءِ مَآءً فَاَخۡرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزۡقًا لَّـكُمۡ‌ۚ فَلَا تَجۡعَلُوۡا لِلّٰهِ اَنۡدَادًا وَّاَنۡتُمۡ تَعۡلَمُوۡنَ",
        "urdu":"جس نے تمھارے لیے زمین کو بچھونا اور آسمان کو چھت بنایا اور آسمان سے مینہ برسا کر تمہارے کھانے کے لیے انواع و اقسام کے میوے پیدا کئے۔ پس کسی کو خدا کا ہمسر نہ بناؤ۔ اور تم جانتے تو ہو",
       "english":"Who hath appointed the earth a resting-place for you, and the sky a canopy; and causeth water to pour down from the sky, thereby producing fruits as food for you. And do not set up rivals to Allah when ye know (better)."
       },{
       "arabic":"﴿ وَاِنۡ کُنۡتُمۡ فِىۡ رَيۡبٍ مِّمَّا نَزَّلۡنَا عَلٰى عَبۡدِنَا فَاۡتُوۡا بِسُوۡرَةٍ مِّنۡ مِّثۡلِهٖ وَادۡعُوۡا شُهَدَآءَكُمۡ مِّنۡ دُوۡنِ اللّٰهِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ",
        "urdu":"اور اگر تم کو اس (کتاب) میں، جو ہم نے اپنے بندے (محمدﷺ عربی) پر نازل فرمائی ہے کچھ شک ہو تو اسی طرح کی ایک سورت تم بھی بنا لاؤ اور خدا کے سوا جو تمہارے مددگار ہوں ان کو بھی بلالو اگر تم سچے ہو",
       "english":"And if ye are in doubt concerning that which We reveal unto Our slave (Muhammad), then produce a surah of the like thereof, and call your witness beside Allah if ye are truthful."
       },{
       "arabic":"﴿ فَاِنۡ لَّمۡ تَفۡعَلُوۡا وَلَنۡ تَفۡعَلُوۡا فَاتَّقُوۡا النَّارَ الَّتِىۡ وَقُوۡدُهَا النَّاسُ وَالۡحِجَارَةُۖۚ اُعِدَّتۡ لِلۡكٰفِرِيۡنَ",
        "urdu":"لیکن اگر (ایسا) نہ کر سکو اور ہرگز نہیں کر سکو گے تو اس آگ سے ڈرو جس کا ایندھن آدمی اور پتھر ہوں گے (اور جو) کافروں کے لیے تیار کی گئی ہے",
       "english":"And if ye do it not - and ye can never do it - then guard yourselves against the Fire prepared for disbelievers, whose fuel is of men and stones."
       },{
       "arabic":"﴿ وَبَشِّرِ الَّذِيۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ اَنَّ لَهُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ‌ؕ ڪُلَّمَا رُزِقُوۡا مِنۡهَا مِنۡ ثَمَرَةٍ رِّزۡقًا‌ۙ قَالُوۡا هٰذَا الَّذِىۡ رُزِقۡنَا مِنۡ قَبۡلُ وَاُتُوۡا بِهٖ مُتَشَابِهًا‌ؕ وَلَهُمۡ فِيۡهَآ اَزۡوَاجٌ مُّطَهَّرَةٌ‌ۙ وَّهُمۡ فِيۡهَا خٰلِدُوۡنَ",
        "urdu":"اور جو لوگ ایمان لائے اور نیک عمل کرتے رہے، ان کو خوشخبری سنا دو کہ ان کے لیے (نعمت کے) باغ ہیں، جن کے نیچے نہریں بہہ رہی ہیں۔ جب انہیں ان میں سے کسی قسم کا میوہ کھانے کو دیا جائے گا تو کہیں گے، یہ تو وہی ہے جو ہم کو پہلے دیا گیا تھا۔ اور ان کو ایک دوسرے کے ہم شکل میوے دیئے جائیں گے اور وہاں ان کے لیے پاک بیویاں ہوں گی اور وہ بہشتوں میں ہمیشہ رہیں گے",
       "english":"And give glad tidings (O Muhammad) unto those who believe and do good works; that theirs are Gardens underneath which rivers flow; as often as they are regaled with food of the fruit thereof, they say: this is what was given us aforetime; and it is given to them in resemblance. There for them are pure companions; there for ever they abide."
       },{
       "arabic":"﴿ اِنَّ اللّٰهَ لَا يَسۡتَحۡىٖۤ اَنۡ يَّضۡرِبَ مَثَلاً مَّا ‌بَعُوۡضَةً فَمَا فَوۡقَهَا‌ؕ فَاَمَّا ‌الَّذِيۡنَ اٰمَنُوۡا فَيَعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ‌ۚ وَاَمَّا الَّذِيۡنَ ڪَفَرُوۡا فَيَقُوۡلُوۡنَ مَاذَآ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًاۘ يُضِلُّ بِهٖ ڪَثِيۡرًا وَّيَهۡدِىۡ بِهٖ كَثِيۡرًا‌ؕ وَمَا يُضِلُّ بِهٖۤ اِلَّا الۡفٰسِقِيۡنَۙ",
        "urdu":"الله اس بات سے عار نہیں کرتا کہ مچھر یا اس سے بڑھ کر کسی چیز (مثلاً مکھی مکڑی وغیرہ) کی مثال بیان فرمائے۔ جو مومن ہیں، وہ یقین کرتے ہیں وہ ان کے پروردگار کی طرف سے سچ ہے اور جو کافر ہیں وہ کہتے ہیں کہ اس مثال سے خدا کی مراد ہی کیا ہے۔ اس سے (خدا) بہتوں کو گمراہ کرتا ہے اور بہتوں کو ہدایت بخشتا ہے اور گمراہ بھی کرتا تو نافرمانوں ہی کو",
       "english":"Lo! Allah disdaineth not to coin the similitude even of a gnat. Those who believe know that it is the truth from their Lord; but those who disbelieve say: What doth Allah wish (to teach) by such a similitude? He misleadeth many thereby, and He guideth many thereby; and He misleadeth thereby only miscreants;"
       },{
       "arabic":"﴿ الَّذِيۡنَ يَنۡقُضُوۡنَ عَهۡدَ اللّٰهِ مِنۡۢ بَعۡدِ مِيۡثَاقِهٖ وَيَقۡطَعُوۡنَ مَآ اَمَرَ اللّٰهُ بِهٖۤ اَنۡ يُّوۡصَلَ وَيُفۡسِدُوۡنَ فِىۡ الۡاَرۡضِ‌ؕ اُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ",
        "urdu":"جو خدا کے اقرار کو مضبوط کرنے کے بعد توڑ دیتے ہیں اور جس چیز (یعنی رشتہٴ قرابت) کے جوڑے رکھنے کا الله نے حکم دیا ہے اس کو قطع کئے ڈالتے ہیں اور زمین میں خرابی کرتے ہیں یہی لوگ نقصان اٹھانے والے ہیں",
       "english":"Those who break the covenant of Allah after ratifying it, and sever that which Allah ordered to be joined, and (who) make mischief in the earth: Those are they who are the losers."
       },{
       "arabic":"﴿ كَيۡفَ تَكۡفُرُوۡنَ بِاللّٰهِ وَڪُنۡتُمۡ اَمۡوَاتًا فَاَحۡيَاکُمۡ‌ۚ ثُمَّ يُمِيۡتُكُمۡ ثُمَّ يُحۡيِيۡكُمۡ ثُمَّ اِلَيۡهِ تُرۡجَعُوۡنَ",
        "urdu":"(کافرو!) تم خدا سے کیوں کر منکر ہو سکتے ہو جس حال میں کہ تم بےجان تھے تو اس نے تم کو جان بخشی پھر وہی تم کو مارتا ہے پھر وہی تم کو زندہ کرے گا پھر تم اسی کی طرف لوٹ کر جاؤ گے",
       "english":"How disbelieve ye in Allah when ye were dead and He gave life to you! Then He will give you death, then life again, and then unto Him ye will return."
       },{
       "arabic":"﴿ هُوَ الَّذِىۡ خَلَقَ لَـكُمۡ مَّا فِىۡ الۡاَرۡضِ جَمِيۡعًا ثُمَّ اسۡتَوٰۤى اِلَى السَّمَآءِ فَسَوّٰٮهُنَّ سَبۡعَ سَمٰوٰتٍ‌ؕ وَهُوَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ",
        "urdu":"وہی تو ہے جس نے سب چیزیں جو زمین میں ہیں تمہارے لیے پیدا کیں پھر آسمان کی طرف متوجہ ہوا تو ان کو ٹھیک سات آسمان بنا دیا اور وہ ہر چیز سے خبردار ہے",
       "english":"He it is Who created for you all that is in the earth. Then turned He to the heaven, and fashioned it as seven heavens. And He is knower of all things."
       },{
       "arabic":"﴿ وَاِذۡ قَالَ رَبُّكَ لِلۡمَلٰٓٮِٕكَةِ اِنِّىۡ جَاعِلٌ فِىۡ الۡاَرۡضِ خَلِيۡفَةً‌ؕ قَالُوۡٓا اَتَجۡعَلُ فِيۡهَا مَنۡ يُّفۡسِدُ فِيۡهَا وَيَسۡفِكُ الدِّمَآءَۚ وَنَحۡنُ نُسَبِّحُ بِحَمۡدِكَ وَنُقَدِّسُ لَـكَ‌ؕ قَالَ اِنِّىۡٓ اَعۡلَمُ مَا لَا تَعۡلَمُوۡنَ",
        "urdu":"اور (وہ وقت یاد کرنے کے قابل ہے) جب تمہارے پروردگار نے فرشتوں سے فرمایا کہ میں زمین میں (اپنا) نائب بنانے والا ہوں۔ انہوں نے کہا۔ کیا تُو اس میں ایسے شخص کو نائب بنانا چاہتا ہے جو خرابیاں کرے اور کشت وخون کرتا پھرے اور ہم تیری تعریف کے ساتھ تسبیح وتقدیس کرتے رہتے ہیں۔ (خدا نے) فرمایا میں وہ باتیں جانتا ہوں جو تم نہیں جانتے",
       "english":"And when thy Lord said unto the angels: Lo! I am about to place a viceroy in the earth, they said: Wilt thou place therein one who will do harm therein and will shed blood, while we, we hymn Thy praise and sanctify Thee? He said: Surely I know that which ye know not."
       },{
       "arabic":"﴿ وَعَلَّمَ اٰدَمَ الۡاَسۡمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمۡ عَلَى الۡمَلٰٓٮِٕكَةِ فَقَالَ اَنۡۢبِــُٔوۡنِىۡ بِاَسۡمَآءِ هٰٓؤُلَآءِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ",
        "urdu":"اور اس نے آدم کو سب (چیزوں کے) نام سکھائے پھر ان کو فرشتوں کے سامنے کیا اور فرمایا کہ اگر تم سچے ہو تو مجھے ان کے نام بتاؤ",
       "english":"And He taught Adam all the names, then showed them to the angels, saying: Inform Me of the names of these, if ye are truthful."
       },{
       "arabic":"﴿ قَالُوۡا سُبۡحٰنَكَ لَا عِلۡمَ لَنَآ اِلَّا مَا عَلَّمۡتَنَاؕ اِنَّكَ اَنۡتَ الۡعَلِيۡمُ الۡحَكِيۡمُ",
        "urdu":"انہوں نے کہا، تو پاک ہے۔ جتنا علم تو نے ہمیں بخشا ہے، اس کے سوا ہمیں کچھ معلوم نہیں۔ بے شک تو دانا (اور) حکمت والا ہے",
       "english":"They said: Be glorified! We have no knowledge saving that which Thou hast taught us. Lo! Thou, only Thou, art the Knower, the Wise."
       },{
       "arabic":"﴿ قَالَ يٰٓـاٰدَمُ اَنۡۢبِئۡهُمۡ بِاَسۡمَآٮِٕهِمۡ‌ۚ فَلَمَّآ اَنۡۢبَاَهُمۡ بِاَسۡمَآٮِٕهِمۡۙ قَالَ اَلَمۡ اَقُل لَّـكُمۡ اِنِّىۡٓ اَعۡلَمُ غَيۡبَ السَّمٰوٰتِ وَالۡاَرۡضِۙ وَاَعۡلَمُ مَا تُبۡدُوۡنَ وَمَا كُنۡتُمۡ تَكۡتُمُوۡنَ",
        "urdu":"(تب) خدا نے (آدم کو) حکم دیا کہ آدم! تم ان کو ان (چیزوں) کے نام بتاؤ۔ جب انہوں نے ان کو ان کے نام بتائے تو (فرشتوں سے) فرمایا کیوں میں نے تم سے نہیں کہا تھا کہ میں آسمانوں اور زمین کی (سب) پوشیدہ باتیں جاتنا ہوں اور جو تم ظاہر کرتے ہو اور جو پوشیدہ کرتے ہو (سب) مجھ کو معلوم ہے",
       "english":"He said: O Adam! Inform them of their names, and when he had informed them of their names, He said: Did I not tell you that I know the secret of the heavens and the earth? And I know that which ye disclose and which ye hide."
       },{
       "arabic":"﴿ وَاِذۡ قُلۡنَا لِلۡمَلٰٓٮِٕكَةِ اسۡجُدُوۡا لِاٰدَمَ فَسَجَدُوۡٓا اِلَّاۤ اِبۡلِيۡسَۙ اَبٰى وَاسۡتَكۡبَرَ وَكَانَ مِنَ الۡكٰفِرِيۡنَ",
        "urdu":"اور جب ہم نے فرشتوں کو حکم دیا کہ آدم کے آگے سجدہ کرو تو وہ سجدے میں گر پڑے مگر شیطان نے انکار کیا اور غرور میں آکر کافر بن گیا",
       "english":"And when We said unto the angels: Prostrate yourselves before Adam, they fell prostrate, all save Iblis. He demurred through pride, and so became a disbeliever."
       },{
       "arabic":"﴿ وَقُلۡنَا يٰٓـاٰدَمُ اسۡكُنۡ اَنۡتَ وَزَوۡجُكَ الۡجَـنَّةَ وَكُلَا مِنۡهَا رَغَدًا حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوۡنَا مِنَ الظّٰلِمِيۡنَ",
        "urdu":"اور ہم نے کہا کہ اے آدم تم اور تمہاری بیوی بہشت میں رہو اور جہاں سے چاہو بے روک ٹوک کھاؤ (پیو) لیکن اس درخت کے پاس نہ جانا نہیں تو ظالموں میں (داخل) ہو جاؤ گے",
       "english":"And We said: O Adam! Dwell thou and thy wife in the Garden, and eat ye freely (of the fruits) thereof where ye will; but come not nigh this tree lest ye become wrong-doers."
       },{
       "arabic":"﴿ فَاَزَلَّهُمَا الشَّيۡطٰنُ عَنۡهَا فَاَخۡرَجَهُمَا مِمَّا كَانَا فِيۡهِ‌ وَقُلۡنَا اهۡبِطُوۡا بَعۡضُكُمۡ لِبَعۡضٍ عَدُوٌّ‌ۚ وَلَـكُمۡ فِىۡ الۡاَرۡضِ مُسۡتَقَرٌّ وَّمَتَاعٌ اِلٰى حِيۡنٍ",
        "urdu":"پھر شیطان نے دونوں کو وہاں سے پھسلا دیا اور جس (عیش ونشاط) میں تھے، اس سے ان کو نکلوا دیا۔ تب ہم نے حکم دیا کہ (بہشت بریں سے) چلے جاؤ۔ تم ایک دوسرے کے دشمن ہو، اور تمہارے لیے زمین میں ایک وقت تک ٹھکانا اور معاش (مقرر کر دیا گیا) ہے",
       "english":"But Satan caused them to deflect therefrom and expelled them from the (happy) state in which they were; and We said: Fall down, one of you a foe unto the other! There shall be for you on earth a habitation and provision for a time."
       },{
       "arabic":"﴿ فَتَلَقّٰٓى اٰدَمُ مِنۡ رَّبِّهٖ كَلِمٰتٍ فَتَابَ عَلَيۡهِ‌ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ",
        "urdu":"پھر آدم نے اپنے پروردگار سے کچھ کلمات سیکھے (اور معافی مانگی) تو اس نے ان کا قصور معاف کر دیا بے شک وہ معاف کرنے والا (اور) صاحبِ رحم ہے",
       "english":"Then Adam received from his Lord words (of revelation), and He relented toward him. Lo! He is the relenting, the Merciful."
       },{
       "arabic":"﴿ قُلۡنَا اهۡبِطُوۡا مِنۡهَا جَمِيۡعًا‌‌ۚ فَاِمَّا يَاۡتِيَنَّكُمۡ مِّنِّىۡ هُدًى فَمَنۡ تَبِعَ هُدَاىَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ",
        "urdu":"ہم نے فرمایا کہ تم سب یہاں سے اتر جاؤ جب تمہارے پاس میری طرف سے ہدایت پہنچے تو (اس کی پیروی کرنا کہ) جنہوں نے میری ہدایت کی پیروی کی ان کو نہ کچھ خوف ہوگا اور نہ وہ غمناک ہوں گے",
       "english":"We said: Go down, all of you, from hence; but verily there cometh unto you from Me a guidance; and whoso followeth My guidance, there shall no fear come upon them neither shall they grieve."
       },{
       "arabic":"﴿ وَالَّذِيۡنَ كَفَرُوۡا وَكَذَّبُوۡا بِـاٰيٰتِنَآ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ‌‌ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ",
        "urdu":"اور جنہوں نے (اس کو) قبول نہ کیا اور ہماری آیتوں کو جھٹلایا، وہ دوزخ میں جانے والے ہیں (اور) وہ ہمیشہ اس میں رہیں گے",
       "english":"But they who disbelieve, and deny Our revelations, such are rightful Peoples of the Fire. They will abide therein."
       },{
       "arabic":"﴿ يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَوۡفُوۡا بِعَهۡدِىۡٓ اُوۡفِ بِعَهۡدِكُمۡۚ وَاِيّاىَ فَارۡهَبُوۡنِ",
        "urdu":"اے یعقوب کی اولاد! میرے وہ احسان یاد کرو جو میں نے تم پر کئے تھے اور اس اقرار کو پورا کرو جو تم نے مجھ سے کیا تھا۔ میں اس اقرار کو پورا کروں گا جو میں نے تم سے کیا تھا اور مجھی سے ڈرتے رہو",
       "english":"O Children of Israel! Remember My favour wherewith I favoured you, and fulfil your (part of the) covenant, I shall fulfil My (part of the) covenant, and fear Me."
       },{
       "arabic":"﴿ وَاٰمِنُوۡا بِمَآ اَنۡزَلۡتُ مُصَدِّقًا لِّمَا مَعَكُمۡ وَلَا تَكُوۡنُوۡآ اَوَّلَ كَافِرٍۢ بِهٖ‌ وَلَا تَشۡتَرُوۡا بِاٰيٰتِىۡ ثَمَنًا قَلِيۡلًا وَّاِيَّاىَ فَاتَّقُوۡنِ",
        "urdu":"اور جو کتاب میں نے (اپنے رسول محمدﷺ پر) نازل کی ہے جو تمہاری کتاب تورات کو سچا کہتی ہے، اس پر ایمان لاؤ اور اس سے منکرِ اول نہ بنو، اور میری آیتوں میں (تحریف کر کے) ان کے بدلے تھوڑی سی قیمت (یعنی دنیاوی منعفت) نہ حاصل کرو، اور مجھی سے خوف رکھو",
       "english":"And believe in that which I reveal, confirming that which ye possess already (of the Scripture), and be not first to disbelieve therein, and part not with My revelations for a trifling price, and keep your duty unto Me."
       },{
       "arabic":"﴿ وَلَا تَلۡبِسُوۡا الۡحَـقَّ بِالۡبَاطِلِ وَتَكۡتُمُوۡا الۡحَـقَّ وَاَنۡتُمۡ تَعۡلَمُوۡنَ",
        "urdu":"اور حق کو باطل کے ساتھ نہ ملاؤ، اور سچی بات کو جان بوجھ کر نہ چھپاؤ",
       "english":"Confound not truth with falsehood, nor knowingly conceal the truth."
       },{
       "arabic":"﴿ وَاَقِيۡمُوۡا الصَّلٰوةَ وَاٰتُوۡا الزَّكٰوةَ وَارۡكَعُوۡا مَعَ الرّٰكِعِيۡنَ",
        "urdu":"اور نماز پڑھا کرو اور زکوٰة دیا کرو اور (خدا کے آگے) جھکنے والوں کے ساتھ جھکا کرو",
       "english":"Establish worship, pay the poor-due, and bow your heads with those who bow (in worship)."
       },{
       "arabic":"﴿ اَتَاۡمُرُوۡنَ النَّاسَ بِالۡبِرِّ وَتَنۡسَوۡنَ اَنۡفُسَكُمۡ وَاَنۡتُمۡ تَتۡلُوۡنَ الۡكِتٰبَ‌ؕ اَفَلَا تَعۡقِلُوۡنَ",
        "urdu":"(یہ) کیا (عقل کی بات ہے کہ) تم لوگوں کو نیکی کرنے کو کہتے ہو اور اپنے تئیں فراموش کئے دیتے ہو، حالانکہ تم کتاب (خدا) بھی پڑھتے ہو۔ کیا تم سمجھتے نہیں؟",
       "english":"Enjoin ye righteousness upon mankind while ye yourselves forget (to practise it)? And ye are readers of the Scripture! Have ye then no sense?"
       },{
       "arabic":"﴿ وَاسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِ‌ؕ وَاِنَّهَا لَكَبِيۡرَةٌ اِلَّا عَلَى الۡخٰشِعِيۡنَۙ",
        "urdu":"اور (رنج وتکلیف میں) صبر اور نماز سے مدد لیا کرو اور بے شک نماز گراں ہے، مگر ان لوگوں پر (گراں نہیں) جو عجز کرنے والے ہیں",
       "english":"Seek help in patience and prayer; and truly it is hard save for the humble-minded,"
       },{
       "arabic":"﴿ الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوۡا رَبِّهِمۡ وَاَنَّهُمۡ اِلَيۡهِ رٰجِعُوۡنَ",
        "urdu":"اور جو یقین کئے ہوئے ہیں کہ وہ اپنے پروردگار سے ملنے والے ہیں اور اس کی طرف لوٹ کر جانے والے ہیں",
       "english":"Who know that they will have to meet their Lord, and that unto Him they are returning."
       },{
       "arabic":"﴿ يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ",
        "urdu":"اے یعقوب کی اولاد! میرے وہ احسان یاد کرو، جو میں نے تم پر کئے تھے اور یہ کہ میں نے تم کو جہان کے لوگوں پر فضیلت بخشی تھی",
       "english":"O Children of Israel! Remember My favour wherewith I favoured you and how I preferred you to (all) creatures."
       },{
       "arabic":"﴿ وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا شَفَاعَةٌ وَّلَا يُؤۡخَذُ مِنۡهَا عَدۡلٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ",
        "urdu":"اور اس دن سے ڈرو جب کوئی کسی کے کچھ کام نہ آئے اور نہ کسی کی سفارش منظور کی جائے اور نہ کسی سے کسی طرح کا بدلہ قبول کیا جائے اور نہ لوگ (کسی اور طرح) مدد حاصل کر سکیں",
       "english":"And guard yourselves against a day when no soul will in aught avail another, nor will intercession be accepted from it, nor will compensation be received from it, nor will they be helped."
       },{
       "arabic":"﴿ وَاِذۡ نَجَّيۡنٰکُمۡ مِّنۡ اٰلِ فِرۡعَوۡنَ يَسُوۡمُوۡنَكُمۡ سُوۡٓءَ الۡعَذَابِ يُذَبِّحُوۡنَ اَبۡنَآءَكُمۡ وَيَسۡتَحۡيُوۡنَ نِسَآءَكُمۡ‌ؕ وَفِىۡ ذٰلِكُمۡ بَلَاۤءٌ مِّنۡ رَّبِّكُمۡ عَظِيۡمٌ",
        "urdu":"اور (ہمارے ان احسانات کو یاد کرو) جب ہم نے تم کو قومِ فرعون سے نجات بخشی وہ (لوگ) تم کو بڑا دکھ دیتے تھے تمہارے بیٹوں کو تو قتل کر ڈالتے تھے اور بیٹیوں کو زندہ رہنے دیتے تھے اور اس میں تمہارے پروردگار کی طرف سے بڑی (سخت) آزمائش تھی",
       "english":"And (remember) when We did deliver you from Pharaoh's folk, who were afflicting you with dreadful torment, slaying your sons and sparing your women: that was a tremendous trial from your Lord."
       },{
       "arabic":"﴿ وَاِذۡ فَرَقۡنَا بِكُمُ الۡبَحۡرَ فَاَنۡجَيۡنٰکُمۡ وَاَغۡرَقۡنَآ اٰلَ فِرۡعَوۡنَ وَاَنۡتُمۡ تَنۡظُرُوۡنَ",
        "urdu":"اور جب ہم نے تمہارے لیے دریا کو پھاڑ دیا تم کو نجات دی اور فرعون کی قوم کو غرق کر دیا اور تم دیکھ ہی تو رہے تھے",
       "english":"And when We brought you through the sea and rescued you, and drowned the folk of Pharaoh in your sight."
       },{
       "arabic":"﴿ وَاِذۡ وٰعَدۡنَا مُوۡسٰٓى اَرۡبَعِيۡنَ لَيۡلَةً ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡتُمۡ ظٰلِمُوۡنَ",
        "urdu":"اور جب ہم نے موسیٰ سے چالیس رات کا وعدہ کیا تو تم نے ان کے پیچھے بچھڑے کو (معبود) مقرر کر لیا اور تم ظلم کر رہے تھے",
       "english":"And when We did appoint for Moses forty nights (of solitude), and then ye chose the calf, when he had gone from you, and were wrong-doers."
       },{
       "arabic":"﴿ ثُمَّ عَفَوۡنَا عَنۡكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ لَعَلَّكُمۡ تَشۡكُرُوۡنَ",
        "urdu":"پھر اس کے بعد ہم نے تم کو معاف کر دیا، تاکہ تم شکر کرو",
       "english":"Then, even after that, We pardoned you in order that ye might give thanks."
       },{
       "arabic":"﴿ وَاِذۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَالۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُوۡنَ",
        "urdu":"اور جب ہم نے موسیٰ کو کتاب اور معجزے عنایت کئے، تاکہ تم ہدایت حاصل کرو",
       "english":"And when We gave unto Moses the Scripture and the criterion (of right and wrong), that ye might be led aright."
       },{
       "arabic":"﴿ وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖ يٰقَوۡمِ اِنَّكُمۡ ظَلَمۡتُمۡ اَنۡفُسَکُمۡ بِاتِّخَاذِكُمُ الۡعِجۡلَ فَتُوۡبُوۡآ اِلٰى بَارِٮِٕكُمۡ فَاقۡتُلُوۡٓا اَنۡفُسَكُمۡؕ ذٰلِكُمۡ خَيۡرٌ لَّـكُمۡ عِنۡدَ بَارِٮِٕكُمۡؕ فَتَابَ عَلَيۡكُمۡ‌ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ",
        "urdu":"اور جب موسیٰ نے اپنی قوم کے لوگوں سے کہا کہ بھائیو، تم نے بچھڑے کو (معبود) ٹھہرانے میں (بڑا) ظلم کیا ہے، تو اپنے پیدا کرنے والے کے آگے توبہ کرو اور اپنے تئیں ہلاک کر ڈالو۔ تمہارے خالق کے نزدیک تمہارے حق میں یہی بہتر ہے۔ پھر اس نے تمہارا قصور معاف کر دیا۔ وہ بے شک معاف کرنے والا (اور) صاحبِ رحم ہے",
       "english":"And when Moses said unto his people: O my people! Ye have wronged yourselves by your choosing of the calf (for worship) so turn in penitence to your Creator, and kill (the guilty) yourselves. That will be best for you with your Creator and He will relent toward you. Lo! He is the Relenting, the Merciful."
       },{
       "arabic":"﴿ وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نُّؤۡمِنَ لَـكَ حَتّٰى نَرَى اللّٰهَ جَهۡرَةً فَاَخَذَتۡكُمُ الصّٰعِقَةُ وَاَنۡتُمۡ تَنۡظُرُوۡنَ",
        "urdu":"اور جب تم نے (موسیٰ) سے کہا کہ موسیٰ، جب تک ہم خدا کو سامنے نہ دیکھ لیں گے، تم پر ایمان نہیں لائیں گے، تو تم کو بجلی نے آ گھیرا اور تم دیکھ رہے تھے",
       "english":"And when ye said: O Moses! We will not believe in thee till we see Allah plainly; and even while ye gazed the lightning seized you."
       },{
       "arabic":"﴿ ثُمَّ بَعَثۡنٰكُمۡ مِّنۡۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّکُمۡ تَشۡكُرُوۡنَ",
        "urdu":"پھر موت آ جانے کے بعد ہم نے تم کو ازسرِ نو زندہ کر دیا، تاکہ احسان مانو",
       "english":"Then We revived you after your extinction, that ye might give thanks."
       },{
       "arabic":"﴿ وَظَلَّلۡنَا عَلَيۡکُمُ الۡغَمَامَ وَاَنۡزَلۡنَا عَلَيۡكُمُ الۡمَنَّ وَالسَّلۡوٰى‌ؕ كُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ‌ؕ وَمَا ظَلَمُوۡنَا وَلٰـكِنۡ كَانُوۡآ اَنۡفُسَهُمۡ يَظۡلِمُوۡنَ",
        "urdu":"اور بادل کا تم پر سایہ کئے رکھا اور (تمہارے لیے) من و سلویٰ اتارتے رہے کہ جو پاکیزہ چیزیں ہم نے تم کو عطا فرمائی ہیں، ان کو کھاؤ (پیو) مگر تمہارے بزرگوں نے ان نعمتوں کی کچھ قدر نہ جانی (اور) وہ ہمارا کچھ نہیں بگاڑتے تھے بلکہ اپنا ہی نقصان کرتے تھے",
       "english":"And We caused the white cloud to overshadow you and sent down on you the manna and the quails, (saying): Eat of the good things wherewith We have provided you - they wronged Us not, but they did wrong themselves."
       },{
       "arabic":"﴿ وَاِذۡ قُلۡنَا ادۡخُلُوۡا هٰذِهِ الۡقَرۡيَةَ فَکُلُوۡا مِنۡهَا حَيۡثُ شِئۡتُمۡ رَغَدًا وَّادۡخُلُوۡا الۡبَابَ سُجَّدًا وَّقُوۡلُوۡا حِطَّةٌ نَّغۡفِرۡ لَـكُمۡ خَطٰيٰكُمۡ‌ؕ وَسَنَزِيۡدُ الۡمُحۡسِنِيۡنَ",
        "urdu":"اور جب ہم نے (ان سے) کہا کہ اس گاؤں میں داخل ہو جاؤ اور اس میں جہاں سے چاہو، خوب کھاؤ (پیو) اور (دیکھنا) دروازے میں داخل ہونا تو سجدہ کرنا اور حطة کہنا، ہم تمہارے گناہ معاف کر دیں گے اور نیکی کرنے والوں کو اور زیادہ دیں گے",
       "english":"And when We said: Go into this township and eat freely of that which is therein, and enter the gate prostrate, and say: Repentance. We will forgive you your sins and will increase (reward) for the right-doers."
       },{
       "arabic":"﴿ فَبَدَّلَ الَّذِيۡنَ ظَلَمُوۡا قَوۡلاً غَيۡرَ الَّذِىۡ قِيۡلَ لَهُمۡ فَاَنۡزَلۡنَا عَلَى الَّذِيۡنَ ظَلَمُوۡا رِجۡزًا مِّنَ السَّمَآءِ بِمَا كَانُوۡا يَفۡسُقُوۡنَ",
        "urdu":"تو جو ظالم تھے، انہوں نے اس لفظ کو، جس کا ان کو حکم دیا تھا، بدل کر اس کی جگہ اور لفظ کہنا شروع کیا، پس ہم نے (ان) ظالموں پر آسمان سے عذاب نازل کیا، کیونکہ نافرمانیاں کئے جاتے تھے",
       "english":"But those who did wrong changed the word which had been told them for another saying, and We sent down upon the evil-doers wrath from heaven for their evil-doing."
       },{
       "arabic":"﴿ وَاِذِ اسۡتَسۡقَىٰ مُوۡسٰى لِقَوۡمِهٖ فَقُلۡنَا اضۡرِب بِّعَصَاكَ الۡحَجَرَ‌ؕ فَانفَجَرَتۡ مِنۡهُ اثۡنَتَا عَشۡرَةَ عَيۡنًا‌ؕ قَدۡ عَلِمَ کُلُّ اُنَاسٍ مَّشۡرَبَهُمۡ‌ؕ کُلُوۡا وَاشۡرَبُوۡا مِنۡ رِّزۡقِ اللّٰهِ وَلَا تَعۡثَوۡا فِىۡ الۡاَرۡضِ مُفۡسِدِيۡنَ",
        "urdu":"اور جب موسیٰ نے اپنی قوم کے لیے (خدا سے) پانی مانگا تو ہم نے کہا کہ اپنی لاٹھی پتھر پر مارو۔ (انہوں نے لاٹھی ماری) تو پھر اس میں سے بارہ چشمے پھوٹ نکلے، اور تمام لوگوں نے اپنا اپنا گھاٹ معلوم کر (کے پانی پی) لیا۔ (ہم نے حکم دیا کہ) خدا کی (عطا فرمائی ہوئی) روزی کھاؤ اور پیو، مگر زمین میں فساد نہ کرتے پھرنا",
       "english":"And when Moses asked for water for his people, We said: Smite with thy staff the rock. And there gushed out therefrom twelve springs (so that) each tribe knew their drinking-place. Eat and drink of that which Allah hath provided, and do not act corruptly, making mischief in the earth."
       },{
       "arabic":"﴿ وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نَّصۡبِرَ عَلٰى طَعَامٍ وَّاحِدٍ فَادۡعُ لَنَا رَبَّكَ يُخۡرِجۡ لَنَا مِمَّا تُنۡۢبِتُ الۡاَرۡضُ مِنۡۢ بَقۡلِهَا وَقِثَّـآٮِٕهَا وَفُوۡمِهَا وَعَدَسِهَا وَ بَصَلِهَا‌ؕ قَالَ اَتَسۡتَبۡدِلُوۡنَ الَّذِىۡ هُوَ اَدۡنٰى بِالَّذِىۡ هُوَ خَيۡرٌ‌ؕ اِهۡبِطُوۡا مِصۡرًا فَاِنَّ لَـکُمۡ مَّا سَاَلۡتُمۡ‌ؕ وَضُرِبَتۡ عَلَيۡهِمُ الذِّلَّةُ وَالۡمَسۡکَنَةُ وَبَآءُوۡ بِغَضَبٍ مِّنَ اللّٰهِ‌ؕ ذٰلِكَ بِاَنَّهُمۡ كَانُوۡا يَكۡفُرُوۡنَ بِاٰيٰتِ اللّٰهِ وَيَقۡتُلُوۡنَ النَّبِيّٖنَ بِغَيۡرِ الۡحَـقِّ‌ؕ ذٰلِكَ بِمَا عَصَوا وَّڪَانُوۡا يَعۡتَدُوۡنَ",
        "urdu":"اور جب تم نے کہا کہ موسیٰ! ہم سے ایک (ہی) کھانے پر صبر نہیں ہو سکتا تو اپنے پروردگار سے دعا کیجئے کہ ترکاری اور ککڑی اور گیہوں اور مسور اور پیاز (وغیرہ) جو نباتات زمین سے اُگتی ہیں، ہمارے لیے پیدا کر دے۔ انہوں نے کہا کہ بھلا عمدہ چیزیں چھوڑ کر ان کے عوض ناقص چیزیں کیوں چاہتے ہوں۔ (اگر یہی چیزیں مطلوب ہیں) تو کسی شہر میں جا اترو، وہاں جو مانگتے ہو، مل جائے گا۔ اور (آخرکار) ذلت (ورسوائی) اور محتاجی (وبے نوائی) ان سے چمٹا دی گئی اور وہ الله کے غضب میں گرفتار ہو گئے۔ یہ اس لیے کہ وہ الله کی آیتوں سے انکار کرتے تھے اور (اس کے) نبیوں کو ناحق قتل کر دیتے تھے۔ (یعنی) یہ اس لیے کہ نافرمانی کئے جاتے اور حد سے بڑھے جاتے تھے",
       "english":"And when ye said: O Moses! We are weary of one kind of food; so call upon thy Lord for us that He bring forth for us of that which the earth groweth - of its herbs and its cucumbers and its corn and its lentils and its onions. He said: Would ye exchange that which is higher for that which is lower? Go down to settled country, thus ye shall get that which ye demand. And humiliation and wretchedness were stamped upon them and they were visited with wrath from Allah. That was because they disbelieved in Allah's revelations and slew the prophets wrongfully. That was for their disobedience and transgression."
       },{
       "arabic":"﴿ اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَادُوۡا وَالنَّصٰرٰى وَالصّٰبِـِٕـيۡنَ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَعَمِلَ صَالِحًـا فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ",
        "urdu":"جو لوگ مسلمان ہیں یا یہودی یا عیسائی یا ستارہ پرست، (یعنی کوئی شخص کسی قوم و مذہب کا ہو) جو خدا اور روز قیامت پر ایمان لائے گا، اور نیک عمل کرے گا، تو ایسے لوگوں کو ان (کے اعمال) کا صلہ خدا کے ہاں ملے گا اور (قیامت کے دن) ان کو نہ کسی طرح کا خوف ہوگا اور نہ وہ غم ناک ہوں گے",
       "english":"Lo! Those who believe (in that which is revealed unto thee, Muhammad), and those who are Jews, and Christians, and Sabaeans - whoever believeth in Allah and the Last Day and doeth right - surely their reward is with their Lord, and there shall no fear come upon them neither shall they grieve."
       },{
       "arabic":"﴿ وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَكُمُ الطُّوۡرَؕ خُذُوۡا مَآ اٰتَيۡنٰكُمۡ بِقُوَّةٍ وَّ اذۡكُرُوۡا مَا فِيۡهِ لَعَلَّكُمۡ تَتَّقُوۡنَ",
        "urdu":"اور جب ہم نے تم سے عہد (کر) لیا اور کوہِ طُور کو تم پر اٹھا کھڑا کیا (اور حکم دیا) کہ جو کتاب ہم نے تم کو دی ہے، اس کو زور سے پکڑے رہو، اور جو اس میں (لکھا) ہے، اسے یاد رکھو، تاکہ (عذاب سے) محفوظ رہو",
       "english":"And (remember, O Children of Israel) when We made a covenant with you and caused the mount to tower above you, (saying): Hold fast that which We have given you, and remember that which is therein, that ye may ward off (evil)."
       },{
       "arabic":"﴿ ثُمَّ تَوَلَّيۡتُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ‌‌ۚ فَلَوۡلَا فَضۡلُ اللّٰهِ عَلَيۡكُمۡ وَرَحۡمَتُهٗ لَـكُنۡتُمۡ مِّنَ الۡخٰسِرِيۡنَ",
        "urdu":"تو تم اس کے بعد (عہد سے) پھر گئے اور اگر تم پر خدا کا فضل اور اس کی مہربانی نہ ہوتی تو تم خسارے میں پڑے گئے ہوتے",
       "english":"Then, even after that, ye turned away, and if it had not been for the grace of Allah and His mercy ye had been among the losers."
       },{
       "arabic":"﴿ وَلَقَدۡ عَلِمۡتُمُ الَّذِيۡنَ اعۡتَدَوۡا مِنۡكُمۡ فِىۡ السَّبۡتِ فَقُلۡنَا لَهُمۡ كُوۡنُوۡا قِرَدَةً خَاسِـِٔـيۡنَ‌ۚ",
        "urdu":"اور تم ان لوگوں کو خوب جانتے ہوں، جو تم میں سے ہفتے کے دن (مچھلی کا شکار کرنے) میں حد سے تجاوز کر گئے تھے، تو ہم نے ان سے کہا کہ ذلیل وخوار بندر ہو جاؤ",
       "english":"And ye know of those of you who broke the Sabbath, how We said unto them: Be ye apes, despised and hated!"
       },{
       "arabic":"﴿ فَجَعَلۡنٰهَا نَكٰلاً لِّمَا بَيۡنَ يَدَيۡهَا وَمَا خَلۡفَهَا وَمَوۡعِظَةً لِّلۡمُتَّقِيۡنَ",
        "urdu":"اور اس قصے کو اس وقت کے لوگوں کے لیے اور جو ان کے بعد آنے والے تھے عبرت اور پرہیز گاروں کے لیے نصیحت بنا دیا",
       "english":"And We made it an example to their own and to succeeding generations, and an admonition to the Allah-fearing."
       },{
       "arabic":"﴿ وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖۤ اِنَّ اللّٰهَ يَاۡمُرُكُمۡ اَنۡ تَذۡبَحُوۡا بَقَرَةً‌ؕ قَالُوۡآ اَتَتَّخِذُنَا هُزُوًۡا‌ؕ قَالَ اَعُوۡذُ بِاللّٰهِ اَنۡ اَكُوۡنَ مِنَ الۡجٰـهِلِيۡنَ",
        "urdu":"اور جب موسیٰ نے اپنی قوم کے لوگوں سے کہا کہ خدا تم کو حکم دیتا ہے کہ ایک بیل ذبح کرو۔ وہ بولے، کیا تم ہم سے ہنسی کرتے ہو۔ (موسیٰ نے) کہا کہ میں الله کی پناہ مانگتا ہوں کہ نادان بنوں",
       "english":"And when Moses said unto his people: Lo! Allah commandeth you that ye sacrifice a cow, they said: Dost thou make game of us? He answered: Allah forbid that I should be among the foolish!"
       },{
       "arabic":"﴿ قَالُوۡا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَ‌ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَّلَا بِكۡرٌؕ عَوَانٌۢ بَيۡنَ ذٰلِكَ‌ؕ فَافۡعَلُوۡا مَا تُؤۡمَرُوۡنَ",
        "urdu":"انہوں نے کہا کہ اپنے پروردگار سے التجا کیجئے کہ وہ ہمیں یہ بتائے کہ وہ بیل کس طرح کا ہو۔ (موسیٰ نے) کہا کہ پروردگار فرماتا ہے کہ وہ بیل نہ تو بوڑھا ہو اور نہ بچھڑا، بلکہ ان کے درمیان (یعنی جوان) ہو۔ جیسا تم کو حکم دیا گیا ہے، ویسا کرو",
       "english":"They said: Pray for us unto thy Lord that He make clear to us what (cow) she is. (Moses) answered: Lo! He saith, Verily she is a cow neither with calf nor immature; (she is) between the two conditions; so do that which ye are commanded."
       },{
       "arabic":"﴿ قَالُوۡا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا لَوۡنُهَا‌ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ صَفۡرَآءُۙ فَاقِعٌ لَّوۡنُهَا تَسُرُّ النّٰظِرِيۡنَ",
        "urdu":"انہوں نے کہا کہ پروردگار سے درخواست کیجئے کہ ہم کو یہ بھی بتائے کہ اس کا رنگ کیسا ہو۔ موسیٰ نے کہا ، پروردگار فرماتا ہے کہ اس کا رنگ گہرا زرد ہو کہ دیکھنے والوں (کے دل) کو خوش کر دیتا ہو",
       "english":"They said: Pray for us unto thy Lord that He make clear to us of what colour she is. (Moses) answered: Lo! He saith: Verily she is a yellow cow. Bright is her colour, gladdening beholders."
       },{
       "arabic":"﴿ قَالُوۡا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَۙ اِنَّ الۡبَقَرَ تَشٰبَهَ عَلَيۡنَاؕ وَاِنَّـآ اِنۡ شَآءَ اللّٰهُ لَمُهۡتَدُوۡنَ",
        "urdu":"انہوں نے کہا کہ (اب کے) پروردگار سے پھر درخواست کیجئے کہ ہم کو بتا دے کہ وہ اور کس کس طرح کا ہو، کیونکہ بہت سے بیل ہمیں ایک دوسرے کے مشابہ معلوم ہوتے ہیں، (پھر) خدا نے چاہا تو ہمیں ٹھیک بات معلوم ہو جائے گی",
       "english":"They said: Pray for us unto thy Lord that He make clear to us what (cow) she is. Lo! cows are much alike to us; and Lo! if Allah wills, we may be led aright."
       },{
       "arabic":"﴿ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا ذَلُوۡلٌ تُثِيۡرُ الۡاَرۡضَ وَلَا تَسۡقِىۡ الۡحَـرۡثَ‌ۚ مُسَلَّمَةٌ لَّا شِيَةَ فِيۡهَا‌ؕ قَالُوۡا الۡـٰٔـنَ جِئۡتَ بِالۡحَـقِّ‌ؕ فَذَبَحُوۡهَا وَمَا كَادُوۡا يَفۡعَلُوۡنَ",
        "urdu":"موسیٰ نے کہا کہ خدا فرماتا ہے کہ وہ بیل کام میں لگا ہوا نہ ہو، نہ تو زمین جوتتا ہو اور نہ کھیتی کو پانی دیتا ہو۔ اس میں کسی طرح کا داغ نہ ہو۔ کہنے لگے، اب تم نے سب باتیں درست بتا دیں۔ غرض (بڑی مشکل سے) انہوں نے اس بیل کو ذبح کیا، اور وہ ایسا کرنے والے تھے نہیں",
       "english":"(Moses) answered: Lo! He saith: Verily she is a cow unyoked; she plougheth not the soil nor watereth the tilth; whole and without mark. They said: Now thou bringest the truth. So they sacrificed her, though almost they did not."
       },{
       "arabic":"﴿ وَ اِذۡ قَتَلۡتُمۡ نَفۡسًا فَادّٰرَءۡتُمۡ فِيۡهَا‌ؕ وَاللّٰهُ مُخۡرِجٌ مَّا كُنۡتُمۡ تَكۡتُمُوۡنَۚ",
        "urdu":"اور جب تم نے ایک شخص کو قتل کیا، تو اس میں باہم جھگڑنے لگے۔ لیکن جو بات تم چھپا رہے تھے، خدا اس کو ظاہر کرنے والا تھا",
       "english":"And (remember) when ye slew a man and disagreed concerning it and Allah brought forth that which ye were hiding."
       },{
       "arabic":"﴿ فَقُلۡنَا اضۡرِبُوۡهُ بِبَعۡضِهَا‌ؕ كَذٰلِكَ يُحۡىِ اللّٰهُ الۡمَوۡتٰىۙ وَيُرِيۡکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ",
        "urdu":"تو ہم نے کہا کہ اس بیل کا کوئی سا ٹکڑا مقتول کو مارو۔ اس طرح خدا مردوں کو زندہ کرتا ہے اور تم کو اپنی (قدرت کی) نشانیاں دکھاتا ہے تاکہ تم سمجھو",
       "english":"And We said: Smite him with some of it. Thus Allah bringeth the dead to life and showeth you His portents so that ye may understand."
       },{
       "arabic":"﴿ ثُمَّ قَسَتۡ قُلُوۡبُكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ فَهِىَ كَالۡحِجَارَةِ اَوۡ اَشَدُّ قَسۡوَةً‌ؕ وَاِنَّ مِنَ الۡحِجَارَةِ لَمَا يَتَفَجَّرُ مِنۡهُ الۡاَنۡهٰرُ‌ؕ وَاِنَّ مِنۡهَا لَمَا يَشَّقَّقُ فَيَخۡرُجُ مِنۡهُ الۡمَآءُ‌ؕ وَاِنَّ مِنۡهَا لَمَا يَهۡبِطُ مِنۡ خَشۡيَةِ اللّٰهِ‌ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ",
        "urdu":"پھر اس کے بعد تمہارے دل سخت ہو گئے۔ گویا وہ پتھر ہیں یا ان سے بھی زیادہ سخت۔ اور پتھر تو بعضے ایسے ہوتے ہیں کہ ان میں سے چشمے پھوٹ نکلتے ہیں، اور بعضے ایسے ہوتے ہیں کہ پھٹ جاتے ہیں،اور ان میں سے پانی نکلنے لگتا ہے، اور بعضے ایسے ہوتے ہیں کہ خدا کے خوف سے گر پڑتے ہیں، اور خدا تمہارے عملوں سے بے خبر نہیں",
       "english":"Then, even after that, your hearts were hardened and became as rocks, or worse than rocks, for hardness. For indeed there are rocks from out which rivers gush, and indeed there are rocks which split asunder so that water floweth from them. And indeed there are rocks which fall down for the fear of Allah. Allah is not unaware of what ye do."
       },{
       "arabic":"﴿ اَفَتَطۡمَعُوۡنَ اَنۡ يُّؤۡمِنُوۡا لَـكُمۡ وَقَدۡ كَانَ فَرِيۡقٌ مِّنۡهُمۡ يَسۡمَعُوۡنَ کَلَامَ اللّٰهِ ثُمَّ يُحَرِّفُوۡنَهٗ مِنۡۢ بَعۡدِ مَا عَقَلُوۡهُ وَهُمۡ يَعۡلَمُوۡنَ",
        "urdu":"(مومنو) کیا تم امید رکھتے ہو کہ یہ لوگ تمہارے (دین کے) قائل ہو جائیں گے، (حالانکہ) ان میں سے کچھ لوگ کلامِ خدا (یعنی تورات) کو سنتے، پھر اس کے سمجھ لینے کے بعد اس کو جان بوجھ کر بدل دیتے رہے ہیں",
        "english":"Have ye any hope that they will be true to you when a party of them used to listen to the word of Allah, then used to change it, after they had understood it, knowingly?"
       },{
       "arabic":"﴿ وَاِذَا لَـقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡآ اٰمَنَّاۖۚ وَاِذَا خَلَا بَعۡضُهُمۡ اِلٰى بَعۡضٍ قَالُوۡآ اَتُحَدِّثُوۡنَهُمۡ بِمَا فَتَحَ اللّٰهُ عَلَيۡكُمۡ لِيُحَآجُّوۡكُمۡ بِهٖ عِنۡدَ رَبِّكُمۡ‌ؕ اَفَلَا تَعۡقِلُوۡنَ",
        "urdu":"اور یہ لوگ جب مومنوں سے ملتے ہیں تو کہتے ہیں، ہم ایمان لے آئے ہیں۔ اور جب آپس میں ایک دوسرے سے ملتے ہیں تو کہتے ہیں، جو بات خدا نے تم پر ظاہر فرمائی ہے، وہ تم ان کو اس لیے بتائے دیتے ہو کہ (قیامت کے دن) اسی کے حوالے سے تمہارے پروردگار کے سامنے تم کو الزام دیں۔ کیا تم سمجھتے نہیں؟",
       "english":"And when they fall in with those who believe, they say: We believe. But when they go apart one with another they say: Prate ye to them of that which Allah hath disclosed to you that they may contend with you before your Lord concerning it? Have ye then no sense?"
       },{
       "arabic":"﴿ اَوَلَا يَعۡلَمُوۡنَ اَنَّ اللّٰهَ يَعۡلَمُ مَا يُسِرُّوۡنَ وَمَا يُعۡلِنُوۡنَ",
        "urdu":"کیا یہ لوگ یہ نہیں جانتے کہ جو کچھ یہ چھپاتے اور جو کچھ ظاہر کرتے ہیں، خدا کو (سب) معلوم ہے",
       "english":"Are they then unaware that Allah knoweth that which they keep hidden and that which they proclaim?"
       },{
       "arabic":"﴿ وَ مِنۡهُمۡ اُمِّيُّوۡنَ لَا يَعۡلَمُوۡنَ الۡكِتٰبَ اِلَّاۤ اَمَانِىَّ وَاِنۡ هُمۡ اِلَّا يَظُنُّوۡنَ",
        "urdu":"اور بعض ان میں ان پڑھ ہیں کہ اپنے باطل خیالات کے سوا (خدا کی) کتاب سے واقف ہی نہیں اور وہ صرف ظن سے کام لیتے ہیں",
       "english":"Among them are unlettered folk who know the Scripture not except from hearsay. They but guess."
       },{
       "arabic":"﴿ فَوَيۡلٌ لِّلَّذِيۡنَ يَكۡتُبُوۡنَ الۡكِتٰبَ بِاَيۡدِيۡهِمۡ ثُمَّ يَقُوۡلُوۡنَ هٰذَا مِنۡ عِنۡدِ اللّٰهِ لِيَشۡتَرُوۡا بِهٖ ثَمَنًا قَلِيۡلًاؕ فَوَيۡلٌ لَّهُمۡ مِّمَّا کَتَبَتۡ اَيۡدِيۡهِمۡ وَوَيۡلٌ لَّهُمۡ مِّمَّا يَكۡسِبُوۡنَ",
        "urdu":"تو ان لوگوں پر افسوس ہے جو اپنے ہاتھ سے تو کتاب لکھتے ہیں اور کہتے یہ ہیں کہ یہ خدا کے پاس سے (آئی) ہے، تاکہ اس کے عوض تھوڑی سے قیمت (یعنی دنیوی منفعت) حاصل کریں۔ ان پر افسوس ہے، اس لیے کہ (بےاصل باتیں) اپنے ہاتھ سے لکھتے ہیں اور (پھر) ان پر افسوس ہے، اس لیے کہ ایسے کام کرتے ہیں",
       "english":"Therefore woe be unto those who write the Scripture with their hands and then say, This is from Allah, that they may purchase a small gain therewith. Woe unto them for that their hands have written, and woe unto them for that they earn thereby."
       },{
       "arabic":"﴿ وَقَالُوۡا لَنۡ تَمَسَّنَا النَّارُ اِلَّاۤ اَيَّامًا مَّعۡدُوۡدَةً‌ؕ قُلۡ اَتَّخَذۡتُمۡ عِنۡدَ اللّٰهِ عَهۡدًا فَلَنۡ يُّخۡلِفَ اللّٰهُ عَهۡدَهٗۤ‌ اَمۡ تَقُوۡلُوۡنَ عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ",
        "urdu":"اور کہتے ہیں کہ (دوزخ کی) آگ ہمیں چند روز کے سوا چھو ہی نہیں سکے گی۔ ان سے پوچھو، کیا تم نے خدا سے اقرار لے رکھا ہے کہ خدا اپنے اقرار کے خلاف نہیں کرے گا۔ (نہیں)، بلکہ تم خدا کے بارے میں ایسی باتیں کہتے ہو جن کا تمہیں مطلق علم نہیں",
       "english":"And they say: The Fire (of punishment) will not touch us save for a certain number of days. Say: Have ye received a covenant from Allah - truly Allah will not break His covenant - or tell ye concerning Allah that which ye know not?"
       },{
       "arabic":"﴿ بَلٰى مَنۡ كَسَبَ سَيِّئَةً وَّاَحَاطَتۡ بِهٖ خَطِيۡٓـَٔـتُهٗ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ‌‌ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ",
        "urdu":"ہاں جو برے کام کرے، اور اس کے گناہ (ہر طرف سے) گھیر لیں تو ایسے لوگ دوزخ (میں جانے) والے ہیں (اور) وہ ہمیشہ اس میں (جلتے) رہیں گے",
       "english":"Nay, but whosoever hath done evil and his sin surroundeth him; such are rightful owners of the Fire; they will abide therein."
       },{
       "arabic":"﴿ وَالَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوۡا الصّٰلِحٰتِ اُولٰٓٮِٕكَ اَصۡحَابُ الۡجَـنَّةِ‌‌ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ",
        "urdu":"اور جو ایمان لائیں اور نیک کام کریں، وہ جنت کے مالک ہوں گے (اور) ہمیشہ اس میں (عیش کرتے) رہیں گے",
       "english":"And those who believe and do good works: such are rightful owners of the Garden. They will abide therein."
       },{
       "arabic":"﴿ وَاِذۡ اَخَذۡنَا مِيۡثَاقَ بَنِىۡٓ اِسۡرَآءِيۡلَ لَا تَعۡبُدُوۡنَ اِلَّا اللّٰهَ وَبِالۡوَالِدَيۡنِ اِحۡسَانًا وَّذِىۡ الۡقُرۡبَىٰ وَالۡيَتٰمٰى وَالۡمَسٰکِيۡنِ وَقُوۡلُوۡا لِلنَّاسِ حُسۡنًا وَّاَقِيۡمُوۡا الصَّلٰوةَ وَاٰتُوۡا الزَّکٰوةَؕ ثُمَّ تَوَلَّيۡتُمۡ اِلَّا قَلِيۡلًا مِّنۡکُمۡ وَاَنۡتُمۡ مُّعۡرِضُوۡنَ",
        "urdu":"اور جب ہم نے بنی اسرائیل سے عہد لیا کہ خدا کے سوا کسی کی عبادت نہ کرنا اور ماں باپ اور رشتہ داروں اور یتیموں اور محتاجوں کے ساتھ بھلائی کرتے رہنا اور لوگوں سے اچھی باتیں کہنا، اور نماز پڑھتے اور زکوٰة دیتے رہنا، تو چند شخصوں کے سوا تم سب (اس عہد سے) منہ پھیر کر پھر بیٹھے",
       "english":"And (remember) when We made a covenant with the Children of Israel, (saying): Worship none save Allah (only), and be good to parents and to kindred and to orphans and the needy, and speak kindly to mankind; and establish worship and pay the poor-due. Then, after that, ye slid back, save a few of you, being averse."
       },{
       "arabic":"﴿ وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ لَا تَسۡفِكُوۡنَ دِمَآءَكُمۡ وَلَا تُخۡرِجُوۡنَ اَنۡفُسَكُمۡ مِّنۡ دِيَارِكُمۡ ثُمَّ اَقۡرَرۡتُمۡ وَاَنۡتُمۡ تَشۡهَدُوۡنَ",
        "urdu":"اور جب ہم نے تم سے عہد لیا کہ آپس میں کشت وخون نہ کرنا اور اپنے کو ان کے وطن سے نہ نکالنا تو تم نے اقرار کر لیا، اور تم (اس بات کے) گواہ ہو",
       "english":"And when We made with you a covenant (saying): Shed not the blood of your people nor turn (a party of) your people out of your dwellings. Then ye ratified (Our covenant) and ye were witnesses (thereto)."
       },{
       "arabic":"﴿ ثُمَّ اَنۡتُمۡ هٰٓؤُلَاۤءِ تَقۡتُلُوۡنَ اَنۡفُسَكُمۡ وَتُخۡرِجُوۡنَ فَرِيۡقًا مِّنۡكُمۡ مِّنۡ دِيَارِهِمۡ تَظٰهَرُوۡنَ عَلَيۡهِمۡ بِالۡاِثۡمِ وَالۡعُدۡوَانِؕ وَاِنۡ يَّاۡتُوۡكُمۡ اُسٰرٰى تُفٰدُوۡهُمۡ وَهُوَ مُحَرَّمٌۡ عَلَيۡڪُمۡ اِخۡرَاجُهُمۡ‌‌ؕ اَفَتُؤۡمِنُوۡنَ بِبَعۡضِ الۡكِتٰبِ وَتَكۡفُرُوۡنَ بِبَعۡضٍ‌ۚ فَمَا جَزَآءُ مَنۡ يَّفۡعَلُ ذٰلِكَ مِنۡکُمۡ اِلَّا خِزۡىٌ فِىۡ الۡحَيٰوةِ الدُّنۡيَا‌ۚ وَيَوۡمَ الۡقِيٰمَةِ يُرَدُّوۡنَ اِلٰٓى اَشَدِّ الۡعَذَابِ‌ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ",
        "urdu":"پھر تم وہی ہو کہ اپنوں کو قتل بھی کر دیتے ہو اور اپنے میں سے بعض لوگوں پر گناہ اور ظلم سے چڑھائی کرکے انہیں وطن سے نکال بھی دیتے ہو، اور اگر وہ تمہارے پاس قید ہو کر آئیں تو بدلہ دے کر ان کو چھڑا بھی لیتے ہو، حالانکہ ان کا نکال دینا ہی تم کو حرام تھا۔ (یہ) کیا (بات ہے کہ) تم کتابِ (خدا) کے بعض احکام کو تو مانتے ہو اور بعض سے انکار کئے دیتے ہو، تو جو تم میں سے ایسی حرکت کریں، ان کی سزا اس کے سوا اور کیا ہو سکتی ہے کہ دنیا کی زندگی میں تو رسوائی ہو اور قیامت کے دن سخت سے سخت عذاب میں ڈال دیئے جائیں اور جو کام تم کرتے ہو، خدا ان سے غافل نہیں",
       "english":"Yet ye it is who slay each other and drive out a party of your people from their homes, supporting one another against them by sin and transgression? - and if they came to you as captives ye would ransom them, whereas their expulsion was itself unlawful for you - Believe ye in part of the Scripture and disbelieve ye in part thereof? And what is the reward of those who do so save ignominy in the life of the world, and on the Day of Resurrection they will be consigned to the most grievous doom. For Allah is not unaware of what ye do."
       },{
       "arabic":"﴿ اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الۡحَيٰوةَ الدُّنۡيَا بِالۡاٰخِرَةِ‌ فَلَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡصَرُوۡنَ",
        "urdu":"یہ وہ لوگ ہیں جنہوں نے آخرت کے بدلے دنیا کی زندگی خریدی۔ سو نہ تو ان سے عذاب ہی ہلکا کیا جائے گا اور نہ ان کو (اور طرح کی) مدد ملے گی",
       "english":"Such are those who buy the life of the world at the price of the Hereafter. Their punishment will not be lightened, neither will they have support."
       },{
       "arabic":"﴿ وَ لَقَدۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَقَفَّيۡنَا مِنۡۢ بَعۡدِهٖ بِالرُّسُلِ‌ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ‌ؕ اَفَكُلَّمَا جَآءَكُمۡ رَسُوۡلٌۢ بِمَا لَا تَهۡوٰٓى اَنۡفُسُكُمُ اسۡتَكۡبَرۡتُمۡ‌ۚ فَفَرِيۡقًا كَذَّبۡتُمۡ وَفَرِيۡقًا تَقۡتُلُوۡنَ",
         "urdu":"اور ہم نے موسیٰ کو کتاب عنایت کی اور ان کے پیچھے یکے بعد دیگرے پیغمبر بھیجتے رہے اور عیسیٰ بن مریم کو کھلے نشانات بخشے اور روح القدس (یعنی جبرئیل) سے ان کو مدد دی۔تو جب کوئی پیغمبر تمہارے پاس ایسی باتیں لے کر آئے، جن کو تمہارا جی نہیں چاہتا تھا، تو تم سرکش ہو جاتے رہے، اور ایک گروہ (انبیاء) کو تو جھٹلاتے رہے اور ایک گروہ کو قتل کرتے رہے",
       "english":"And verily We gave unto Moses the Scripture and We caused a train of messengers to follow after him, and We gave unto Jesus, son of Mary, clear proofs (of Allah's sovereignty), and We supported him with the Holy spirit. Is it ever so, that, when there cometh unto you a messenger (from Allah) with that which ye yourselves desire not, ye grow arrogant, and some ye disbelieve and some ye slay?"
       },{
       "arabic":"﴿ وَقَالُوۡا قُلُوۡبُنَا غُلۡفٌ‌ؕ بَل لَّعَنَهُمُ اللّٰهُ بِكُفۡرِهِمۡ فَقَلِيۡلاً مَّا يُؤۡمِنُوۡنَ",
        "urdu":"اور کہتے ہیں، ہمارے دل پردے میں ہیں۔ (نہیں) بلکہ الله نے ان کے کفر کے سبب ان پر لعنت کر رکھی ہے۔ پس یہ تھوڑے ہی پر ایمان لاتے ہیں",
       "english":"And they say: Our hearts are hardened. Nay, but Allah hath cursed them for their unbelief. Little is that which they believe."
       },{
       "arabic":"﴿ وَلَمَّا جَآءَهُمۡ كِتٰبٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡۙ وَكَانُوۡا مِنۡ قَبۡلُ يَسۡتَفۡتِحُوۡنَ عَلَى الَّذِيۡنَ كَفَرُوۡا‌ۖۚ فَلَمَّا جَآءَهُمۡ مَّا عَرَفُوۡا کَفَرُوۡا بِهٖ‌ فَلَعۡنَةُ اللّٰهِ عَلَى الۡكٰفِرِيۡنَ",
        "urdu":"اور جب الله کے ہاں سے ان کے پاس کتاب آئی جو ان کی (آسمانی) کتاب کی بھی تصدیق کرتی ہے، اور وہ پہلے (ہمیشہ) کافروں پر فتح مانگا کرتے تھے، تو جس چیز کو وہ خوب پہچانتے تھے، جب ان کے پاس آپہنچی تو اس سے کافر ہو گئے۔ پس کافروں پر الله کی لعنت",
       "english":"And when there cometh unto them a scripture from Allah, confirming that in their possession - though before that they were asking for a signal triumph over those who disbelieved - and when there cometh unto them that which they know (to be the truth) they disbelieve therein. The curse of Allah is on disbelievers."
       },{
       "arabic":"﴿ بِئۡسَمَا اشۡتَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ اَنۡ يَّڪۡفُرُوۡا بِمَآ اَنۡزَلَ اللّٰهُ بَغۡيًا اَنۡ يُّنَزِّلَ اللّٰهُ مِنۡ فَضۡلِهٖ عَلٰى مَنۡ يَّشَآءُ مِنۡ عِبَادِهٖ‌ۚ فَبَآءُوۡ بِغَضَبٍ عَلٰى غَضَبٍ‌ؕ وَلِلۡكٰفِرِيۡنَ عَذَابٌ مُّهِيۡنٌ",
        "urdu":"جس چیز کے بدلے انہوں نے اپنے تئیں بیچ ڈالا، وہ بہت بری ہے، یعنی اس جلن سے کہ خدا اپنے بندوں میں جس پر چاہتا ہے، اپنی مہربانی سے نازل فرماتا ہے۔ خدا کی نازل کی ہوئی کتاب سے کفر کرنے لگے تو وہ (اس کے) غضب بالائے غضب میں مبتلا ہو گئے۔ اور کافروں کے لیے ذلیل کرنے والا عذاب ہے",
       "english":"Evil is that for which they sell their souls: that they should disbelieve in that which Allah hath revealed, grudging that Allah should reveal of His bounty unto whom He will of His slaves. They have incurred anger upon anger. For disbelievers is a shameful doom."
       },{
       "arabic":"﴿ وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا بِمَآ اَنۡزَلَ اللّٰهُ قَالُوۡا نُؤۡمِنُ بِمَآ اُنۡزِلَ عَلَيۡنَا وَيَكۡفُرُوۡنَ بِمَا وَرَآءَهٗ وَهُوَ الۡحَـقُّ مُصَدِّقًا لِّمَا مَعَهُمۡ‌ؕ قُلۡ فَلِمَ تَقۡتُلُوۡنَ اَنۡــۢبِيَآءَ اللّٰهِ مِنۡ قَبۡلُ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ",
        "urdu":"اور جب ان سے کہا جاتا ہے کہ جو (کتاب) خدا نے (اب) نازل فرمائی ہے، اس کو مانو۔ تو کہتے ہیں کہ جو کتاب ہم پر (پہلے) نازل ہو چکی ہے، ہم تو اسی کو مانتے ہیں۔ (یعنی) یہ اس کے سوا کسی اور (کتاب) کو نہیں مانتے، حالانکہ وہ (سراسر) سچی ہے اور جو ان کی (آسمانی) کتاب ہے، اس کی بھی تصدیق کرتی ہے۔ (ان سے) کہہ دو کہ اگر تم صاحبِ ایمان ہوتے تو الله کے پیغمبروں کو پہلے ہی کیوں قتل کیا کرتے",
       "english":"And when it is said unto them: Believe in that which Allah hath revealed, they say: We believe in that which was revealed unto us. And they disbelieve in that which cometh after it, though it is the truth confirming that which they possess. Say (unto them, O Muhammad): Why then slew ye the prophets of Allah aforetime, if ye are (indeed) believers?"
       },{
       "arabic":"﴿ وَلَقَدۡ جَآءَکُمۡ مُّوۡسٰى بِالۡبَيِّنٰتِ ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡتُمۡ ظٰلِمُوۡنَ",
        "urdu":"اور موسیٰ تمہارے پاس کھلے ہوئے معجزات لے کر آئے تو تم ان کے (کوہِ طور جانے کے) بعد بچھڑے کو معبود بنا بیٹھے اور تم (اپنے ہی حق میں) ظلم کرتے تھے<",
       "english":"And Moses came unto you with clear proofs (of Allah's Sovereignty), yet, while he was away, ye chose the calf (for worship) and ye were wrong-doers."
       },{
       "arabic":"﴿ وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَکُمُ الطُّوۡرَؕ خُذُوۡا مَآ اٰتَيۡنٰکُمۡ بِقُوَّةٍ وَّاسۡمَعُوۡا‌ؕ قَالُوۡا سَمِعۡنَا وَعَصَيۡنَا وَاُشۡرِبُوۡا فِىۡ قُلُوۡبِهِمُ الۡعِجۡلَ بِکُفۡرِهِمۡ‌ؕ قُلۡ بِئۡسَمَا يَاۡمُرُکُمۡ بِهٖۤ اِيۡمَانُكُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ",
        "urdu":"اور جب ہم نے تم (لوگوں) سے عہد واثق لیا اور کوہ طور کو تم پر اٹھا کھڑا کیا (اور حکم دیا کہ) جو (کتاب) ہم نے تم کو دی ہے، اس کو زور سے پکڑو اور جو تمہیں حکم ہوتا ہے (اس کو) سنو تو وہ (جو تمہارے بڑے تھے) کہنے لگے کہ ہم نے سن تو لیا لیکن مانتے نہیں۔ اور ان کے کفر کے سبب بچھڑا (گویا) ان کے دلوں میں رچ گیا تھا۔ (اے پیغمبر ان سے) کہہ دو کہ اگر تم مومن ہو تو تمہارا ایمان تم کو بری بات بتاتا ہے",
       "english":"And when We made with you a covenant and caused the Mount to tower above you, (saying): Hold fast by that which We have given you, and hear (Our Word), they said: We hear and we rebel. And (worship of) the calf was made to sink into their hearts because of their rejection (of the covenant). Say (unto them): Evil is that which your belief enjoineth on you, if ye are believers."
       },{
       "arabic":"﴿ قُلۡ اِنۡ كَانَتۡ لَـکُمُ الدَّارُ الۡاٰخِرَةُ عِنۡدَ اللّٰهِ خَالِصَةً مِّنۡ دُوۡنِ النَّاسِ فَتَمَنَّوُا الۡمَوۡتَ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ",
        "urdu":"کہہ دو کہ اگر آخرت کا گھر اور لوگوں (یعنی مسلمانوں) کے لیے نہیں اور خدا کے نزدیک تمہارے ہی لیے مخصوص ہے تو اگر سچے ہو تو موت کی آرزو تو کرو",
       "english":"Say (unto them): If the abode of the Hereafter in the providence of Allah is indeed for you alone and not for others of mankind (as ye pretend), then long for death (for ye must long for death) if ye are truthful."
       },{
       "arabic":"﴿ وَ لَنۡ يَّتَمَنَّوۡهُ اَبَدًاۢ بِمَا قَدَّمَتۡ اَيۡدِيۡهِمۡ‌ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ",
        "urdu":"لیکن ان اعمال کی وجہ سے، جو ان کے ہاتھ آگے بھیج چکے ہیں، یہ کبھی اس کی آرزو نہیں کریں گے، اور خدا ظالموں سے (خوب) واقف ہے",
       "english":"But they will never long for it, because of that which their own hands have sent before them. Allah is aware of evil-doers."
       },{
       "arabic":"﴿ وَلَتَجِدَنَّهُمۡ اَحۡرَصَ النَّاسِ عَلٰى حَيٰوةٍۛۚ وَ مِنَ الَّذِيۡنَ اَشۡرَكُوۡا‌‌ۛۚ يَوَدُّ اَحَدُهُمۡ لَوۡ يُعَمَّرُ اَلۡفَ سَنَةٍۚ وَمَا هُوَ بِمُزَحۡزِحِهٖ مِنَ الۡعَذَابِ اَنۡ يُّعَمَّرَ‌ؕ وَاللّٰهُ بَصِيۡرٌۢ بِمَا يَعۡمَلُوۡنَ",
        "urdu":"بلکہ ان کو تم اور لوگوں سے زندگی کے کہیں حریص دیکھو گے، یہاں تک کہ مشرکوں سے بھی۔ ان میں سے ہر ایک یہی خواہش کرتا ہے کہ کاش وہ ہزار برس جیتا رہے، مگر اتنی لمبی عمر اس کو مل بھی جائے تو اسے عذاب سے تو نہیں چھڑا سکتی۔ اور جو کام یہ کرتے ہیں، خدا ان کو دیکھ رہا ہے",
       "english":"And thou wilt find them greediest of mankind for life and (greedier) than the idolaters. (Each) one of them would like to be allowed to live a thousand years. And to live (a thousand years) would be no means remove him from the doom. Allah is Seer of what they do."
       },{
       "arabic":"﴿ قُلۡ مَنۡ كَانَ عَدُوًّا لِّجِبۡرِيۡلَ فَاِنَّهٗ نَزَّلَهٗ عَلٰى قَلۡبِكَ بِاِذۡنِ اللّٰهِ مُصَدِّقًا لِّمَا بَيۡنَ يَدَيۡهِ وَهُدًى وَّبُشۡرٰى لِلۡمُؤۡمِنِيۡنَ",
        "urdu":"کہہ دو کہ جو شخص جبرئیل کا دشمن ہو (اس کو غصے میں مر جانا چاہیئے) اس نے تو (یہ کتاب) خدا کے حکم سے تمہارے دل پر نازل کی ہے جو پہلی کتابوں کی تصدیق کرتی ہے، اور ایمان والوں کے لیے ہدایت اور بشارت ہے",
       "english":"Say (O Muhammad, to mankind): Who is an enemy to Gabriel! For he it is who hath revealed (this Scripture) to thy heart by Allah's leave, confirming that which was (revealed) before it, and a guidance and glad tidings to believers;"
       },{
       "arabic":"﴿ مَنۡ كَانَ عَدُوًّا لِّلَّهِ وَمَلٰٓٮِٕکَتِهٖ وَ رُسُلِهٖ وَجِبۡرِيۡلَ وَمِيۡكٰٮلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلۡكٰفِرِيۡنَ",
        "urdu":"جو شخص خدا کا اور اس کے فرشتوں کا اور اس کے پیغمبروں کا اور جبرئیل اور میکائیل کا دشمن ہو تو ایسے کافروں کا خدا دشمن ہے",
       "english":"Who is an enemy to Allah, and His angels and His messengers, and Gabriel and Michael! Then, lo! Allah (Himself) is an enemy to the disbelievers."
       },{
       "arabic":"﴿ وَلَقَدۡ اَنۡزَلۡنَآ اِلَيۡكَ اٰيٰتٍۢ بَيِّنٰتٍ‌‌ۚ وَمَا يَكۡفُرُ بِهَآ اِلَّا الۡفٰسِقُوۡنَ",
        "urdu":"اور ہم نے تمہارے پاس سلجھی ہوئی آیتیں ارسال فرمائی ہیں، اور ان سے انکار وہی کرتے ہیں جو بدکار ہیں",
       "english":"Verily We have revealed unto thee clear tokens, and only miscreants will disbelieve in them."
       },{
       "arabic":"﴿1 اَوَکُلَّمَا عٰهَدُوۡا عَهۡدًا نَّبَذَهٗ فَرِيۡقٌ مِّنۡهُمۡ‌ؕ بَلۡ اَكۡثَرُهُمۡ لَا يُؤۡمِنُوۡنَ",
        "urdu":"ان لوگوں نے جب (خدا سے) عہد واثق کیا تو ان میں سے ایک فریق نے اس کو (کسی چیز کی طرح) پھینک دیا۔ حقیقت یہ ہے کہ ان میں اکثر بے ایمان ہیں",
       "english":"Is it ever so that when they make a covenant a party of them set it aside? The truth is, most of them believe not."
       },{
       "arabic":"﴿1 وَلَمَّا جَآءَهُمۡ رَسُوۡلٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡ نَبَذَ فَرِيۡقٌ مِّنَ الَّذِيۡنَ اُوۡتُوۡا الۡكِتٰبَۙ کِتٰبَ اللّٰهِ وَرَآءَ ظُهُوۡرِهِمۡ كَاَنَّهُمۡ لَا يَعۡلَمُوۡنَ",
        "urdu":"اور جب ان کے پاس الله کی طرف سے پیغمبر (آخرالزماں) آئے، اور وہ ان کی (آسمانی) کتاب کی بھی تصدیق کرتے ہیں تو جن لوگوں کو کتاب دی گئی تھی، ان میں سے ایک جماعت نے خدا کی کتاب کو پیٹھ پیچھے پھینک دیا، گویا وہ جانتے ہی نہیں",
       "english":"And when there cometh unto them a messenger from Allah, confirming that which they possess, a party of those who have received the Scripture fling the Scripture of Allah behind their backs as if they knew not,"
       },{
       "arabic":"﴿1 وَاتَّبَعُوۡا مَا تَتۡلُوۡا الشَّيٰطِيۡنُ عَلٰى مُلۡكِ سُلَيۡمٰنَ‌‌ۚ وَمَا کَفَرَ سُلَيۡمٰنُ وَلٰـكِنَّ الشَّيٰـطِيۡنَ كَفَرُوۡا يُعَلِّمُوۡنَ النَّاسَ السِّحۡرَ وَمَآ اُنۡزِلَ عَلَى الۡمَلَـکَيۡنِ بِبَابِلَ هَارُوۡتَ وَمَارُوۡتَ‌ؕ وَمَا يُعَلِّمٰنِ مِنۡ اَحَدٍ حَتّٰى يَقُوۡلَاۤ اِنَّمَا نَحۡنُ فِتۡنَةٌ فَلَا تَكۡفُرۡؕ‌ فَيَتَعَلَّمُوۡنَ مِنۡهُمَا مَا يُفَرِّقُوۡنَ بِهٖ بَيۡنَ الۡمَرۡءِ وَ زَوۡجِهٖ‌ؕ وَمَا هُمۡ بِضَآرِّيۡنَ بِهٖ مِنۡ اَحَدٍ اِلَّا بِاِذۡنِ اللّٰهِ‌ؕ وَيَتَعَلَّمُوۡنَ مَا يَضُرُّهُمۡ وَلَا يَنۡفَعُهُمۡ‌ؕ وَلَقَدۡ عَلِمُوۡا لَمَنِ اشۡتَرٰٮهُ مَا لَهٗ فِىۡ الۡاٰخِرَةِ مِنۡ خَلَاقٍ‌ؕ وَلَبِئۡسَ مَا شَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ‌ؕ لَوۡ کَانُوۡا يَعۡلَمُوۡنَ",
        "urdu":"اور ان (ہزلیات) کے پیچھے لگ گئے جو سلیمان کے عہدِ سلطنت میں شیاطین پڑھا کرتے تھے اور سلیمان نے مطلق کفر کی بات نہیں کی، بلکہ شیطان ہی کفر کرتے تھے کہ لوگوں کو جادو سکھاتے تھے۔ اور ان باتوں کے بھی (پیچھے لگ گئے) جو شہر بابل میں دو فرشتوں (یعنی) ہاروت اور ماروت پر اتری تھیں۔ اور وہ دونوں کسی کو کچھ نہیں سکھاتے تھے، جب تک یہ نہ کہہ دیتے کہ ہم تو (ذریعہٴ) آزمائش ہیں۔ تم کفر میں نہ پڑو۔ غرض لوگ ان سے (ایسا) جادو سیکھتے، جس سے میاں بیوی میں جدائی ڈال دیں۔ اور خدا کے حکم کے سوا وہ اس (جادو) سے کسی کا کچھ بھی نہیں بگاڑ سکتے تھے۔ اور کچھ ایسے (منتر) سیکھتے جو ان کو نقصان ہی پہنچاتے اور فائدہ کچھ نہ دیتے۔ اور وہ جانتے تھے کہ جو شخص ایسی چیزوں (یعنی سحر اور منتر وغیرہ) کا خریدار ہوگا، اس کا آخرت میں کچھ حصہ نہیں۔ اور جس چیز کے عوض انہوں نے اپنی جانوں کو بیچ ڈالا، وہ بری تھی۔ کاش وہ (اس بات کو) جانتے",
       "english":"And follow that which the devils falsely related against the kingdom of Solomon. Solomon disbelieved not; but the devils disbelieved, teaching mankind magic and that which was revealed to the two angels in Babel, Harut and Marut. Nor did they (the two angels) teach it to anyone till they had said: We are only a temptation, therefore disbelieve not (in the guidance of Allah). And from these two (angles) people learn that by which they cause division between man and wife; but they injure thereby no-one save by Allah's leave. And they learn that which harmeth them and profiteth them not. And surely they do know that he who trafficketh therein will have no (happy) portion in the Hereafter; and surely evil is the price for which they sell their souls, if they but knew."
       },{
       "arabic":"﴿1 وَلَوۡ اَنَّهُمۡ اٰمَنُوۡا وَاتَّقَوۡا لَمَثُوۡبَةٌ مِّنۡ عِنۡدِ اللّٰهِ خَيۡرٌؕ‌ لَوۡ كَانُوۡا يَعۡلَمُوۡنَ",
        "urdu":"اور اگر وہ ایمان لاتے اور پرہیز گاری کرتے تو خدا کے ہاں سے بہت اچھا صلہ ملتا۔ اے کاش، وہ اس سے واقف ہوتے",
       "english":"And if they had believed and kept from evil, a recompense from Allah would be better, if they only knew."
       },{
       "arabic":"﴿1 يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَقُوۡلُوۡا رَاعِنَا وَ قُوۡلُوۡا انظُرۡنَا وَاسۡمَعُوۡا‌ؕ وَلِلۡڪٰفِرِيۡنَ عَذَابٌ اَلِيۡمٌ",
        "urdu":"اے اہل ایمان! (گفتگو کے وقت پیغمبرِ خدا سے) راعنا نہ کہا کرو۔ انظرنا کہا کرو۔ اور خوب سن رکھو، اور کافروں کے لیے دکھ دینے والا عذاب ہے",
       "english":"O ye who believe, say not (unto the Prophet): Listen to us but say Look upon us, and be ye listeners. For disbelievers is a painful doom."
       },{
       "arabic":"﴿1 مَا يَوَدُّ الَّذِيۡنَ كَفَرُوۡا مِنۡ اَهۡلِ الۡكِتٰبِ وَلَا الۡمُشۡرِكِيۡنَ اَنۡ يُّنَزَّلَ عَلَيۡڪُمۡ مِّنۡ خَيۡرٍ مِّنۡ رَّبِّکُمۡ‌ؕ وَاللّٰهُ يَخۡتَصُّ بِرَحۡمَتِهٖ مَنۡ يَّشَآءُ‌ؕ وَاللّٰهُ ذُوۡ الۡفَضۡلِ الۡعَظِيۡمِ",
        "urdu":"جو لوگ کافر ہیں، اہل کتاب یا مشرک وہ اس بات کو پسند نہیں کرتے کہ تم پر تمہارے پروردگار کی طرف سے خیر (وبرکت) نازل ہو۔ اور خدا تو جس کو چاہتا ہے، اپنی رحمت کے ساتھ خاص کر لیتا ہے اور خدا بڑے فضل کا مالک ہے",
       "english":"Neither those who disbelieve among the people of the Scripture nor the idolaters love that there should be sent down unto you any good thing from your Lord. But Allah chooseth for His mercy whom He will, and Allah is of Infinite Bounty."
       },{
       "arabic":"﴿1 مَا نَنۡسَخۡ مِنۡ اٰيَةٍ اَوۡ نُنۡسِهَا نَاۡتِ بِخَيۡرٍ مِّنۡهَآ اَوۡ مِثۡلِهَا‌ؕ اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ",
        "urdu":"ہم جس آیت کو منسوخ کر دیتے یا اسے فراموش کرا دیتے ہیں تو اس سے بہتر یا ویسی ہی اور آیت بھیج دیتے ہیں۔ کیا تم نہیں جانتے کہ خدا ہر بات پر قادر ہے",
       "english":"Nothing of our revelation (even a single verse) do we abrogate or cause be forgotten, but we bring (in place) one better or the like thereof. Knowest thou not that Allah is Able to do all things?"
       },{
       "arabic":"﴿1 اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ لَهٗ مُلۡكُ السَّمٰوٰتِ وَالۡاَرۡضِ‌ؕ وَمَا لَـکُمۡ مِّنۡ دُوۡنِ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍ",
        "urdu":"تمہیں معلوم نہیں کہ آسمانوں اور زمین کی بادشاہت خدا ہی کی ہے، اور خدا کے سوا تمہارا کوئی دوست اور مدد گار نہیں",
       "english":"Knowest thou not that it is Allah unto Whom belongeth the Sovereignty of the heavens and the earth; and ye have not, beside Allah, any guardian or helper?"
       },{
       "arabic":"﴿1 اَمۡ تُرِيۡدُوۡنَ اَنۡ تَسۡـَٔـلُوۡا رَسُوۡلَـكُمۡ كَمَا سُٮِٕلَ مُوۡسٰى مِنۡ قَبۡلُ‌ؕ وَمَنۡ يَّتَبَدَّلِ الۡکُفۡرَ بِالۡاِيۡمَانِ فَقَدۡ ضَلَّ سَوَآءَ السَّبِيۡلِ",
        "urdu":"کیا تم یہ چاہتے ہو کہ اپنے پیغمبر سے اسی طرح کے سوال کرو، جس طرح کے سوال پہلے موسیٰ سے کئے گئے تھے۔ اور جس شخص نے ایمان (چھوڑ کر اس) کے بدلے کفر لیا، وہ سیدھے رستے سے بھٹک گیا",
       "english":"Or would ye question your messenger as Moses was questioned aforetime? He who chooseth disbelief instead of faith, verily he hath gone astray from a plain road."
       },{
       "arabic":"﴿1 وَدَّ کَثِيۡرٌ مِّنۡ اَهۡلِ الۡكِتٰبِ لَوۡ يَرُدُّوۡنَكُمۡ مِّنۡۢ بَعۡدِ اِيۡمَانِكُمۡ كُفَّارًاۖۚ حَسَدًا مِّنۡ عِنۡدِ اَنۡفُسِهِمۡ مِّنۡۢ بَعۡدِ مَا تَبَيَّنَ لَهُمُ الۡحَـقُّ‌ۚ فَاعۡفُوۡا وَاصۡفَحُوۡا حَتّٰى يَاۡتِىَ اللّٰهُ بِاَمۡرِهٖ‌ؕ اِنَّ اللّٰهَ عَلٰى کُلِّ شَىۡءٍ قَدِيۡرٌ",
        "urdu":"بہت سے اہل کتاب اپنے دل کی جلن سے یہ چاہتے ہیں کہ ایمان لا چکنے کے بعد تم کو پھر کافر بنا دیں۔ حالانکہ ان پر حق ظاہر ہو چکا ہے۔ تو تم معاف کردو اور درگزر کرو۔ یہاں تک کہ خدا اپنا (دوسرا) حکم بھیجے۔ بے شک خدا ہر بات پر قادر ہے",
       "english":"Many of the people of the Scripture long to make you disbelievers after your belief, through envy on their own account, after the truth hath become manifest unto them. Forgive and be indulgent (toward them) until Allah give command. Lo! Allah is Able to do all things."
       },{
       "arabic":"﴿1 وَاَقِيۡمُوۡا الصَّلٰوةَ وَاٰتُوۡا الزَّکٰوةَ‌ؕ وَمَا تُقَدِّمُوۡا لِاَنۡفُسِكُمۡ مِّنۡ خَيۡرٍ تَجِدُوۡهُ عِنۡدَ اللّٰهِ‌ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ",
         "urdu":"اور نماز ادا کرتے رہو اور زکوٰة دیتے رہو۔ اور جو بھلائی اپنے لیے آگے بھیج رکھو گے، اس کو خدا کے ہاں پا لو گے۔ کچھ شک نہیں کہ خدا تمہارے سب کاموں کو دیکھ رہا ہے",
       "english":"Establish worship, and pay the poor-due; and whatever of good ye send before (you) for your souls, ye will find it with Allah. Lo! Allah is Seer of what ye do."
       },{
       "arabic":"﴿1 وَقَالُوۡا لَنۡ يَّدۡخُلَ الۡجَـنَّةَ اِلَّا مَنۡ كَانَ هُوۡدًا اَوۡ نَصٰرٰى‌ؕ تِلۡكَ اَمَانِيُّهُمۡ‌ؕ قُلۡ هَاتُوۡا بُرۡهَانَکُمۡ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ",
        "urdu":"اور (یہودی اور عیسائی) کہتے ہیں کہ یہودیوں اور عیسائیوں کے سوا کوئی بہشت میں نہیں جانے کا۔ یہ ان لوگوں کے خیالاتِ باطل ہیں۔ (اے پیغمبر ان سے) کہہ دو کہ اگر سچے ہو تو دلیل پیش کرو",
       "english":"And they say: None entereth paradise unless he be a Jew or a Christian. These are their own desires. Say: Bring your proof (of what ye state) if ye are truthful."
       },{
       "arabic":"﴿1 بَلٰى مَنۡ اَسۡلَمَ وَجۡهَهٗ لِلّٰهِ وَهُوَ مُحۡسِنٌۡ فَلَهٗۤ اَجۡرُهٗ عِنۡدَ رَبِّهٖ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ",
        "urdu":"ہاں جو شخص خدا کے آگے گردن جھکا دے، (یعنی ایمان لے آئے) اور وہ نیکو کار بھی ہو تو اس کا صلہ اس کے پروردگار کے پاس ہے اور ایسے لوگوں کو (قیامت کے دن) نہ کسی طرح کا خوف ہوگا اور نہ وہ غمناک ہوں گے",
       "english":"Nay, but whosoever surrendereth his purpose to Allah while doing good, his reward is with his Lord; and there shall no fear come upon them neither shall they grieve."
       },{
       "arabic":"﴿1 وَقَالَتِ الۡيَهُوۡدُ لَـيۡسَتِ النَّصٰرٰى عَلٰى شَىۡءٍ وَّقَالَتِ النَّصٰرٰى لَـيۡسَتِ الۡيَهُوۡدُ عَلٰى شَىۡءٍۙ وَّهُمۡ يَتۡلُوۡنَ الۡكِتٰبَؕكَذٰلِكَ قَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ مِثۡلَ قَوۡلِهِمۡ‌ۚ فَاللّٰهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ الۡقِيٰمَةِ فِيۡمَا كَانُوۡا فِيۡهِ يَخۡتَلِفُوۡنَ",
        "urdu":"اور یہودی کہتے ہیں کہ عیسائی رستے پر نہیں اور عیسائی کہتے ہیں کہ یہودی رستے پر نہیں۔ حالانکہ وہ کتاب (الہٰی) پڑھتے ہیں۔ اسی طرح بالکل انہی کی سی بات وہ لوگ کہتے ہیں جو (کچھ) نہیں جانتے (یعنی مشرک) تو جس بات میں یہ لوگ اختلاف کر رہے خدا قیامت کے دن اس کا ان میں فیصلہ کر دے گا",
       "english":"And the Jews say the Christians follow nothing (true), and the Christians say the Jews follow nothing (true); yet both are readers of the Scripture. Even thus speak those who know not. Allah will judge between them on the Day of Resurrection concerning that wherein they differ."
       },{
       "arabic":"﴿1 وَمَنۡ اَظۡلَمُ مِمَّنۡ مَّنَعَ مَسٰجِدَ اللّٰهِ اَنۡ يُّذۡكَرَ فِيۡهَا اسۡمُهٗ وَسَعٰى فِىۡ خَرَابِهَا‌ؕ اُولٰٓٮِٕكَ مَا كَانَ لَهُمۡ اَنۡ يَّدۡخُلُوۡهَآ اِلَّا خَآٮِٕفِيۡنَ‌ؕ لَهُمۡ فِىۡ الدُّنۡيَا خِزۡىٌ وَّلَهُمۡ فِىۡ الۡاٰخِرَةِ عَذَابٌ عَظِيۡمٌ",
        "urdu":"اور اس سے بڑھ کر ظالم کون، جو خدا کی مسجدوں میں خدا کے نام کا ذکر کئے جانے کو منع کرے اور ان کی ویرانی میں ساعی ہو۔ان لوگوں کو کچھ حق نہیں کہ ان میں داخل ہوں، مگر ڈرتے ہوئے۔ ان کے لیے دنیا میں رسوائی ہے اور آخرت میں بڑا عذاب",
       "english":"And who doth greater wrong than he who forbiddeth the approach to the sanctuaries of Allah lest His name should be mentioned therein, and striveth for their ruin. As for such, it was never meant that they should enter them except in fear. Theirs in the world is ignominy and theirs in the Hereafter is an awful doom."
       },{
       "arabic":"﴿1 وَلِلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُ‌ فَاَيۡنَمَا تُوَلُّوۡا فَثَمَّ وَجۡهُ اللّٰهِ‌ؕ اِنَّ اللّٰهَ وَاسِعٌ عَلِيۡمٌ",
        "urdu":"اور مشرق اور مغرب سب خدا ہی کا ہے۔ تو جدھر تم رخ کرو۔ ادھر خدا کی ذات ہے۔ بے شک خدا صاحبِ وسعت اور باخبر ہے",
       "english":"Unto Allah belong the East and the West, and whithersoever ye turn, there is Allah's Countenance. Lo! Allah is All-Embracing, All-Knowing."
       },{
       "arabic":"﴿1 وَقَالُوۡا اتَّخَذَ اللّٰهُ وَلَدًاۙ‌ سُبۡحٰنَهٗ‌ؕ بَل لَّهٗ مَا فِىۡ السَّمٰوٰتِ وَالۡاَرۡضِ‌ؕ كُلٌّ لَّهٗ قٰنِتُوۡنَ",
        "urdu":"اور یہ لوگ اس بات کے قائل ہیں کہ خدا اولاد رکھتا ہے۔ (نہیں) وہ پاک ہے، بلکہ جو کچھ آسمانوں اور زمین میں ہے، سب اسی کا ہے اور سب اس کے فرماں بردار ہیں",
       "english":"And they say: Allah hath taken unto Himself a son. Be He glorified! Nay, but whatsoever is in the heavens and the earth is His. All are subservient unto Him."
       },{
       "arabic":"﴿1 بَدِيۡعُ السَّمٰوٰتِ وَالۡاَرۡضِ‌ؕ وَ اِذَا قَضٰٓى اَمۡرًا فَاِنَّمَا يَقُوۡلُ لَهٗ كُنۡ فَيَكُوۡنُ",
        "urdu":"(وہی) آسمانوں اور زمین کا پیدا کرنے والاہے۔ جب کوئی کام کرنا چاہتا ہے تو اس کو ارشاد فرما دیتا ہے کہ ہوجا تو وہ ہو جاتا ہے .",
       "english":"The Originator of the heavens and the earth! When He decreeth a thing, He saith unto it only: Be! and it is."
       },{
       "arabic":"﴿1 وَقَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ لَوۡلَا يُكَلِّمُنَا اللّٰهُ اَوۡ تَاۡتِيۡنَآ اٰيَةٌ‌ؕ كَذٰلِكَ قَالَ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ مِّثۡلَ قَوۡلِهِمۡؕ‌ تَشَابَهَتۡ قُلُوۡبُهُمۡ‌ؕ قَدۡ بَيَّنَّا الۡاٰيٰتِ لِقَوۡمٍ يُّوۡقِنُوۡنَ",
        "urdu":"اور جو لوگ (کچھ) نہیں جانتے (یعنی مشرک) وہ کہتے ہیں کہ خدا ہم سے کلام کیوں نہیں کرتا۔ یا ہمارے پاس کوئی نشانی کیوں نہیں آتی۔ اسی طرح جو لوگ ان سے پہلے تھے، وہ بھی انہی کی سی باتیں کیا کرتے تھے۔ ان لوگوں کے دل آپس میں ملتے جلتے ہیں۔ جو لوگ صاحبِ یقین ہیں، ان کے (سمجھانے کے) لیے نشانیاں بیان کردی ہیں",
       "english":"And those who have no knowledge say: Why doth not Allah speak unto us, or some sign come unto us? Even thus, as they now speak, spake those (who were) before them. Their hearts are all alike. We have made clear the revelations for people who are sure."
       },{
       "arabic":"﴿1 اِنَّاۤ اَرۡسَلۡنٰكَ بِالۡحَـقِّ بَشِيۡرًا وَّنَذِيۡرًاۙ‌ وَّلَا تُسۡـَٔـلُ عَنۡ اَصۡحٰبِ الۡجَحِيۡمِ",
        "urdu":"(اے محمدﷺ) ہم نے تم کو سچائی کے ساتھ خوشخبری سنانے والا اور ڈرانے والا بنا کر بھیجا ہے۔ اور اہل دوزخ کے بارے میں تم سے کچھ پرسش نہیں ہوگی",
       "english":"Lo! We have sent thee (O Muhammad) with the truth, a bringer of glad tidings and a warner. And thou wilt not be asked about the owners of hell-fire."
       },{
       "arabic":"﴿1 وَلَنۡ تَرۡضٰى عَنۡكَ الۡيَهُوۡدُ وَلَا النَّصٰرٰى حَتّٰى تَتَّبِعَ مِلَّتَهُمۡ‌ؕ قُلۡ اِنَّ هُدَى اللّٰهِ هُوَ الۡهُدٰى‌ؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ بَعۡدَ الَّذِىۡ جَآءَكَ مِنَ الۡعِلۡمِ‌ۙ مَا لَـكَ مِنَ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍؔ",
        "urdu":"اور تم سے نہ تو یہودی کبھی خوش ہوں گے اور نہ عیسائی، یہاں تک کہ تم ان کے مذہب کی پیروی اختیار کرلو۔ (ان سے) کہہ دو کہ خدا کی ہدایت (یعنی دین اسلام) ہی ہدایت ہے۔ اور (اے پیغمبر) اگر تم اپنے پاس علم (یعنی وحی خدا) کے آ جانے پر بھی ان کی خواہشوں پر چلو گے تو تم کو (عذاب) خدا سے (بچانے والا) نہ کوئی دوست ہوگا اور نہ کوئی مددگار",
       "english":"And the Jews will not be pleased with thee, nor will the Christians, till thou follow their creed. Say: Lo! the guidance of Allah (Himself) is Guidance. And if thou shouldst follow their desires after the knowledge which hath come unto thee, then wouldst thou have from Allah no protecting guardian nor helper."
       },{
       "arabic":"﴿1 الَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَتۡلُوۡنَهٗ حَقَّ تِلَاوَتِهٖؕ اُولٰٓٮِٕكَ يُؤۡمِنُوۡنَ بِهٖ‌ؕ وَمَنۡ يَّكۡفُرۡ بِهٖ فَاُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ",
        "urdu":"جن لوگوں کو ہم نے کتاب عنایت کی ہے، وہ اس کو (ایسا) پڑھتے ہیں جیسا اس کے پڑھنے کا حق ہے۔ یہی لوگ اس پر ایمان رکھنے والے ہیں، اور جو اس کو نہیں مانتے، وہ خسارہ پانے والے ہیں",
       "english":"Those unto whom We have given the Scripture, who read it with the right reading, those believe in it. And whoso disbelieveth in it, those are they who are the losers."
       },{
       "arabic":"﴿1 يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ",
        "urdu":"اے بنی اسرائیل ! میرے وہ احسان یاد کرو، جو میں نے تم پر کئے اور یہ کہ میں نے تم کو اہلِ عالم پر فضیلت بخشی",
       "english":"O Children of Israel! Remember My favour wherewith I favoured you and how I preferred you to (all) creatures."
       },{
       "arabic":"﴿1 وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا عَدۡلٌ وَّلَا تَنۡفَعُهَا شَفَاعَةٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ",
        "urdu":"اور اس دن سے ڈرو جب کوئی شخص کسی شخص کے کچھ کام نہ آئے، اور نہ اس سے بدلہ قبول کیا جائے اور نہ اس کو کسی کی سفارش کچھ فائدہ دے اور نہ لوگوں کو (کسی اور طرح کی) مدد مل سکے",
       "english":"And guard (yourselves) against a day when no soul will in aught avail another, nor will compensation be accepted from it, nor will intercession be of use to it; nor will they be helped."
       },{
       "arabic":"﴿1 وَاِذِ ابۡتَلٰٓى اِبۡرٰهٖمَ رَبُّهٗ بِكَلِمٰتٍ فَاَتَمَّهُنَّ‌ؕ قَالَ اِنِّىۡ جَاعِلُكَ لِلنَّاسِ اِمَامًا‌ؕ قَالَ وَمِنۡ ذُرِّيَّتِىۡ‌ؕ قَالَ لَا يَنَالُ عَهۡدِىۡ الظّٰلِمِيۡنَ",
        "urdu":"اور جب پروردگار نے چند باتوں میں ابراہیم کی آزمائش کی تو ان میں پورے اترے۔ خدا نے کہا کہ میں تم کو لوگوں کا پیشوا بناؤں گا۔ انہوں نے کہا کہ (پروردگار) میری اولاد میں سے بھی (پیشوا بنائیو)۔ خدا نے فرمایا کہ ہمارا اقرار ظالموں کے لیے نہیں ہوا کرتا",
       "english":"And (remember) when his Lord tried Abraham with (His) commands, and he fulfilled them, He said: Lo! I have appointed thee a leader for mankind. (Abraham) said: And of my offspring (will there be leaders)? He said: My covenant includeth not wrong-doers."
       },{
       "arabic":"﴿1 وَاِذۡ جَعَلۡنَا الۡبَيۡتَ مَثَابَةً لِّلنَّاسِ وَاَمۡنًاؕ وَاتَّخِذُوۡا مِنۡ مَّقَامِ اِبۡرٰهٖمَ مُصَلًّى‌ؕ وَعَهِدۡنَآ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ اَنۡ طَهِّرَا بَيۡتِىَ لِلطَّآٮِٕفِيۡنَ وَالۡعٰكِفِيۡنَ وَالرُّکَّعِ السُّجُوۡدِ",
        "urdu":"اور جب ہم نے خانہٴ کعبہ کو لوگوں کے لیے جمع ہونے اور امن پانے کی جگہ مقرر کیا اور (حکم دیا کہ) جس مقام پر ابراہیم کھڑے ہوئے تھے، اس کو نماز کی جگہ بنا لو۔ اور ابراہیم اور اسمٰعیل کو کہا کہ طواف کرنے والوں اور اعتکاف کرنے والوں اور رکوع کرنے والوں اور سجدہ کرنے والوں کے لیے میرے گھر کو پاک صاف رکھا کرو",
       "english":"And when We made the House (at Makka) a resort for mankind and sanctuary, (saying): Take as your place of worship the place where Abraham stood (to pray). And We imposed a duty upon Abraham and Ishmael, (saying): Purify My house for those who go around and those who meditate therein and those who bow down and prostrate themselves (in worship)."
       },{
       "arabic":"﴿1 وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اجۡعَلۡ هٰذَا بَلَدًا اٰمِنًۡا وَّارۡزُقۡ اَهۡلَهٗ مِنَ الثَّمَرٰتِ مَنۡ اٰمَنَ مِنۡهُمۡ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ‌ؕ قَالَ وَمَنۡ كَفَرَ فَاُمَتِّعُهٗ قَلِيۡلًا ثُمَّ اَضۡطَرُّهٗۤ اِلٰى عَذَابِ النَّارِ‌ؕ وَبِئۡسَ الۡمَصِيۡرُ",
        "urdu":"اور جب ابراہیم نے دعا کی کہ اے پروردگار، اس جگہ کو امن کا شہر بنا اور اس کے رہنے والوں میں سے جو خدا پر اور روزِ آخرت پر ایمان لائیں، ان کے کھانے کو میوے عطا کر، تو خدا نے فرمایا کہ جو کافر ہوگا، میں اس کو بھی کسی قدر متمتع کروں گا، (مگر) پھر اس کو (عذاب) دوزخ کے (بھگتنے کے) لیے ناچار کردوں گا، اور وہ بری جگہ ہے",
       "english":"And when Abraham prayed: My Lord! Make this a region of security and bestow upon its people fruits, such of them as believe in Allah and the Last Day, He answered: As for him who disbelieveth, I shall leave him in contentment for a while, then I shall compel him to the doom of Fire - a hapless journey's end!"
       },{
       "arabic":"﴿1 وَاِذۡ يَرۡفَعُ اِبۡرٰهٖمُ الۡقَوَاعِدَ مِنَ الۡبَيۡتِ وَاِسۡمٰعِيۡلُؕ رَبَّنَا تَقَبَّلۡ مِنَّا‌ؕ اِنَّكَ اَنۡتَ السَّمِيۡعُ الۡعَلِيۡمُ",
        "urdu":"اور جب ابراہیم اور اسمٰعیل بیت الله کی بنیادیں اونچی کر رہے تھے (تو دعا کئے جاتے تھے کہ) اے پروردگار، ہم سے یہ خدمت قبول فرما۔ بےشک تو سننے والا (اور) جاننے والا ہے",
       "english":"And when Abraham and Ishmael were raising the foundations of the House, (Abraham prayed): Our Lord! Accept from us (this duty). Lo! Thou, only Thou, art the Hearer, the Knower."
       },{
       "arabic":"﴿1 رَبَّنَا وَاجۡعَلۡنَا مُسۡلِمَيۡنِ لَـكَ وَ مِنۡ ذُرِّيَّتِنَآ اُمَّةً مُّسۡلِمَةً لَّكَ وَاَرِنَا مَنَاسِكَنَا وَتُبۡ عَلَيۡنَاۚ اِنَّكَ اَنۡتَ التَّوَّابُ الرَّحِيۡمُ",
        "urdu":"اے پروردگار، ہم کو اپنا فرمانبردار بنائے رکھیو۔ اور ہماری اولاد میں سے بھی ایک گروہ کو اپنا مطیع بنائے رہیو، اور (پروردگار) ہمیں طریق عبادت بتا اور ہمارے حال پر (رحم کے ساتھ) توجہ فرما۔ بے شک تو توجہ فرمانے والا مہربان ہے",
       "english":"Our Lord! And make us submissive unto Thee and of our seed a nation submissive unto Thee, and show us our ways of worship, and relent toward us. Lo! Thou, only Thou, art the Relenting, the Merciful."
       },{
       "arabic":"﴿1 رَبَّنَا وَابۡعَثۡ فِيۡهِمۡ رَسُوۡلاً مِّنۡهُمۡ يَتۡلُوۡا عَلَيۡهِمۡ اٰيٰتِكَ وَيُعَلِّمُهُمُ الۡكِتٰبَ وَالۡحِكۡمَةَ وَ يُزَكِّيۡهِمۡ‌ؕ اِنَّكَ اَنۡتَ الۡعَزِيۡزُ الۡحَكِيۡمُ",
        "urdu":"اے پروردگار، ان (لوگوں) میں انہیں میں سے ایک پیغمبر مبعوث کیجیو جو ان کو تیری آیتیں پڑھ پڑھ کر سنایا کرے اور کتاب اور دانائی سکھایا کرے اور ان (کے دلوں) کو پاک صاف کیا کرے۔ بےشک تو غالب اور صاحبِ حکمت ہے",
       "english":"Our Lord! And raise up in their midst a messenger from among them who shall recite unto them Thy revelations, and shall instruct them in the Scripture and in wisdom and shall make them grow. Lo! Thou, only Thou, art the Mighty, Wise."
       },{
       "arabic":"﴿1 وَمَنۡ يَّرۡغَبُ عَنۡ مِّلَّةِ اِبۡرٰهٖمَ اِلَّا مَنۡ سَفِهَ نَفۡسَهٗ‌ؕ وَلَقَدِ اصۡطَفَيۡنٰهُ فِىۡ الدُّنۡيَا‌ۚ وَاِنَّهٗ فِىۡ الۡاٰخِرَةِ لَمِنَ الصّٰلِحِيۡنَ",
        "urdu":"اور ابراہیم کے دین سے کون رو گردانی کر سکتا ہے، بجز اس کے جو نہایت نادان ہو۔ ہم نے ان کو دنیا میں بھی منتخب کیا تھا اور آخرت میں بھی وہ (زمرہٴ) صلحا میں سے ہوں گے",
       "english":"And who forsaketh the religion of Abraham save him who befooleth himself? Verily We chose him in the world, and lo! in the Hereafter he is among the righteous."
       },{
       "arabic":"﴿1 اِذۡ قَالَ لَهٗ رَبُّهٗۤ اَسۡلِمۡ‌ۙ قَالَ اَسۡلَمۡتُ لِرَبِّ الۡعٰلَمِيۡنَ",
        "urdu":"جب ان سے ان کے پروردگار نے فرمایا کہ اسلام لے آؤ تو انہوں نے عرض کی کہ میں رب العالمین کے آگے سر اطاعت خم کرتا ہوں",
       "english":"When his Lord said unto him: Surrender! he said: I have surrendered to the Lord of the Worlds."
       },{
       "arabic":"﴿1 وَوَصّٰى بِهَآ اِبۡرٰهٖمُ بَنِيۡهِ وَ يَعۡقُوۡبُؕ يٰبَنِىَّ اِنَّ اللّٰهَ اصۡطَفٰى لَـكُمُ الدِّيۡنَ فَلَا تَمُوۡتُنَّ اِلَّا وَاَنۡتُمۡ مُّسۡلِمُوۡنَؕ",
        "urdu":"اور ابرہیم نے اپنے بیٹوں کو اسی بات کی وصیت کی اور یعقوب نے بھی (اپنے فرزندوں سے یہی کہا) کہ بیٹا خدا نے تمہارے لیے یہی دین پسند فرمایا ہے تو مرنا ہے تو مسلمان ہی مرنا",
       "english":"The same did Abraham enjoin upon his sons, and also Jacob, (saying): O my sons! Lo! Allah hath chosen for you the (true) religion; therefore die not save as men who have surrendered (unto Him)."
       },{
       "arabic":"﴿1 اَمۡ كُنۡتُمۡ شُهَدَآءَ اِذۡ حَضَرَ يَعۡقُوۡبَ الۡمَوۡتُۙ اِذۡ قَالَ لِبَنِيۡهِ مَا تَعۡبُدُوۡنَ مِنۡۢ بَعۡدِىۡؕ قَالُوۡا نَعۡبُدُ اِلٰهَكَ وَاِلٰهَ اٰبَآٮِٕكَ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ اِلٰهًا وَّاحِدًاۖۚ وَّنَحۡنُ لَهٗ مُسۡلِمُوۡنَ",
        "urdu":"بھلا جس وقت یعقوب وفات پانے لگے تو تم اس وقت موجود تھے، جب انہوں نے اپنے بیٹوں سے پوچھا کہ میرے بعد تم کس کی عبادت کرو گے، تو انہوں نے کہا کہ آپ کے معبود اور آپ کے باپ دادا ابراہیم اور اسمٰعیل اور اسحاق کے معبود کی عبادت کریں گے جو معبود یکتا ہے اور ہم اُسی کے حکم بردار ہیں",
       "english":"Or were ye present when death came to Jacob, when he said unto his sons: What will ye worship after me? They said: We shall worship thy god, the god of thy fathers, Abraham and Ishmael and Isaac, One Allah, and unto Him we have surrendered."
       },{
       "arabic":"﴿1 تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ‌ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ‌ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ",
        "urdu":"یہ جماعت گزرچکی۔ ان کو اُن کے اعمال (کا بدلہ ملے گا) اور تم کو تمھارے اعمال (کا) اور جو عمل وہ کرتے تھے ان کی پرسش تم سے نہیں ہوگی",
       "english":"Those are a people who have passed away. Theirs is that which they earned, and yours is that which ye earn. And ye will not be asked of what they used to do."
       },{
       "arabic":"﴿1 وَقَالُوۡا کُوۡنُوۡا هُوۡدًا اَوۡ نَصٰرٰى تَهۡتَدُوۡا‌ؕ قُلۡ بَلۡ مِلَّةَ اِبۡرٰهٖمَ حَنِيۡفًا‌ؕ وَمَا كَانَ مِنَ الۡمُشۡرِكِيۡنَ",
        "urdu":"اور (یہودی اور عیسائی) کہتے ہیں کہ یہودی یا عیسائی ہو جاؤ تو سیدھے رستے پر لگ جاؤ۔ (اے پیغمبر ان سے) کہہ دو، (نہیں) بلکہ (ہم) دین ابراہیم (اختیار کئے ہوئے ہیں) جو ایک خدا کے ہو رہے تھے اور مشرکوں میں سے نہ تھے",
       "english":"And they say: Be Jews or Christians, then ye will be rightly guided. Say (unto them, O Muhammad): Nay, but (we follow) the religion of Abraham, the upright, and he was not of the idolaters."
       },{
       "arabic":"﴿1 قُوۡلُوۡٓا اٰمَنَّا بِاللّٰهِ وَمَآ اُنۡزِلَ اِلَيۡنَا وَمَآ اُنۡزِلَ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَ الۡاَسۡبَاطِ وَمَآ اُوۡتِىَ مُوۡسَىٰ وَعِيۡسٰى وَمَآ اُوۡتِىَ النَّبِيُّوۡنَ مِنۡ رَّبِّهِمۡ‌ۚ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡهُمۡ وَنَحۡنُ لَهٗ مُسۡلِمُوۡنَ",
        "urdu":"(مسلمانو) کہو کہ ہم خدا پر ایمان لائے اور جو (کتاب) ہم پر اتری، اس پر اور جو (صحیفے) ابراہیم اور اسمٰعیل اور اسحاق اور یعقوب اور ان کی اولاد پر نازل ہوئے ان پر اور جو (کتابیں) موسیٰ اور عیسی کو عطا ہوئیں، ان پر، اور جو اور پیغمبروں کو ان کے پروردگار کی طرف سے ملیں، ان پر (سب پر ایمان لائے) ہم ان پیغمروں میں سے کسی میں کچھ فرق نہیں کرتے اور ہم اسی (خدائے واحد) کے فرمانبردار ہیں",
       "english":"Say (O Muslims): We believe in Allah and that which is revealed unto us and that which was revealed unto Abraham, and Ishmael, and Isaac, and Jacob, and the tribes, and that which Moses and Jesus received, and that which the prophets received from their Lord. We make no distinction between any of them, and unto Him we have surrendered."
       },{
       "arabic":"﴿1 فَاِنۡ اٰمَنُوۡا بِمِثۡلِ مَآ اٰمَنۡتُمۡ بِهٖ فَقَدِ اهۡتَدَوْا‌ۚ وَاِنۡ تَوَلَّوۡا فَاِنَّمَا هُمۡ فِىۡ شِقَاقٍ‌ۚ فَسَيَكۡفِيۡکَهُمُ اللّٰهُ‌ۚ وَهُوَ السَّمِيۡعُ الۡعَلِيۡمُؕ",
        "urdu":"تو اگر یہ لوگ بھی اسی طرح ایمان لے آئیں جس طرح تم ایمان لے آئے ہو تو ہدایت یاب ہو جائیں اور اگر منہ پھیر لیں (اور نہ مانیں) تو وہ (تمھارے) مخالف ہیں اور ان کے مقابلے میں تمھیں خدا کافی ہے۔ اور وہ سننے والا (اور) جاننے والا ہے",
       "english":"And if they believe in the like of that which ye believe, then are they rightly guided. But if they turn away, then are they in schism, and Allah will suffice thee (for defence) against them. He is the Hearer, the Knower."
       },{
       "arabic":"﴿1 صِبۡغَةَ اللّٰهِ‌ۚ وَمَنۡ اَحۡسَنُ مِنَ اللّٰهِ صِبۡغَةً وَّنَحۡنُ لَهٗ عٰبِدُوۡنَ",
        "urdu":"(کہہ دو کہ ہم نے) خدا کا رنگ (اختیار کر لیا ہے) اور خدا سے بہتر رنگ کس کا ہو سکتا ہے۔ اور ہم اسی کی عبادت کرنے والے ہیں",
       "english":"(We take our) colour from Allah, and who is better than Allah at colouring. We are His worshippers."
       },{
       "arabic":"﴿1 قُلۡ اَتُحَآجُّوۡنَـنَا فِىۡ اللّٰهِ وَهُوَ رَبُّنَا وَرَبُّکُمۡۚ وَلَنَآ اَعۡمَالُـنَا وَلَـكُمۡ اَعۡمَالُكُمۡۚ وَنَحۡنُ لَهٗ مُخۡلِصُوۡنَۙ",
        "urdu":"(ان سے) کہو، کیا تم خدا کے بارے میں ہم سے جھگڑتے ہو، حالانکہ وہی ہمارا اور تمھارا پروردگار ہے اور ہم کو ہمارے اعمال (کا بدلہ ملے گا) اور تم کو تمھارے اعمال (کا) اور ہم خاص اسی کی عبادت کرنے والے ہیں",
       "english":"Say (unto the People of the Scripture): Dispute ye with us concerning Allah when He is our Lord and your Lord? Ours are our works and yours your works. We look to Him alone."
       },{
       "arabic":"﴿1 اَمۡ تَقُوۡلُوۡنَ اِنَّ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَالۡاَسۡبَاطَ كَانُوۡا هُوۡدًا اَوۡ نَصٰرٰى‌ؕ قُلۡ ءَاَنۡتُمۡ اَعۡلَمُ اَمِ اللّٰهُ‌ؕ وَمَنۡ اَظۡلَمُ مِمَّنۡ كَتَمَ شَهَادَةً عِنۡدَهٗ مِنَ اللّٰهِ‌ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ",
        "urdu":"(اے یہود ونصاریٰ) کیا تم اس بات کے قائل ہو کہ ابراہیم اور اسمٰعیل اور اسحاق اور یعقوب اور ان کی اولاد یہودی یا عیسائی تھے۔ (اے محمدﷺ ان سے) کہو کہ بھلا تم زیادہ جانتے ہو یا خدا؟ اور اس سے بڑھ کر ظالم کون، جو خدا کی شہادت کو، جو اس کے پاس (کتاب میں موجود) ہے چھپائے۔ اور جو کچھ تم کر رہے ہو، خدا اس سے غافل نہیں",
       "english":"Or say ye that Abraham, and Ishmael, and Isaac, and Jacob, and the tribes were Jews or Christians? Say: Do ye know best, or doth Allah? And who is more unjust than he who hideth a testimony which he hath received from Allah? Allah is not unaware of what ye do."
       },{
       "arabic":"﴿1 تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ‌ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ‌ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ",
        "urdu":"یہ جماعت گزر چکی۔ ان کو وہ (ملے گا) جو انہوں نے کیا، اور تم کو وہ جو تم نے کیا۔ اور جو عمل وہ کرتے تھے، اس کی پرسش تم سے نہیں ہوگی",
       "english":"Those are a people who have passed away; theirs is that which they earned and yours that which ye earn. And ye will not be asked of what they used to do."
       },{
       "arabic":"﴿1 سَيَقُوۡلُ السُّفَهَآءُ مِنَ النَّاسِ مَا وَلّٰٮهُمۡ عَنۡ قِبۡلَتِهِمُ الَّتِىۡ كَانُوۡا عَلَيۡهَا‌ؕ قُل لِّلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُؕ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِراطٍ مُّسۡتَقِيۡمٍ",
        "urdu":"احمق لوگ کہیں گے کہ مسلمان جس قبلے پر (پہلے سے چلے آتے) تھے (اب) اس سے کیوں منہ پھیر بیٹھے۔ تم کہہ دو کہ مشرق اور مغرب سب خدا ہی کا ہے۔ وہ جس کو چاہتا ہے، سیدھے رستے پر چلاتا ہے",
       "english":"The foolish of the people will say: What hath turned them from the qiblah which they formerly observed? Say: Unto Allah belong the East and the West. He guideth whom He will unto a straight path."
       },{
       "arabic":"﴿1 وَكَذٰلِكَ جَعَلۡنٰكُمۡ اُمَّةً وَّسَطًا لِّتَکُوۡنُوۡا شُهَدَآءَ عَلَى النَّاسِ وَيَكُوۡنَ الرَّسُوۡلُ عَلَيۡكُمۡ شَهِيۡدًاؕ وَمَا جَعَلۡنَا الۡقِبۡلَةَ الَّتِىۡ كُنۡتَ عَلَيۡهَآ اِلَّا لِنَعۡلَمَ مَنۡ يَّتَّبِعُ الرَّسُوۡلَ مِمَّنۡ يَّنۡقَلِبُ عَلٰى عَقِبَيۡهِ‌ؕ وَاِنۡ كَانَتۡ لَكَبِيۡرَةً اِلَّا عَلَى الَّذِيۡنَ هَدَى اللّٰهُؕ وَمَا كَانَ اللّٰهُ لِيُضِيْعَ اِيۡمَانَكُمۡ‌ؕ اِنَّ اللّٰهَ بِالنَّاسِ لَرَءُوۡفٌ رَّحِيۡمٌ",
        "urdu":"اور اسی طرح ہم نے تم کو امتِ معتدل بنایا ہے، تاکہ تم لوگوں پر گواہ بنو اور پیغمبر (آخرالزماں) تم پر گواہ بنیں۔ اور جس قبلے پر تم (پہلے) تھے، اس کو ہم نے اس لیے مقرر کیا تھا کہ معلوم کریں، کون (ہمارے) پیغمبر کا تابع رہتا ہے، اور کون الٹے پاؤں پھر جاتا ہے۔ اور یہ بات (یعنی تحویل قبلہ لوگوں کو) گراں معلوم ہوئی، مگر جن کو خدا نے ہدایت بخشی (وہ اسے گراں نہیں سمجھتے) اور خدا ایسا نہیں کہ تمہارے ایمان کو یونہی کھو دے۔ خدا تو لوگوں پر بڑا مہربان (اور) صاحبِ رحمت ہے",
       "english":"Thus We have appointed you a middle nation, that ye may be witnesses against mankind, and that the messenger may be a witness against you. And We appointed the qiblah which ye formerly observed only that We might know him who followeth the messenger, from him who turneth on his heels. In truth it was a hard (test) save for those whom Allah guided. But it was not Allah's purpose that your faith should be in vain, for Allah is Full of Pity, Merciful toward mankind."
       },{
       "arabic":"﴿1 قَدۡ نَرٰى تَقَلُّبَ وَجۡهِكَ فِىۡ السَّمَآءِ‌‌ۚ فَلَنُوَلِّيَنَّكَ قِبۡلَةً تَرۡضٰٮهَا‌ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَكُمۡ شَطۡرَهٗ‌ؕ وَاِنَّ الَّذِيۡنَ اُوۡتُوۡا الۡكِتٰبَ لَيَعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ‌ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا يَعۡمَلُوۡنَ",
        "urdu":"(اے محمدﷺ) ہم تمہارا آسمان کی طرف منہ پھیر پھیر کر دیکھنا دیکھ رہے ہیں۔ سو ہم تم کو اسی قبلے کی طرف جس کو تم پسند کرتے ہو، منہ کرنے کا حکم دیں گے تو اپنا منہ مسجد حرام (یعنی خانہٴ کعبہ) کی طرف پھیر لو۔ اور تم لوگ جہاں ہوا کرو، (نماز پڑھنے کے وقت) اسی مسجد کی طرف منہ کر لیا کرو۔ اور جن لوگوں کو کتاب دی گئی ہے، وہ خوب جانتے ہیں کہ (نیا قبلہ) ان کے پروردگار کی طرف سے حق ہے۔ اور جو کام یہ لوگ کرتے ہیں، خدا ان سے بے خبر نہیں",
       "english":"We have seen the turning of thy face to heaven (for guidance, O Muhammad). And now verily We shall make thee turn (in prayer) toward a qiblah which is dear to thee. So turn thy face toward the Inviolable Place of Worship, and ye (O Muslims), wheresoever ye may be, turn your faces (when ye pray) toward it. Lo! Those who have received the Scripture know that (this revelation) is the Truth from their Lord. And Allah is not unaware of what they do."
       },{
       "arabic":"﴿1 وَلَٮِٕنۡ اَتَيۡتَ الَّذِيۡنَ اُوۡتُوۡا الۡكِتٰبَ بِكُلِّ اٰيَةٍ مَّا تَبِعُوۡا قِبۡلَتَكَ‌ۚ وَمَآ اَنۡتَ بِتَابِعٍ قِبۡلَتَهُمۡ‌ۚ وَمَا بَعۡضُهُمۡ بِتَابِعٍ قِبۡلَةَ بَعۡضٍؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَكَ مِنَ الۡعِلۡمِ‌ۙ اِنَّكَ اِذًا لَّمِنَ الظّٰلِمِيۡنَ‌ۘ",
        "urdu":"اور اگر تم ان اہلِ کتاب کے پاس تمام نشانیاں بھی لے کر آؤ، تو بھی یہ تمہارے قبلے کی پیروی نہ کریں۔ اور تم بھی ان کے قبلے کی پیروی کرنے والے نہیں ہو۔ اور ان میں سے بھی بعض بعض کے قبلے کے پیرو نہیں۔ اور اگر تم باوجود اس کے کہ تمہارے پاس دانش (یعنی وحئ خدا) آ چکی ہے، ان کی خواہشوں کے پیچھے چلو گے تو ظالموں میں (داخل) ہو جاؤ گے",
       "english":"And even if thou broughtest unto those who have received the Scripture all kinds of portents, they would not follow thy qiblah, nor canst thou be a follower of their qiblah; nor are some of them followers of the qiblah of others. And if thou shouldst follow their desires after the knowledge which hath come unto thee, then surely wert thou of the evil-doers."
       },{
       "arabic":"﴿1 اَلَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَعۡرِفُوۡنَهٗ كَمَا يَعۡرِفُوۡنَ اَبۡنَآءَهُمۡؕ وَاِنَّ فَرِيۡقًا مِّنۡهُمۡ لَيَكۡتُمُوۡنَ الۡحَـقَّ وَهُمۡ يَعۡلَمُوۡنَؔ",
        "urdu":"جن لوگوں کو ہم نے کتاب دی ہے، وہ ان (پیغمبر آخرالزماں) کو اس طرح پہچانتے ہیں، جس طرح اپنے بیٹوں کو پہچانا کرتے ہیں، مگر ایک فریق ان میں سے سچی بات کو جان بوجھ کر چھپا رہا ہے",
       "english":"Those unto whom We gave the Scripture recognise (this revelation) as they recognise their sons. But lo! a party of them knowingly conceal the truth."
       },{
       "arabic":"﴿1 اَلۡحَـقُّ مِنۡ رَّبِّكَ فَلَا تَكُوۡنَنَّ مِنَ الۡمُمۡتَرِيۡنَ",
        "urdu":"(اے پیغمبر، یہ نیا قبلہ) تمہارے پروردگار کی طرف سے حق ہے تو تم ہرگز شک کرنے والوں میں نہ ہونا",
       "english":"It is the Truth from thy Lord (O Muhammad), so be not thou of those who waver."
       },{
       "arabic":"﴿1 وَلِكُلٍّ وِّجۡهَةٌ هُوَ مُوَلِّيۡهَا‌ۚ فَاسۡتَبِقُوۡا الۡخَيۡرٰتِؕؔ اَيۡنَ مَا تَكُوۡنُوۡا يَاۡتِ بِكُمُ اللّٰهُ جَمِيۡعًاؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ",
        "urdu":"اور ہر ایک (فرقے) کے لیے ایک سمت (مقرر) ہے۔ جدھر وہ (عبادت کے وقت) منہ کیا کرتے ہیں۔ تو تم نیکیوں میں سبقت حاصل کرو۔ تم جہاں رہو گے خدا تم سب کو جمع کرلے گا۔ بے شک خدا ہر چیز پر قادر ہے",
       "english":"And each one hath a goal toward which he turneth; so vie with one another in good works. Wheresoever ye may be, Allah will bring you all together. Lo! Allah is Able to do all things."
       },{
       "arabic":"﴿1 وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَاِنَّهٗ لَـلۡحَقُّ مِنۡ رَّبِّكَؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ",
        "urdu":"اور تم جہاں سے نکلو، (نماز میں) اپنا منہ مسجد محترم کی طرف کر لیا کرو بےشک وہ تمہارے پروردگار کی طرف سے حق ہے۔ اور تم لوگ جو کچھ کرتے ہو۔ خدا اس سے بے خبر نہیں",
       "english":"And whencesoever thou comest forth (for prayer, O Muhammad) turn thy face toward the Inviolable Place of Worship. Lo! it is the Truth from thy Lord. Allah is not unaware of what ye do."
       },{
       "arabic":"﴿1 وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَڪُمۡ شَطۡرَهٗۙ لِئَلَّا يَكُوۡنَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ اِلَّا الَّذِيۡنَ ظَلَمُوۡا مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَاخۡشَوۡنِىۡ وَلِاُتِمَّ نِعۡمَتِىۡ عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُوۡنَۙ‌ۛ",
        "urdu":"اور تم جہاں سے نکلو، مسجدِ محترم کی طرف منہ (کرکے نماز پڑھا) کرو۔ اور مسلمانو، تم جہاں ہوا کرو، اسی (مسجد) کی طرف رخ کیا کرو۔ (یہ تاکید) اس لیے (کی گئی ہے) کہ لوگ تم کو کسی طرح کا الزام نہ دے سکیں۔ مگر ان میں سے جو ظالم ہیں، (وہ الزام دیں تو دیں) سو ان سے مت ڈرنا اور مجھی سے ڈرتے رہنا۔ اور یہ بھی مقصود ہے کہ تم کو اپنی تمام نعمتیں بخشوں اور یہ بھی کہ تم راہِ راست پر چلو",
       "english":"Whencesoever thou comest forth turn thy face toward the Inviolable Place of Worship; and wheresoever ye may be (O Muslims) turn your faces toward it (when ye pray) so that men may have no argument against you, save such of them as do injustice - Fear them not, but fear Me! - and so that I may complete My grace upon you, and that ye may be guided."
       },{
       "arabic":"﴿1 كَمَآ اَرۡسَلۡنَا فِيۡکُمۡ رَسُوۡلاً مِّنۡکُمۡ يَتۡلُوۡا عَلَيۡكُمۡ اٰيٰتِنَا وَيُزَكِّيۡکُمۡ وَيُعَلِّمُکُمُ الۡكِتٰبَ وَالۡحِکۡمَةَ وَيُعَلِّمُكُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَؕ‌ۛ",
        "urdu":"جس طرح (منجملہ اور نعمتوں کے) ہم نے تم میں تمھیں میں سے ایک رسول بھیجے ہیں جو تم کو ہماری آیتیں پڑھ پڑھ کر سناتے اور تمہیں پاک بناتے اور کتاب (یعنی قرآن) اور دانائی سکھاتے ہیں، اور ایسی باتیں بتاتے ہیں، جو تم پہلے نہیں جانتے تھے",
       "english":"Even as We have sent unto you a messenger from among you, who reciteth unto you Our revelations and causeth you to grow, and teacheth you the Scripture and wisdom, and teacheth you that which ye knew not."
       },{
       "arabic":"﴿1 فَاذۡكُرُوۡنِىۡٓ اَذۡكُرۡكُمۡ وَاشۡکُرُوۡا لِىۡ وَلَا تَكۡفُرُوۡنِ",
        "urdu":"سو تم مجھے یاد کرو۔ میں تمہیں یاد کیا کروں گا۔ اور میرے احسان مانتے رہنا اور ناشکری نہ کرنا",
       "english":"Therefore remember Me, I will remember you. Give thanks to Me, and reject not Me."
       },{
       "arabic":"﴿1 يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا اسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِؕ اِنَّ اللّٰهَ مَعَ الصّٰبِرِيۡنَ",
        "urdu":"اے ایمان والو صبر اور نماز سے مدد لیا کرو بےشک خدا صبر کرنے والوں کے ساتھ ہے",
       "english":"O ye who believe! Seek help in steadfastness and prayer. Lo! Allah is with the steadfast."
       },{
       "arabic":"﴿1 وَلَا تَقُوۡلُوۡا لِمَنۡ يُّقۡتَلُ فِىۡ سَبِيۡلِ اللّٰهِ اَمۡوٰتٌؕ بَلۡ اَحۡيَآءٌ وَّلٰـكِنۡ لَّا تَشۡعُرُوۡنَ",
        "urdu":"اور جو لوگ خدا کی راہ میں مارے جائیں ان کی نسبت یہ کہنا کہ وہ مرے ہوئے ہیں (وہ مردہ نہیں) بلکہ زندہ ہیں لیکن تم نہیں جانتے",
        "english":"And call not those who are slain in the way of Allah dead. Nay, they are living, only ye perceive not."
       },{
       "arabic":"﴿1 وَلَـنَبۡلُوَنَّكُمۡ بِشَىۡءٍ مِّنَ الۡخَـوۡفِ وَالۡجُـوۡعِ وَنَقۡصٍ مِّنَ الۡاَمۡوَالِ وَالۡاَنۡفُسِ وَالثَّمَرٰتِؕ وَبَشِّرِ الصّٰبِرِيۡنَۙ",
        "urdu":"اور ہم کسی قدر خوف اور بھوک اور مال اور جانوں اور میوؤں کے نقصان سے تمہاری آزمائش کریں گے توصبر کرنے والوں کو (خدا کی خوشنودی کی) بشارت سنا دو",
       "english":"And surely We shall try you with something of fear and hunger, and loss of wealth and lives and crops; but give glad tidings to the steadfast,"
       },{
       "arabic":"﴿1 الَّذِيۡنَ اِذَآ اَصَابَتۡهُمۡ مُّصِيۡبَةٌۙ قَالُوۡٓا اِنَّا لِلّٰهِ وَاِنَّـآ اِلَيۡهِ رٰجِعُوۡنَؕ",
        "urdu":"ان لوگوں پر جب کوئی مصیبت واقع ہوتی ہے تو کہتے ہیں کہ ہم خدا ہی کا مال ہیں اور اسی کی طرف لوٹ کر جانے والے ہیں",
       "english":"Who say, when a misfortune striketh them: Lo! we are Allah's and lo! unto Him we are returning."
       },{
       "arabic":"﴿1 اُولٰٓٮِٕكَ عَلَيۡهِمۡ صَلَوٰتٌ مِّنۡ رَّبِّهِمۡ وَرَحۡمَةٌ‌ وَاُولٰٓٮِٕكَ هُمُ الۡمُهۡتَدُوۡنَ",
        "urdu":"یہی لوگ ہیں جن پر ان کے پروردگار کی مہربانی اور رحمت ہے۔ اور یہی سیدھے رستے پر ہیں",
       "english":"Such are they on whom are blessings from their Lord, and mercy. Such are the rightly guided."
       },{
       "arabic":"﴿1 اِنَّ الصَّفَا وَالۡمَرۡوَةَ مِنۡ شَعَآٮِٕرِ اللّٰهِۚ فَمَنۡ حَجَّ الۡبَيۡتَ اَوِ اعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ اَنۡ يَّطَّوَّفَ بِهِمَاؕ وَمَنۡ تَطَوَّعَ خَيۡرًاۙ فَاِنَّ اللّٰهَ شَاكِرٌ عَلِيۡمٌ",
        "urdu":"بےشک (کوہ) صفا اور مروہ خدا کی نشانیوں میں سے ہیں۔ تو جو شخص خانہٴ کعبہ کا حج یا عمرہ کرے اس پر کچھ گناہ نہیں کہ دونوں کا طواف کرے۔ (بلکہ طواف ایک قسم کا نیک کام ہے) اور جو کوئی نیک کام کرے تو خدا قدر شناس اور دانا ہے",
       "english":"Lo! (the mountains) As-Safa and Al-Marwah are among the indications of Allah. It is therefore no sin for him who is on pilgrimage to the House (of Allah) or visiteth it, to go around them (as the pagan custom is). And he who doeth good of his own accord, (for him) lo! Allah is Responsive, Aware."
       },{
       "arabic":"﴿1 اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلۡنَا مِنَ الۡبَيِّنٰتِ وَالۡهُدٰى مِنۡۢ بَعۡدِ مَا بَيَّنّٰهُ لِلنَّاسِ فِىۡ الۡكِتٰبِۙ اُولٰٓٮِٕكَ يَلۡعَنُهُمُ اللّٰهُ وَ يَلۡعَنُهُمُ اللّٰعِنُوۡنَۙ",
        "urdu":"جو لوگ ہمارے حکموں اور ہدایتوں کو جو ہم نے نازل کی ہیں (کسی غرض فاسد سے) چھپاتے ہیں باوجود یہ کہ ہم نے ان لوگوں کے (سمجھانے کے) لئے اپنی کتاب میں کھول کھول کر بیان کردیا ہے۔ ایسوں پر خدا اور تمام لعنت کرنے والے لعنت کرتے ہیں",
       "english":"Lo! Those who hide the proofs and the guidance which We revealed, after We had made it clear to mankind in the Scripture: such are accursed of Allah and accursed of those who have the power to curse."
       },{
       "arabic":"﴿1 اِلَّا الَّذِيۡنَ تَابُوۡا وَاَصۡلَحُوۡا وَبَيَّنُوۡا فَاُولٰٓٮِٕكَ اَتُوۡبُ عَلَيۡهِمۡۚ وَاَنَا التَّوَّابُ الرَّحِيۡمُ",
        "urdu":"ہاں جو توبہ کرتے ہیں اور اپنی حالت درست کرلیتے اور (احکام الہیٰ کو) صاف صاف بیان کردیتے ہیں تو میں ان کے قصور معاف کردیتا ہوں اور میں بڑا معاف کرنے والا (اور) رحم والا ہوں",
       "english":"Except those who repent and amend and make manifest (the truth). These it is toward whom I relent. I am the Relenting, the Merciful."
       },{
       "arabic":"﴿1 اِنَّ الَّذِيۡنَ كَفَرُوۡا وَمَاتُوۡا وَهُمۡ كُفَّارٌ اُولٰٓٮِٕكَ عَلَيۡهِمۡ لَعۡنَةُ اللّٰهِ وَالۡمَلٰٓٮِٕكَةِ وَالنَّاسِ اَجۡمَعِيۡنَۙ",
        "urdu":"جو لوگ کافر ہوئے اور کافر ہی مرے ایسوں پر خدا کی اور فرشتوں اور لوگوں کی سب کی لعنت",
       "english":"Lo! Those who disbelieve, and die while they are disbelievers; on them is the curse of Allah and of angels and of men combined."
       },{
       "arabic":"﴿1 خٰلِدِيۡنَ فِيۡهَاۚ لَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡظَرُوۡنَ",
        "urdu":"وہ ہمیشہ اسی (لعنت) میں (گرفتار) رہیں گے۔ ان سے نہ تو عذاب ہی ہلکا کیا جائے گا اور نہ انہیں (کچھ) مہلت ملے گی",
       "english":"They ever dwell therein. The doom will not be lightened for them, neither will they be reprieved."
       },{
       "arabic":"﴿1 وَاِلٰهُكُمۡ اِلٰهٌ وَّاحِدٌۚ لَآ اِلٰهَ اِلَّا هُوَ الرَّحۡمٰنُ الرَّحِيۡمُ",
        "urdu":"اور (لوگو) تمہارا معبود خدائے واحد ہے اس بڑے مہربان (اور) رحم کرنے کے سوا کوئی عبادت کے لائق نہیں",
       "english":"Your Allah is One Allah; there is no Allah save Him, the Beneficent, the Merciful."
       },{
       "arabic":"﴿1 اِنَّ فِىۡ خَلۡقِ السَّمٰوٰتِ وَالۡاَرۡضِ وَاخۡتِلَافِ الَّيۡلِ وَالنَّهَارِ وَالۡفُلۡكِ الَّتِىۡ تَجۡرِىۡ فِىۡ الۡبَحۡرِ بِمَا يَنۡفَعُ النَّاسَ وَمَآ اَنۡزَلَ اللّٰهُ مِنَ السَّمَآءِ مِنۡ مَّآءٍ فَاَحۡيَا بِهِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا وَبَثَّ فِيۡهَا مِنۡ کُلِّ دَآبَّةٍ وَّتَصۡرِيۡفِ الرِّيٰحِ وَالسَّحَابِ الۡمُسَخَّرِ بَيۡنَ السَّمَآءِ وَالۡاَرۡضِ لَاٰيٰتٍ لِّقَوۡمٍ يَّعۡقِلُوۡنَ",
        "urdu":"بےشک آسمانوں اور زمین کے پیدا کرنے میں اور رات اور دن کے ایک دوسرے کے پیچھے آنے جانے میں اور کشتیوں اور جہازوں میں جو دریا میں لوگوں کے فائدے کی چیزیں لے کر رواں ہیں اور مینہ میں جس کو خدا آسمان سے برساتا اور اس سے زمین کو مرنے کے بعد زندہ (یعنی خشک ہوئے پیچھے سرسبز) کردیتا ہے اور زمین پر ہر قسم کے جانور پھیلانے میں اور ہواؤں کے چلانےمیں اور بادلوں میں جو آسمان اور زمین کے درمیان گھرے رہتے ہیں۔ عقلمندوں کے لئے (خدا کی قدرت کی) نشانیاں ہیں",
       "english":"Lo! In the creation of the heavens and the earth, and the difference of night and day, and the ships which run upon the sea with that which is of use to men, and the water which Allah sendeth down from the sky, thereby reviving the earth after its death, and dispersing all kinds of beasts therein, and (in) the ordinance of the winds, and the clouds obedient between heaven and earth: are signs (of Allah's Sovereignty) for people who have sense."
       },{
        "arabic":"﴿1 وَمِنَ النَّاسِ مَنۡ يَّتَّخِذُ مِنۡ دُوۡنِ اللّٰهِ اَنۡدَادًا يُّحِبُّوۡنَهُمۡ كَحُبِّ اللّٰهِؕ وَالَّذِيۡنَ اٰمَنُوۡٓا اَشَدُّ حُبًّا لِّلَّهِؕ وَلَوۡ يَرَى الَّذِيۡنَ ظَلَمُوۡٓا اِذۡ يَرَوۡنَ الۡعَذَابَۙ اَنَّ الۡقُوَّةَ لِلّٰهِ جَمِيۡعًۙا وَّاَنَّ اللّٰهَ شَدِيۡدُ الۡعَذَابِ",
        "urdu":"اور بعض لوگ ایسے ہیں جو غیر خدا کو شریک (خدا) بناتے اور ان سے خدا کی سی محبت کرتے ہیں۔ لیکن جو ایمان والے ہیں وہ تو خدا ہی کے سب سے زیادہ دوستدار ہیں۔ اور اے کاش ظالم لوگ جو بات عذاب کے وقت دیکھیں گے اب دیکھ لیتے کہ سب طرح کی طاقت خدا ہی کو ہے۔ اور یہ کہ خدا سخت عذاب کرنے والا ہے",
       "english":"Yet of mankind are some who take unto themselves (objects of worship which they set as) rivals to Allah, loving them with a love like (that which is the due) of Allah (only) - those who believe are stauncher in their love for Allah - Oh, that those who do evil had but known, (on the day) when they behold the doom, that power belongeth wholly to Allah, and that Allah is severe in punishment!"
       },{
       "arabic":"﴿1 اِذۡ تَبَرَّاَ الَّذِيۡنَ اتُّبِعُوۡا مِنَ الَّذِيۡنَ اتَّبَعُوۡا وَرَاَوُا الۡعَذَابَ وَ تَقَطَّعَتۡ بِهِمُ الۡاَسۡبَابُ",
        "urdu":"اس دن (کفر کے) پیشوا اپنے پیرووں سے بیزاری ظاہر کریں گے اور (دونوں) عذاب (الہیٰ) دیکھ لیں گے اور ان کے آپس کے تعلقات منقطع ہوجائیں گے",
       "english":"(On the day) when those who were followed disown those who followed (them), and they behold the doom, and all their aims collapse with them."
       },{
       "arabic":"﴿1 وَقَالَ الَّذِيۡنَ اتَّبَعُوۡا لَوۡ اَنَّ لَنَا كَرَّةً فَنَتَبَرَّاَ مِنۡهُمۡ كَمَا تَبَرَّءُوۡا مِنَّاؕ كَذٰلِكَ يُرِيۡهِمُ اللّٰهُ اَعۡمَالَهُمۡ حَسَرٰتٍ عَلَيۡهِمۡؕ وَمَا هُمۡ بِخَارِجِيۡنَ مِنَ النَّارِ",
        "urdu":"(یہ حال دیکھ کر) پیروی کرنے والے (حسرت سے) کہیں گے کہ اے کاش ہمیں پھر دنیا میں جانا نصیب ہو تاکہ جس طرح یہ ہم سے بیزار ہو رہے ہیں اسی طرح ہم بھی ان سے بیزار ہوں۔ اسی طرح خدا ان کے اعمال انہیں حسرت بنا کر دکھائے گااور وہ دوزخ سے نکل نہیں سکیں گے",
       "english":"And those who were but followers will say: If a return were possible for us, we would disown them even as they have disowned us. Thus will Allah show them their own deeds as anguish for them, and they will not emerge from the Fire."
        },{
       "arabic":"﴿1 يٰٓاَيُّهَا النَّاسُ كُلُوۡا مِمَّا فِىۡ الۡاَرۡضِ حَلٰلاً طَيِّبًاۖ وَّلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِؕ اِنَّهٗ لَـكُمۡ عَدُوٌّ مُّبِيۡنٌ",
        "urdu":"لوگو جو چیزیں زمین میں حلال طیب ہیں وہ کھاؤ۔ اور شیطان کے قدموں پر نہ چلو۔ وہ تمہارا کھلا دشمن ہے",
       "english":"O mankind! Eat of that which is lawful and wholesome in the earth, and follow not the footsteps of the devil. Lo! he is an open enemy for you."
       },{
       "arabic":"﴿1 اِنَّمَا يَاۡمُرُكُمۡ بِالسُّوۡٓءِ وَالۡفَحۡشَآءِ وَاَنۡ تَقُوۡلُوۡا عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ",
        "urdu":"وہ تو تم کو برائی اور بےحیائی ہی کے کام کرنے کو کہتا ہے اور یہ بھی کہ خدا کی نسبت ایسی باتیں کہو جن کا تمہیں (کچھ بھی) علم نہیں",
       "english":"He enjoineth upon you only the evil and the foul, and that ye should tell concerning Allah that which ye know not."
       },{
       "arabic":"﴿1 وَاِذَا قِيۡلَ لَهُمُ اتَّبِعُوۡا مَآ اَنۡزَلَ اللّٰهُ قَالُوۡا بَلۡ نَتَّبِعُ مَآ اَلۡفَيۡنَا عَلَيۡهِ اٰبَآءَنَاؕ اَوَلَوۡ كَانَ اٰبَآؤُهُمۡ لَا يَعۡقِلُوۡنَ شَيۡـًٔـا وَّلَا يَهۡتَدُوۡنَ",
        "urdu":"اور جب ان لوگوں سے کہا جاتا ہے کہ جو (کتاب) خدا نے نازل فرمائی ہے اس کی پیروی کرو تو کہتے ہیں (نہیں) بلکہ ہم تو اسی چیز کی پیروی کریں گے جس پر ہم نے اپنے باپ دادا کو پایا۔ بھلا اگرچہ ان کے باپ دادا نہ کچھ سمجھتے ہوں اورنہ سیدھے رستے پر ہوں (تب بھی وہ انہیں کی تقلید کئے جائیں گے)",
       "english":"And when it is said unto them: Follow that which Allah hath revealed, they say: We follow that wherein we found our fathers. What! Even though their fathers were wholly unintelligent and had no guidance?"
       },{
       "arabic":"﴿1 وَمَثَلُ الَّذِيۡنَ کَفَرُوۡا كَمَثَلِ الَّذِىۡ يَنۡعِقُ بِمَا لَا يَسۡمَعُ اِلَّا دُعَآءً وَّنِدَآءًؕ صُمٌّۢ بُكۡمٌ عُمۡىٌ فَهُمۡ لَا يَعۡقِلُوۡنَ",
        "urdu":"جو لوگ کافر ہیں ان کی مثال اس شخص کی سی ہے جو کسی ایسی چیز کو آواز دے جو پکار اور آواز کے سوا کچھ سن نہ سکے۔ (یہ) بہرے ہیں گونگے ہیں اندھے ہیں کہ (کچھ) سمجھ ہی نہیں سکتے",
       "english":"The likeness of those who disbelieve (in relation to the messenger) is as the likeness of one who calleth unto that which heareth naught except a shout and cry. Deaf, dumb, blind, therefore they have no sense."
       },{
       "arabic":"﴿1 يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا کُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ وَاشۡكُرُوۡا لِلّٰهِ اِنۡ کُنۡتُمۡ اِيَّاهُ تَعۡبُدُوۡنَ",
        "urdu":"اے اہل ایمان جو پاکیزہ چیزیں ہم نے تم کو عطا فرمائیں ہیں ان کو کھاؤ اور اگر خدا ہی کے بندے ہو تو اس (کی نعمتوں) کا شکر بھی ادا کرو",
       "english":"O ye who believe! Eat of the good things wherewith We have provided you, and render thanks to Allah if it is (indeed) He Whom ye worship."
       },{
       "arabic":"﴿1 اِنَّمَا حَرَّمَ عَلَيۡکُمُ الۡمَيۡتَةَ وَالدَّمَ وَلَحۡمَ الۡخِنۡزِيۡرِ وَمَآ اُهِلَّ بِهٖ لِغَيۡرِ اللّٰهِ‌ۚ فَمَنِ اضۡطُرَّ غَيۡرَ بَاغٍ وَّلَا عَادٍ فَلَاۤ اِثۡمَ عَلَيۡهِ‌ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ",
        "urdu":"اس نے تم پر مرا ہوا جانور اور لہو اور سور کا گوشت اور جس چیز پر خدا کے سوا کسی اور کا نام پکارا جائے حرام کردیا ہے ہاں جو ناچار ہوجائے (بشرطیکہ ) خدا کی نافرمانی نہ کرے اور حد (ضرورت) سے باہر نہ نکل جائے اس پر کچھ گناہ نہیں۔ بےشک خدا بخشنے والا (اور) رحم کرنے والا ہے",
       "english":"He hath forbidden you only carrion, and blood, and swineflesh, and that which hath been immolated to (the name of) any other than Allah. But he who is driven by necessity, neither craving nor transgressing, it is no sin for him. Lo! Allah is Forgiving, Merciful."
       },{
       "arabic":"﴿1 اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلَ اللّٰهُ مِنَ الۡکِتٰبِ وَ يَشۡتَرُوۡنَ بِهٖ ثَمَنًا قَلِيۡلًاۙ اُولٰٓٮِٕكَ مَا يَاۡكُلُوۡنَ فِىۡ بُطُوۡنِهِمۡ اِلَّا النَّارَ وَلَا يُکَلِّمُهُمُ اللّٰهُ يَوۡمَ الۡقِيٰمَةِ وَلَا يُزَکِّيۡهِمۡۖۚ وَلَهُمۡ عَذَابٌ اَلِيۡمٌ",
        "urdu":"جو لوگ (خدا) کی کتاب سے ان (آیتوں اور ہدایتوں) کو جو اس نے نازل فرمائی ہیں چھپاتے اور ان کے بدلے تھوڑی سی قیمت (یعنی دنیاوی منفعت)حاصل کرتے ہیں وہ اپنے پیٹوں میں محض آگ بھرتے ہیں۔ ایسے لوگوں سے خدا قیامت کے دن نہ کلام کرے گا اور نہ ان کو (گناہوں سے) پاک کرے گا۔اور ان کے لئے دکھ دینے والا عذاب ہے",
       "english":"Lo! those who hide aught of the Scripture which Allah hath revealed and purchase a small gain therewith, they eat into their bellies nothing else than fire. Allah will not speak to them on the Day of Resurrection, nor will He make them grow. Theirs will be a painful doom."
       },{
       "arabic":"﴿1 اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى وَالۡعَذَابَ بِالۡمَغۡفِرَةِ‌ۚ فَمَآ اَصۡبَرَهُمۡ عَلَى النَّارِ",
        "urdu":"یہ وہ لوگ ہیں جنہوں نے ہدایت چھوڑ کر گمراہی اور بخشش چھوڑ کر عذاب خریدا۔ یہ (آتش) جہنم کی کیسی برداشت کرنے والے ہیں!",
       "english":"Those are they who purchase error at the price of guidance, and torment at the price of pardon. How constant are they in their strife to reach the Fire!"
       },{
       "arabic":"﴿1 ذٰلِكَ بِاَنَّ اللّٰهَ نَزَّلَ الۡکِتٰبَ بِالۡحَـقِّؕ وَاِنَّ الَّذِيۡنَ اخۡتَلَفُوۡا فِىۡ الۡكِتٰبِ لَفِىۡ شِقَاقِۢ بَعِيۡدٍ",
        "urdu":"یہ اس لئے کہ خدا نے کتاب سچائی کے ساتھ نازل فرمائی۔ اور جن لوگوں نے اس کتاب میں اختلاف کیا وہ ضد میں (آکر نیکی سے) دور (ہوگئے) ہیں",
       "english":"That is because Allah hath revealed the Scripture with the truth. Lo! those who find (a cause of) disagreement in the Scripture are in open schism."
       },{
       "arabic":"﴿1 لَيۡسَ الۡبِرَّ اَنۡ تُوَلُّوۡا وُجُوۡهَكُمۡ قِبَلَ الۡمَشۡرِقِ وَ الۡمَغۡرِبِ وَلٰـكِنَّ الۡبِرَّ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَالۡمَلٰٓٮِٕکَةِ وَالۡكِتٰبِ وَالنَّبِيّٖنَ‌ۚ وَاٰتَى الۡمَالَ عَلٰى حُبِّهٖ ذَوِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنَ وَابۡنَ السَّبِيۡلِۙ وَالسَّآٮِٕلِيۡنَ وَفِىۡ الرِّقَابِ‌ۚ وَاَقَامَ الصَّلٰوةَ وَاٰتَى الزَّکٰوةَ‌ۚ وَالۡمُوۡفُوۡنَ بِعَهۡدِهِمۡ اِذَا عٰهَدُوۡاۚ وَالصّٰبِرِيۡنَ فِىۡ الۡبَاۡسَآءِ وَالضَّرَّآءِ وَحِيۡنَ الۡبَاۡسِؕ اُولٰٓٮِٕكَ الَّذِيۡنَ صَدَقُوۡاؕ وَاُولٰٓٮِٕكَ هُمُ الۡمُتَّقُوۡنَ",
        "urdu":"نیکی یہی نہیں کہ تم مشرق یا مغرب کو (قبلہ سمجھ کر ان) کی طرف منہ کرلو بلکہ نیکی یہ ہے کہ لوگ خدا پر اور روز آخرت پر اور فرشتوں پر اور (خدا کی) کتاب پر اور پیغمبروں پر ایمان لائیں۔ اور مال باوجود عزیز رکھنے کے رشتہ داروں اور یتیموں اور محتاجوں اور مسافروں اور مانگنے والوں کو دیں اور گردنوں (کے چھڑانے) میں (خرچ کریں) اور نماز پڑھیں اور زکوٰة دیں۔ اور جب عہد کرلیں تو اس کو پورا کریں۔ اور سختی اور تکلیف میں اور (معرکہ) کارزار کے وقت ثابت قدم رہیں۔ یہی لوگ ہیں جو (ایمان میں) سچے ہیں اور یہی ہیں جو (خدا سے) ڈرنے والے ہیں",
       "english":"It is not righteousness that ye turn your faces to the East and the West; but righteous is he who believeth in Allah and the Last Day and the angels and the Scripture and the prophets; and giveth wealth, for love of Him, to kinsfolk and to orphans and the needy and the wayfarer and to those who ask, and to set slaves free; and observeth proper worship and payeth the poor-due. And those who keep their treaty when they make one, and the patient in tribulation and adversity and time of stress. Such are they who are sincere. Such are the Allah-fearing."
       },{
       "arabic":"﴿1 يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡكُمُ الۡقِصَاصُ فِىۡ الۡقَتۡلَىؕ الۡحُرُّ بِالۡحُـرِّ وَالۡعَبۡدُ بِالۡعَبۡدِ وَالۡاُنۡثَىٰ بِالۡاُنۡثٰىؕ فَمَنۡ عُفِىَ لَهٗ مِنۡ اَخِيۡهِ شَىۡءٌ فَاتِّبَاعٌۢ بِالۡمَعۡرُوۡفِ وَاَدَآءٌ اِلَيۡهِ بِاِحۡسَانٍؕ ذٰلِكَ تَخۡفِيۡفٌ مِّنۡ رَّبِّكُمۡ وَرَحۡمَةٌؕ فَمَنِ اعۡتَدٰى بَعۡدَ ذٰلِكَ فَلَهٗ عَذَابٌ اَلِيۡمٌۚ",
        "urdu":"مومنو! تم کو مقتولوں کے بارےمیں قصاص (یعنی خون کے بدلے خون) کا حکم دیا جاتا ہے (اس طرح پر کہ)آزاد کے بدلے آزاد (مارا جائے) اور غلام کے بدلے غلام اور عورت کے بدلے عورت اور قاتل کو اس کے (مقتول) بھائی (کے قصاص میں) سے کچھ معاف کردیا جائے تو (وارث مقتول) کو پسندیدہ طریق سے (قرار داد کی) پیروی (یعنی مطالبہٴ خون بہا) کرنا اور (قاتل کو) خوش خوئی کے ساتھ ادا کرنا چاہیئے یہ پروردگار کی طرف سے تمہارے لئے آسانی اور مہربانی ہے جو اس کے بعد زیادتی کرے اس کے لئے دکھ کا عذاب ہے",
       "english":"O ye who believe! Retaliation is prescribed for you in the matter of the murdered; the freeman for the freeman, and the slave for the slave, and the female for the female. And for him who is forgiven somewhat by his (injured) brother, prosecution according to usage and payment unto him in kindness. This is an alleviation and a mercy from your Lord. He who transgresseth after this will have a painful doom."
       },{
       "arabic":"﴿1 وَ لَـكُمۡ فِىۡ الۡقِصَاصِ حَيٰوةٌ يّٰٓاُولِىۡ الۡاَلۡبَابِ لَعَلَّکُمۡ تَتَّقُوۡنَ",
        "urdu":"اور اے اہل عقل (حکم) قصاص میں (تمہاری) زندگانی ہے کہ تم (قتل و خونریزی سے) بچو",
       "english":"And there is life for you in retaliation, O men of understanding, that ye may ward off (evil)."
       },{
       "arabic":"﴿1 كُتِبَ عَلَيۡكُمۡ اِذَا حَضَرَ اَحَدَكُمُ الۡمَوۡتُ اِنۡ تَرَكَ خَيۡرَاۖۚ اۨلۡوَصِيَّةُ لِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ بِالۡمَعۡرُوۡفِۚ حَقًّا عَلَى الۡمُتَّقِيۡنَ",
        "urdu":"تم پر فرض کیا جاتا ہے کہ جب تم میں سے کسی کو موت کا وقت آجائے تو اگر وہ کچھ مال چھوڑ جانے والا ہو تو ماں با پ اور رشتہ داروں کے لئے دستور کے مطابق وصیت کرجائے (خدا سے) ڈر نے والوں پر یہ ایک حق ہے",
       "english":"It is prescribed for you, when death approacheth one of you, if he leave wealth, that he bequeath unto parents and near relatives in kindness. (This is) a duty for all those who ward off (evil)."
       },{
       "arabic":"﴿1 فَمَنۡۢ بَدَّلَهٗ بَعۡدَمَا سَمِعَهٗ فَاِنَّمَآ اِثۡمُهٗ عَلَى الَّذِيۡنَ يُبَدِّلُوۡنَهٗؕ اِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌؕ",
        "urdu":"جو شخص وصیت کو سننے کے بعد بدل ڈالے تو اس (کے بدلنے) کا گناہ انہیں لوگوں پر ہے جو اس کو بدلیں۔ اور بےشک خدا سنتا جانتا ہے",
       "english":"And whoso changeth (the will) after he hath heard it - the sin thereof is only upon those who change it. Lo! Allah is Hearer, Knower."
       },{
       "arabic":"﴿1 فَمَنۡ خَافَ مِنۡ مُّوۡصٍ جَنَفًا اَوۡ اِثۡمًا فَاَصۡلَحَ بَيۡنَهُمۡ فَلَاۤ اِثۡمَ عَلَيۡهِؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ",
        "urdu":"اگر کسی کو وصیت کرنے والے کی طرف سے (کسی وارث کی) طرفداری یا حق تلفی کا اندیشہ ہو تو اگر وہ (وصیت کو بدل کر) وارثوں میں صلح کرادے تو اس پر کچھ گناہ نہیں۔ بےشک خدا بخشنے والا (اور) رحم والا ہے",
       "english":"But he who feareth from a testator some unjust or sinful clause, and maketh peace between the parties, (it shall be) no sin for him. Lo! Allah is Forgiving, Merciful."
       },{
       "arabic":"﴿1 يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡکُمُ الصِّيَامُ کَمَا كُتِبَ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَۙ",
        "urdu":"مومنو! تم پر روزے فرض کئے گئے ہیں۔ جس طرح تم سے پہلے لوگوں پر فرض کئے گئے تھے تاکہ تم پرہیزگار بنو",
       "english":"O ye who believe! Fasting is prescribed for you, even as it was prescribed for those before you, that ye may ward off (evil);"
       },{
       "arabic":"﴿1 اَيَّامًا مَّعۡدُوۡدٰتٍؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَ‌ؕ وَعَلَى الَّذِيۡنَ يُطِيۡقُوۡنَهٗ فِدۡيَةٌ طَعَامُ مِسۡكِيۡنٍؕ فَمَنۡ تَطَوَّعَ خَيۡرًا فَهُوَ خَيۡرٌ لَّهٗؕ وَاَنۡ تَصُوۡمُوۡا خَيۡرٌ لَّـکُمۡ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ",
        "urdu":"(روزوں کے دن) گنتی کے چند روز ہیں تو جو شخص تم میں سے بیمار ہو یا سفر میں ہو تو دوسرے دنوں میں روزوں کا شمار پورا کرلے اور جو لوگ روزہ رکھنے کی طاقت رکھیں (لیکن رکھیں نہیں) وہ روزے کے بدلے محتاج کو کھانا کھلا دیں اور جو کوئی شوق سے نیکی کرے تو اس کے حق میں زیادہ اچھا ہے۔ اور اگر سمجھو تو روزہ رکھنا ہی تمہارے حق میں بہتر ہے",
       "english":"(Fast) a certain number of days; and (for) him who is sick among you, or on a journey, (the same) number of other days; and for those who can afford it there is a ransom: the feeding of a man in need - but whoso doeth good of his own accord, it is better for him: and that ye fast is better for you if ye did but know -"
       },{
       "arabic":"﴿1 شَهۡرُ رَمَضَانَ الَّذِىۡٓ اُنۡزِلَ فِيۡهِ الۡقُرۡاٰنُ هُدًى لِّلنَّاسِ وَ بَيِّنٰتٍ مِّنَ الۡهُدٰى وَالۡفُرۡقَانِۚ فَمَنۡ شَهِدَ مِنۡكُمُ الشَّهۡرَ فَلۡيَصُمۡهُؕ وَمَنۡ کَانَ مَرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَؕ يُرِيۡدُ اللّٰهُ بِکُمُ الۡيُسۡرَ وَلَا يُرِيۡدُ بِکُمُ الۡعُسۡرَ وَلِتُکۡمِلُوۡا الۡعِدَّةَ وَلِتُکَبِّرُوۡا اللّٰهَ عَلٰى مَا هَدٰٮكُمۡ وَلَعَلَّکُمۡ تَشۡكُرُوۡنَ",
        "urdu":"(روزوں کا مہینہ) رمضان کا مہینہ (ہے) جس میں قرآن (اول اول) نازل ہوا جو لوگوں کا رہنما ہے اور (جس میں) ہدایت کی کھلی نشانیاں ہیں اور (جو حق و باطل کو) الگ الگ کرنے والا ہے تو جو کوئی تم میں سے اس مہینے میں موجود ہو چاہیئے کہ پورے مہینے کے روزے رکھے اور جو بیمار ہو یا سفر میں ہو تو دوسرے دنوں میں (رکھ کر) ان کا شمار پورا کرلے۔ خدا تمہارے حق میں آسانی چاہتا ہے اور سختی نہیں چاہتا اور (یہ آسانی کا حکم) اس لئے (دیا گیا ہے) کہ تم روزوں کا شمار پورا کرلو اور اس احسان کے بدلے کہ خدا نے تم کو ہدایت بخشی ہے تم اس کو بزرگی سے یاد کر واور اس کا شکر کرو",
       "english":"The month of Ramadan in which was revealed the Qur'an, a guidance for mankind, and clear proofs of the guidance, and the Criterion (of right and wrong). And whosoever of you is present, let him fast the month, and whosoever of you is sick or on a journey, (let him fast the same) number of other days. Allah desireth for you ease; He desireth not hardship for you; and (He desireth) that ye should complete the period, and that ye should magnify Allah for having guided you, and that peradventure ye may be thankful."
       },{
       "arabic":"﴿1 وَاِذَا سَاَلَـكَ عِبَادِىۡ عَنِّىۡ فَاِنِّىۡ قَرِيۡبٌؕ اُجِيۡبُ دَعۡوَةَ الدَّاعِ اِذَا دَعَانِ فَلۡيَسۡتَجِيۡبُوۡا لِىۡ وَلۡيُؤۡمِنُوۡا بِىۡ لَعَلَّهُمۡ يَرۡشُدُوۡنَ",
        "urdu":"اور (اے پیغمبر) جب تم سے میرے بندے میرے بارے میں دریافت کریں تو (کہہ دو کہ) میں تو (تمہارے) پاس ہوں جب کوئی پکارنے والا مجھے پکارتا ہے تو میں اس کی دعا قبول کرتا ہوں تو ان کو چاہیئے کہ میرے حکموں کو مانیں اور مجھ پر ایمان لائیں تاکہ نیک رستہ پائیں",
       "english":"And when My servants question thee concerning Me, then surely I am nigh. I answer the prayer of the suppliant when he crieth unto Me. So let them hear My call and let them trust in Me, in order that they may be led aright."
       },{
       "arabic":"﴿1 اُحِلَّ لَـکُمۡ لَيۡلَةَ الصِّيَامِ الرَّفَثُ اِلٰى نِسَآٮِٕكُمۡ‌ؕ هُنَّ لِبَاسٌ لَّـكُمۡ وَاَنۡتُمۡ لِبَاسٌ لَّهُنَّؕ عَلِمَ اللّٰهُ اَنَّکُمۡ كُنۡتُمۡ تَخۡتَانُوۡنَ اَنۡفُسَکُمۡ فَتَابَ عَلَيۡكُمۡ وَعَفَا عَنۡكُمۡۚ فَالۡـٰٔـنَ بَاشِرُوۡهُنَّ وَابۡتَغُوۡا مَا کَتَبَ اللّٰهُ لَـكُمۡؕ وَكُلُوۡا وَاشۡرَبُوۡا حَتّٰى يَتَبَيَّنَ لَـكُمُ الۡخَـيۡطُ الۡاَبۡيَضُ مِنَ الۡخَـيۡطِ الۡاَسۡوَدِ مِنَ الۡفَجۡرِ‌ؕ ثُمَّ اَتِمُّوۡا الصِّيَامَ اِلَى الَّيۡلِ‌ۚ وَلَا تُبٰشِرُوۡهُنَّ وَاَنۡتُمۡ عٰكِفُوۡنَ فِىۡ الۡمَسٰجِدِؕ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَقۡرَبُوۡهَاؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَّقُوۡنَ",
        "urdu":"روزوں کی راتوں میں تمہارے لئے اپنی عورتوں کے پاس جانا کردیا گیا ہے وہ تمہاری پوشاک ہیں اور تم ان کی پوشاک ہو خدا کو معلوم ہے کہ تم (ان کے پاس جانے سے) اپنے حق میں خیانت کرتے تھے سو اس نے تم پر مہربانی کی اور تمہاری حرکات سےدرگزرفرمائی۔اب (تم کو اختیار ہے کہ) ان سے مباشرت کرو۔ اور خدا نے جو چیز تمہارے لئے لکھ رکھی ہے (یعنی اولاد) اس کو (خدا سے) طلب کرو اور کھاؤ پیو یہاں تک کہ صبح کی سفید دھاری (رات کی) سیاہ دھاری سے الگ نظر آنے لگے۔ پھر روزہ (رکھ کر) رات تک پورا کرو اور جب تم مسجدوں میں اعتکاف بیٹھے ہو تو ان سے مباشرت نہ کرو۔ یہ خدا کی حدیں ہیں ان کے پاس نہ جانا۔ اسی طرح خدا اپنی آیتیں لوگوں کے (سمجھانے کے) لئے کھول کھول کر بیان فرماتا ہے تاکہ وہ پرہیزگار بنیں",
       "english":"It is made lawful for you to go in unto your wives on the night of the fast. They are raiment for you and ye are raiment for them. Allah is Aware that ye were deceiving yourselves in this respect and He hath turned in mercy toward you and relieved you. So hold intercourse with them and seek that which Allah hath ordained for you, and eat and drink until the white thread becometh distinct to you from the black thread of the dawn. Then strictly observe the fast till nightfall and touch them not, but be at your devotions in the mosques. These are the limits imposed by Allah, so approach them not. Thus Allah expoundeth His revelation to mankind that they may ward off (evil)."
       },{
       "arabic":"﴿1 وَلَا تَاۡكُلُوۡٓا اَمۡوَالَـكُمۡ بَيۡنَكُمۡ بِالۡبَاطِلِ وَتُدۡلُوۡا بِهَآ اِلَى الۡحُکَّامِ لِتَاۡکُلُوۡا فَرِيۡقًا مِّنۡ اَمۡوَالِ النَّاسِ بِالۡاِثۡمِ وَاَنۡتُمۡ تَعۡلَمُوۡنَ",
        "urdu":"اور ایک دوسرے کا مال ناحق نہ کھاؤ اورنہ اس کو (رشوةً) حاکموں کے پاس پہنچاؤ تاکہ لوگوں کے مال کا کچھ حصہ ناجائز طور پر کھا جاؤ اور (اسے) تم جانتے بھی ہو",
       "english":"And eat not up your property among yourselves in vanity, nor seek by it to gain the hearing of the judges that ye may knowingly devour a portion of the property of others wrongfully."
       },{
       "arabic":"﴿1 يَسۡـَٔـلُوۡنَكَ عَنِ الۡاَهِلَّةِ‌ؕ قُلۡ هِىَ مَوَاقِيۡتُ لِلنَّاسِ وَالۡحَجِّ ؕ وَلَيۡسَ الۡبِرُّ بِاَنۡ تَاۡتُوۡا الۡبُيُوۡتَ مِنۡ ظُهُوۡرِهَا وَلٰـكِنَّ الۡبِرَّ مَنِ اتَّقٰى‌ۚ وَاۡتُوۡا الۡبُيُوۡتَ مِنۡ اَبۡوٰبِهَا وَاتَّقُوۡا اللّٰهَ لَعَلَّکُمۡ تُفۡلِحُوۡنَ",
        "urdu":"(اے محمدﷺ) لوگ تم سے نئے چاند کے بارے میں دریافت کرتے ہیں (کہ گھٹتا بڑھتا کیوں ہے) کہہ دو کہ وہ لوگوں کے (کاموں کی میعادیں) اور حج کے وقت معلوم ہونے کا ذریعہ ہے اور نیکی اس بات میں نہیں کہ (احرام کی حالت میں) گھروں میں ان کے پچھواڑے کی طرف سے آؤ۔ بلکہ نیکوکار وہ ہے جو پرہیز گار ہو اور گھروں میں ان کے دروازوں سے آیا کرو اور خدا سے ڈرتے رہو تاکہ نجات پاؤ",
       "english":"They ask thee, (O Muhammad), of new moons, say: They are fixed seasons for mankind and for the pilgrimage. It is not righteousness that ye go to houses by the backs thereof (as do the idolaters at certain seasons), but the righteous man is he who wardeth off (evil). So go to houses by the gates thereof, and observe your duty to Allah, that ye may be successful."
       },{
       "arabic":"﴿1 وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ الَّذِيۡنَ يُقَاتِلُوۡنَكُمۡ وَلَا تَعۡتَدُوۡاؕ اِنَّ اللّٰهَ لَا يُحِبُّ الۡمُعۡتَدِيۡنَ",
        "urdu":"اور جو لوگ تم سے لڑتے ہیں تم بھی خدا کی راہ میں ان سے لڑو مگر زیادتی نہ کرنا کہ خدا زیادتی کرنے والوں کو دوست نہیں رکھتا",
       "english":"Fight in the way of Allah against those who fight against you, but begin not hostilities. Lo! Allah loveth not aggressors."
       },{
       "arabic":"﴿1 وَاقۡتُلُوۡهُمۡ حَيۡثُ ثَقِفۡتُمُوۡهُمۡ وَاَخۡرِجُوۡهُمۡ مِّنۡ حَيۡثُ اَخۡرَجُوۡكُمۡ‌ وَالۡفِتۡنَةُ اَشَدُّ مِنَ الۡقَتۡلِۚ وَلَا تُقٰتِلُوۡهُمۡ عِنۡدَ الۡمَسۡجِدِ الۡحَـرَامِ حَتّٰى يُقٰتِلُوۡكُمۡ فِيۡهِ‌ۚ فَاِنۡ قٰتَلُوۡكُمۡ فَاقۡتُلُوۡهُمۡؕ كَذٰلِكَ جَزَآءُ الۡكٰفِرِيۡنَ",
        "urdu":"اور ان کو جہاں پاؤ قتل کردو اور جہاں سے انہوں نے تم کو نکالا ہے (یعنی مکے سے) وہاں سے تم بھی ان کو نکال دو۔ اور (دین سے گمراہ کرنے کا) فساد قتل وخونریزی سے کہیں بڑھ کر ہے اور جب تک وہ تم سے مسجد محترم (یعنی خانہ کعبہ) کے پاس نہ لڑیں تم بھی وہاں ان سے نہ لڑنا۔ ہاں اگر وہ تم سے لڑیں تو تم ان کو قتل کرڈالو۔ کافروں کی یہی سزا ہے",
       "english":"And slay them wherever ye find them, and drive them out of the places whence they drove you out, for persecution is worse than slaughter. And fight not with them at the Inviolable Place of Worship until they first attack you there, but if they attack you (there) then slay them. Such is the reward of disbelievers."
       },{
       "arabic":"﴿1 فَاِنِ انتَهَوۡا فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ",
        "urdu":"اور اگر وہ باز آجائیں تو خدا بخشنے والا (اور) رحم کرنے والا ہے",
       "english":"But if they desist, then lo! Allah is Forgiving, Merciful."
       },{
       "arabic":"﴿1 وَقٰتِلُوۡهُمۡ حَتّٰى لَا تَكُوۡنَ فِتۡنَةٌ وَّيَكُوۡنَ الدِّيۡنُ لِلّٰهِ‌ؕ فَاِنِ انتَهَوۡا فَلَا عُدۡوَانَ اِلَّا عَلَى الظّٰلِمِيۡنَ",
        "urdu":"اور ان سے اس وقت تک لڑتے رہنا کہ فساد نابود ہوجائے اور (ملک میں) خدا ہی کا دین ہوجائے اور اگر وہ (فساد سے) باز آجائیں تو ظالموں کے سوا کسی پر زیادتی نہیں (کرنی چاہیئے)",
       "english":"And fight them until persecution is no more, and religion is for Allah. But if they desist, then let there be no hostility except against wrong-doers."
       },{
       "arabic":"﴿1 الشَّهۡرُ الۡحَـرَامُ بِالشَّهۡرِ الۡحَـرَامِ وَالۡحُرُمٰتُ قِصَاصٌ‌ؕ فَمَنِ اعۡتَدٰى عَلَيۡكُمۡ فَاعۡتَدُوۡا عَلَيۡهِ بِمِثۡلِ مَا اعۡتَدٰى عَلَيۡكُمۡ وَاتَّقُوۡا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ مَعَ الۡمُتَّقِيۡنَ",
        "urdu":"ادب کا مہینہ ادب کے مہینے کے مقابل ہے اور ادب کی چیزیں ایک دوسرے کا بدلہ ہیں۔ پس اگر کوئی تم پر زیادتی کرے تو جیسی زیادتی وہ تم پر کرے ویسی ہی تم اس پر کرو۔ اور خدا سے ڈرتے رہو اور جان رکھو کہ خدا ڈرنے والوں کے ساتھ ہے",
       "english":"The forbidden month for the forbidden month, and forbidden things in retaliation. And one who attacketh you, attack him in like manner as he attacked you. Observe your duty to Allah, and know that Allah is with those who ward off (evil)."
       },{
       "arabic":"﴿1 وَاَنۡفِقُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَلَا تُلۡقُوۡا بِاَيۡدِيۡكُمۡ اِلَى التَّهۡلُكَةِ‌ۖۛۚ وَاَحۡسِنُوۡاۛۚ اِنَّ اللّٰهَ يُحِبُّ الۡمُحۡسِنِيۡنَ",
        "urdu":"اور خدا کی راہ میں (مال) خرچ کرو اور اپنے آپ کو ہلاکت میں نہ ڈالو اور نیکی کرو بےشک خدا نیکی کرنے والوں کو دوست رکھتا ہے",
       "english":"Spend your wealth for the cause of Allah, and be not cast by your own hands to ruin; and do good. Lo! Allah loveth the beneficent."
       },{
       "arabic":"﴿1 وَاَتِمُّوۡا الۡحَجَّ وَالۡعُمۡرَةَ لِلّٰهِؕ فَاِنۡ اُحۡصِرۡتُمۡ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ‌ۚ وَلَا تَحۡلِقُوۡا رُءُوۡسَكُمۡ حَتّٰى يَبۡلُغَ الۡهَدۡىُ مَحِلَّهٗؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ بِهٖۤ اَذًى مِّنۡ رَّاۡسِهٖ فَفِدۡيَةٌ مِّنۡ صِيَامٍ اَوۡ صَدَقَةٍ اَوۡ نُسُكٍۚ فَاِذَآ اَمِنۡتُمۡ فَمَنۡ تَمَتَّعَ بِالۡعُمۡرَةِ اِلَى الۡحَجِّ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ‌ۚ فَمَنۡ لَّمۡ يَجِدۡ فَصِيَامُ ثَلٰثَةِ اَيَّامٍ فِىۡ الۡحَجِّ وَسَبۡعَةٍ اِذَا رَجَعۡتُمۡؕ تِلۡكَ عَشَرَةٌ كَامِلَةٌؕ ذٰلِكَ لِمَنۡ لَّمۡ يَكُنۡ اَهۡلُهٗ حَاضِرِىۡ الۡمَسۡجِدِ الۡحَـرَامِ‌ؕ وَاتَّقُوۡا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ",
        "urdu":"اور خدا (کی خوشنودی) کے لئے حج اور عمرے کو پورا کرو۔ اور اگر (راستےمیں) روک لئے جاؤ تو جیسی قربانی میسر ہو (کردو) اور جب تک قربانی اپنے مقام پر نہ پہنچ جائے سر نہ منڈاؤ۔ اور اگر کوئی تم میں بیمار ہو یا اس کے سر میں کسی طرح کی تکلیف ہو تو (اگر وہ سر منڈالے تو) اس کے بدلے روزے رکھے یا صدقہ دے یا قربانی کرے پھر جب (تکلیف دور ہو کر) تم مطمئن ہوجاؤ تو جو (تم میں) حج کے وقت تک عمرے سے فائدہ اٹھانا چاہے وہ جیسی قربانی میسر ہو کرے۔ اور جس کو (قربانی) نہ ملے وہ تین روزے ایام حج میں رکھے اور سات جب واپس ہو۔ یہ پورے دس ہوئے۔ یہ حکم اس شخص کے لئے ہے جس کے اہل وعیال مکے میں نہ رہتے ہوں اور خدا سے ڈرتے رہو اور جان رکھو کہ خدا سخت عذاب دینے والا ہے",
       "english":"Perform the pilgrimage and the visit (to Makka) for Allah. And if ye are prevented, then send such gifts as can be obtained with ease, and shave not your heads until the gifts have reached their destination. And whoever among you is sick or hath an ailment of the head must pay a ransom of fasting or almsgiving or offering. And if ye are in safety, then whosoever contenteth himself with the visit for the pilgrimage (shall give) such gifts as can be had with ease. And whosoever cannot find (such gifts), then a fast of three days while on the pilgrimage, and of seven when ye have returned; that is, ten in all. That is for him whoso folk are not present at the Inviolable Place of Worship. Observe your duty to Allah, and know that Allah is severe in punishment."
       },{
       "arabic":"﴿1 اَلۡحَجُّ اَشۡهُرٌ مَّعۡلُوۡمٰتٌ‌ۚ فَمَنۡ فَرَضَ فِيۡهِنَّ الۡحَجَّ فَلَا رَفَثَ وَلَا فُسُوۡقَۙ وَلَا جِدَالَ فِىۡ الۡحَجِّؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ يَّعۡلَمۡهُ اللّٰهُ‌ؕؔ وَتَزَوَّدُوۡا فَاِنَّ خَيۡرَ الزَّادِ التَّقۡوٰى وَاتَّقُوۡنِ يٰٓاُولِىۡ الۡاَلۡبَابِ",
        "urdu":"حج کے مہینے (معین ہیں جو) معلوم ہیں تو شخص ان مہینوں میں حج کی نیت کرلے تو حج (کے دنوں) میں نہ عورتوں سے اختلاط کرے نہ کوئی برا کام کرے نہ کسی سے جھگڑے۔ اور جو نیک کام تم کرو گے وہ خدا کو معلوم ہوجائے گا اور زاد راہ (یعنی رستے کا خرچ) ساتھ لے جاؤ کیونکہ بہتر (فائدہ) زاد راہ (کا) پرہیزگاری ہے اور اے اہل عقل مجھ سے ڈرتے رہو",
       "english":"The pilgrimage is (in) the well-known months, and whoever is minded to perform the pilgrimage therein (let him remember that) there is (to be) no lewdness nor abuse nor angry conversation on the pilgrimage. And whatsoever good ye do Allah knoweth it. So make provision for yourselves (Hereafter); for the best provision is to ward off evil. Therefore keep your duty unto Me, O men of understanding."
       },{
       "arabic":"﴿1 ‌لَيۡسَ عَلَيۡکُمۡ جُنَاحٌ اَنۡ تَبۡتَغُوۡا فَضۡلاً مِّنۡ رَّبِّکُمۡؕ فَاِذَآ اَفَضۡتُمۡ مِّنۡ عَرَفٰتٍ فَاذۡکُرُوۡا اللّٰهَ عِنۡدَ الۡمَشۡعَرِ الۡحَـرَامِ وَاذۡکُرُوۡهُ کَمَا هَدٰٮکُمۡ‌ۚ وَاِنۡ کُنۡتُمۡ مِّنۡ قَبۡلِهٖ لَمِنَ الضَّآلِّيۡنَ",
        "urdu":"اس کا تمہیں کچھ گناہ نہیں کہ (حج کے دنوں میں بذریعہ تجارت) اپنے پروردگار سے روزی طلب کرو اور جب عرفات سے واپس ہونے لگو تو مشعر حرام (یعنی مزدلفے) میں خدا کا ذکر کرو اور اس طرح ذکر کرو جس طرح اس نے تم کو سکھایا۔ اور اس سے پیشتر تم لوگ (ان طریقوں سے) محض ناواقف تھے",
       "english":"It is no sin for you that ye seek the bounty of your Lord (by trading). But, when ye press on in the multitude from 'Arafat, remember Allah by the sacred monument. Remember Him as He hath guided you, although before ye were of those astray."
       },{
       "arabic":"﴿1 ثُمَّ اَفِيۡضُوۡا مِنۡ حَيۡثُ اَفَاضَ النَّاسُ وَاسۡتَغۡفِرُوۡا اللّٰهَ‌ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ",
        "urdu":"پھر جہاں سے اور لوگ واپس ہوں وہیں سے تم بھی واپس ہو اور خدا سے بخشش مانگو۔ بےشک خدا بخشنے والا اور رحمت کرنے والا ہے",
       "english":"Then hasten onward from the place whence the multitude hasteneth onward, and ask forgiveness of Allah. Lo! Allah is Forgiving, Merciful."
       },{
       "arabic":"﴿2 فَاِذَا قَضَيۡتُمۡ مَّنَاسِكَکُمۡ فَاذۡکُرُوۡا اللّٰهَ كَذِكۡرِكُمۡ اٰبَآءَکُمۡ اَوۡ اَشَدَّ ذِکۡرًاؕ فَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِىۡ الدُّنۡيَا وَمَا لَهٗ فِىۡ الۡاٰخِرَةِ مِنۡ خَلَاقٍ",
        "urdu":"پھر جب حج کے تمام ارکان پورے کرچکو تو (منیٰ میں) خدا کو یاد کرو۔ جس طرح اپنے باپ دادا کو یاد کیا کرتے تھے بلکہ اس سے بھی زیادہ اور بعض لوگ ایسے ہیں جو (خدا سے) التجا کرتے ہیں کہ اے پروردگار ہم کو (جو دنیا ہے) دنیا ہی میں عنایت کر ایسے لوگوں کا آخرت میں کچھ حصہ نہیں",
       "english":"And when ye have completed your devotions, then remember Allah as ye remember your fathers or with a more lively remembrance. But of mankind is he who saith: Our Lord! Give unto us in the world, and he hath no portion in the Hereafter."
       },{
       "arabic":"﴿2 وَمِنۡهُمۡ مَّنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِىۡ الدُّنۡيَا حَسَنَةً وَّفِىۡ الۡاٰخِرَةِ حَسَنَةً وَّ قِنَا عَذَابَ النَّارِ",
        "urdu":"اور بعضے ایسے ہیں کہ دعا کرتے ہیں کہ پروردگار ہم کو دنیا میں بھی نعمت عطا فرما اور آخرت میں بھی نعمت بخشیو اور دوزخ کے عذاب سے محفوظ رکھیو",
       "english":"And of them (also) is he who saith: Our Lord! Give unto us in the world that which is good and in the Hereafter that which is good, and guard us from the doom of Fire."
       },{
       "arabic":"﴿2 اُولٰٓٮِٕكَ لَهُمۡ نَصِيۡبٌ مِّمَّا كَسَبُوۡا‌ؕ وَاللّٰهُ سَرِيۡعُ الۡحِسَابِ",
        "urdu":"یہی لوگ ہیں جن کے لئے ان کے کاموں کا حصہ (یعنی اجر نیک تیار) ہے اور خدا جلد حساب لینے والا (اور جلد اجر دینے والا) ہے",
       "english":"For them there is in store a goodly portion out of that which they have earned. Allah is swift at reckoning."
       },{
       "arabic":"﴿2 وَاذۡكُرُوۡا اللّٰهَ فِىۡٓ اَيَّامٍ مَّعۡدُوۡدٰتٍ‌ؕ فَمَنۡ تَعَجَّلَ فِىۡ يَوۡمَيۡنِ فَلَاۤ اِثۡمَ عَلَيۡهِۚ وَمَنۡ تَاَخَّرَ فَلَاۤ اِثۡمَ عَلَيۡه‌ِۙ لِمَنِ اتَّقٰىؕ وَاتَّقُوۡا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ اِلَيۡهِ تُحۡشَرُوۡنَ",
        "urdu":"اور (قیام منیٰ کے) دنوں میں (جو) گنتی کے (دن میں) خدا کو یاد کرو۔ اگر کوئی جلدی کرے (اور) دو ہی دن میں (چل دے) تو اس پر بھی کچھ گناہ نہیں۔ اور جو بعد تک ٹھہرا رہے اس پر بھی کچھ گناہ نہیں۔ یہ باتیں اس شخص کے لئے ہیں جو (خدا سے) ڈرے اور تم لوگ خدا سے ڈرتے رہو اور جان رکھو کہ تم سب اس کے پاس جمع کئے جاؤ گے۔",
       "english":"Remember Allah through the appointed days. Then whoso hasteneth (his departure) by two days, it is no sin for him, and whoso delayeth, it is no sin for him; that is for him who wardeth off (evil). Be careful of your duty to Allah, and know that unto Him ye will be gathered."
       },{
       "arabic":"﴿2 وَمِنَ النَّاسِ مَنۡ يُّعۡجِبُكَ قَوۡلُهٗ فِىۡ الۡحَيٰوةِ الدُّنۡيَا وَيُشۡهِدُ اللّٰهَ عَلٰى مَا فِىۡ قَلۡبِهٖۙ وَهُوَ اَلَدُّ الۡخِصَامِ",
        "urdu":"اور کوئی شخص تو ایسا ہے جس کی گفتگو دنیا کی زندگی میں تم کو دلکش معلوم ہوتی ہے اور وہ اپنی مانی الضمیر پر خدا کو گواہ بناتا ہے حالانکہ وہ سخت جھگڑالو ہے",
       "english":"And of mankind there is he whoso conversation on the life of this world pleaseth thee (Muhammad), and he calleth Allah to witness as to that which is in his heart; yet he is the most rigid of opponents."
       },{
       "arabic":"﴿2 وَاِذَا تَوَلَّىٰ سَعٰى فِىۡ الۡاَرۡضِ لِيُفۡسِدَ فِيۡهَا وَيُهۡلِكَ الۡحَـرۡثَ وَالنَّسۡلَ‌ؕ وَاللّٰهُ لَا يُحِبُّ الۡفَسَادَ",
        "urdu":"اور جب پیٹھ پھیر کر چلا جاتا ہے تو زمین میں دوڑتا پھرتا ہے تاکہ اس میں فتنہ انگیزی کرے اور کھیتی کو (برباد) اور (انسانوں اور حیوانوں کی) نسل کو نابود کردے اور خدا فتنہ انگیزی کو پسند نہیں کرتا",
       "english":"And when he turneth away (from thee) his effort in the land is to make mischief therein and to destroy the crops and the cattle; and Allah loveth not mischief."
       },{
       "arabic":"﴿2 وَاِذَا قِيۡلَ لَهُ اتَّقِ اللّٰهَ اَخَذَتۡهُ الۡعِزَّةُ بِالۡاِثۡمِ‌ فَحَسۡبُهٗ جَهَنَّمُ‌ؕ وَلَبِئۡسَ الۡمِهَادُ",
        "urdu":"اور جب اس سے کہا جاتا ہے کہ خدا سے خوف کر تو غرور اس کو گناہ میں پھنسا دیتا ہے۔ سو ایسے کو جہنم سزاوار ہے۔ اور وہ بہت برا ٹھکانہ ہے",
       "english":"And when it is said unto him: Be careful of thy duty to Allah, pride taketh him to sin. Hell will settle his account, an evil resting-place."
       },{
       "arabic":"﴿2 وَمِنَ النَّاسِ مَنۡ يَّشۡرِىۡ نَفۡسَهُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ‌ؕ وَ اللّٰهُ رَءُوۡفٌۢ بِالۡعِبَادِ",
        "urdu":"اور کوئی شخص ایسا ہے کہ خدا کی خوشنودی حاصل کرنے کے لئے اپنی جان بیچ ڈالتا ہے اور خدا بندوں پر بہت مہربان ہے",
       "english":"And of mankind is he who would sell himself, seeking the pleasure of Allah; and Allah hath compassion on (His) bondmen."
       },{
       "arabic":"﴿2 يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا ادۡخُلُوۡا فِىۡ السِّلۡمِ کَآفَّةً وَّلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِ‌ؕ اِنَّهٗ لَـکُمۡ عَدُوٌّ مُّبِيۡنٌ",
        "urdu":"مومنو! اسلام میں پورے پورے داخل ہوجاؤ اور شیطان کے پیچھے نہ چلو وہ تو تمہارا صریح دشمن ہے",
       "english":"O ye who believe! Come, all of you, into submission (unto Him); and follow not the footsteps of the devil. Lo! he is an open enemy for you."
       },{
       "arabic":"﴿2 فَاِنۡ زَلَـلۡتُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡکُمُ الۡبَيِّنٰتُ فَاعۡلَمُوۡٓا اَنَّ اللّٰهَ عَزِيۡزٌ حَکِيۡمٌ",
        "urdu":"پھر اگر تم احکام روشن پہنچ جانے کے بعد لڑکھڑاجاؤ تو جان جاؤ کہ خدا غالب (اور) حکمت والا ہے",
       "english":"And if ye slide back after the clear proofs have come unto you, then know that Allah is Mighty, Wise."
       },{
       "arabic":"﴿2 هَلۡ يَنۡظُرُوۡنَ اِلَّاۤ اَنۡ يَّاۡتِيَهُمُ اللّٰهُ فِىۡ ظُلَلٍ مِّنَ الۡغَمَامِ وَالۡمَلٰٓٮِٕکَةُ وَقُضِىَ الۡاَمۡرُ‌ؕ وَاِلَى اللّٰهِ تُرۡجَعُ الۡاُمُوۡرُ",
         "urdu":"کیا یہ لوگ اسی بات کے منتظر ہیں کہ ان پر خدا (کاعذاب) بادل کے سائبانوں میں آنازل ہو اور فرشتے بھی (اتر آئیں) اور کام تمام کردیا جائے اور سب کاموں کا رجوع خدا ہی کی طرف ہے",
       "english":"Wait they for naught else than that Allah should come unto them in the shadows of the clouds with the angels? Then the case would be already judged. All cases go back to Allah (for judgment)."
       },{
       "arabic":"﴿2 سَلۡ بَنِىۡٓ اِسۡرَآءِيۡلَ كَمۡ اٰتَيۡنٰهُمۡ مِّنۡ اٰيَةٍۢ بَيِّنَةٍ‌ؕ وَمَنۡ يُّبَدِّلۡ نِعۡمَةَ اللّٰهِ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُ فَاِنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ",
        "urdu":"(اے محمد) بنی اسرائیل سے پوچھو کہ ہم نے ان کو کتنی کھلی نشانیاں دیں۔ اور جو شخص خدا کی نعمت کو اپنے پاس آنے کے بعد بدل دے تو خدا سخت عذاب کرنے والا ہے",
       "english":"Ask of the Children of Israel how many a clear revelation We gave them! He who altereth the grace of Allah after it hath come unto him (for him), lo! Allah is severe in punishment."
       },{
       "arabic":"﴿2 زُيِّنَ لِلَّذِيۡنَ كَفَرُوۡا الۡحَيٰوةُ الدُّنۡيَا وَيَسۡخَرُوۡنَ مِنَ الَّذِيۡنَ اٰمَنُوۡا‌ۘ وَالَّذِيۡنَ اتَّقَوۡا فَوۡقَهُمۡ يَوۡمَ الۡقِيٰمَةِؕ وَاللّٰهُ يَرۡزُقُ مَنۡ يَّشَآءُ بِغَيۡرِ حِسَابٍ",
        "urdu":"اور جو کافر ہیں ان کے لئے دنیا کی زندگی خوشنما کر دی گئی ہے اور وہ مومنوں سے تمسخر کرتے ہیں لیکن جو پرہیز گار ہیں وہ قیامت کے دن ان پر غالب ہوں گے اور خدا جس کو چاہتا ہے بےشمار رزق دیتا ہے",
       "english":"Beautified is the life of the world for those who disbelieve; they make a jest of the believers. But those who keep their duty to Allah will be above them on the Day of Resurrection. Allah giveth without stint to whom He will."
       },{
       "arabic":"﴿2 كَانَ النَّاسُ اُمَّةً وَّاحِدَةً فَبَعَثَ اللّٰهُ النَّبِيّٖنَ مُبَشِّرِيۡنَ وَمُنۡذِرِيۡنَ وَاَنۡزَلَ مَعَهُمُ الۡكِتٰبَ بِالۡحَـقِّ لِيَحۡكُمَ بَيۡنَ النَّاسِ فِيۡمَا اخۡتَلَفُوۡا فِيۡهِ‌ؕ وَمَا اخۡتَلَفَ فِيۡهِ اِلَّا الَّذِيۡنَ اُوۡتُوۡهُ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ بَغۡيًاۢ بَيۡنَهُمۡ‌ۚ فَهَدَى اللّٰهُ الَّذِيۡنَ اٰمَنُوۡا لِمَا اخۡتَلَفُوۡا فِيۡهِ مِنَ الۡحَـقِّ بِاِذۡنِهٖ‌ؕ وَاللّٰهُ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِرَاطٍ مُّسۡتَقِيۡمٍ",
        "urdu":"(پہلے تو سب) لوگوں کا ایک ہی مذہب تھا (لیکن وہ آپس میں اختلاف کرنے لگے) تو خدا نے (ان کی طرف) بشارت دینے والے اور ڈر سنانے والے پیغمبر بھیجے اور ان پر سچائی کے ساتھ کتابیں نازل کیں تاکہ جن امور میں لوگ اختلاف کرتے تھے ان کا ان میں فیصلہ کردے۔ اور اس میں اختلاف بھی انہیں لوگوں نے کیا جن کو کتاب دی گئی تھی باوجود یہ کہ ان کے پاس کھلے ہوئے احکام آچکے تھے (اور یہ اختلاف انہوں نے صرف) آپس کی ضد سے (کیا) تو جس امر حق میں وہ اختلاف کرتے تھے خدا نے اپنی مہربانی سے مومنوں کو اس کی راہ دکھا دی۔ اور خدا جس کو چاہتا ہے سیدھا رستہ دکھا دیتا ہے",
       "english":"Mankind were one community, and Allah sent (unto them) prophets as bearers of good tidings and as warners, and revealed therewith the Scripture with the truth that it might judge between mankind concerning that wherein they differed. And only those unto whom (the Scripture) was given differed concerning it, after clear proofs had come unto them, through hatred one of another. And Allah by His Will guided those who believe unto the truth of that concerning which they differed. Allah guideth whom He will unto a straight path."
       },{
       "arabic":"﴿2 اَمۡ حَسِبۡتُمۡ اَنۡ تَدۡخُلُوۡا الۡجَـنَّةَ وَ لَمَّا يَاۡتِكُمۡ مَّثَلُ الَّذِيۡنَ خَلَوۡا مِنۡ قَبۡلِكُمۡؕ مَّسَّتۡهُمُ الۡبَاۡسَآءُ وَالضَّرَّآءُ وَزُلۡزِلُوۡا حَتّٰى يَقُوۡلَ الرَّسُوۡلُ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ مَتٰى نَصۡرُ اللّٰهِؕ اَلَاۤ اِنَّ نَصۡرَ اللّٰهِ قَرِيۡبٌ",
        "urdu":"کیا تم یہ خیال کرتے ہو کہ (یوں ہی) بہشت میں داخل ہوجاؤ گے اور ابھی تم کو پہلے لوگوں کی سی (مشکلیں) تو پیش آئی ہی نہیں۔ ان کو (بڑی بڑی) سختیاں اور تکلیفیں پہنچیں اور وہ (صعوبتوں میں) ہلا ہلا دیئے گئے۔ یہاں تک کہ پیغمبر اور مومن لوگ جو ان کے ساتھ تھے سب پکار اٹھے کہ کب خدا کی مدد آئے گی ۔ دیکھو خدا کی مدد (عن) قریب (آيا چاہتی) ہے",
       "english":"Or think ye that ye will enter paradise while yet there hath not come unto you the like of (that which came to) those who passed away before you? Affliction and adversity befell them, they were shaken as with earthquake, till the messenger (of Allah) and those who believed along with him said: When cometh Allah's help? Now surely Allah's help is nigh."
       },{
       "arabic":"﴿2 يَسۡـَٔـلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَؕ قُلۡ مَآ اَنۡفَقۡتُمۡ مِّنۡ خَيۡرٍ فَلِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنِ وَابۡنِ السَّبِيۡلِ‌ؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ",
        "urdu":"(اے محمدﷺ) لوگ تم سے پوچھتے ہیں کہ (خدا کی راہ میں) کس طرح کا مال خرچ کریں۔ کہہ دو کہ (جو چاہو خرچ کرو لیکن) جو مال خرچ کرنا چاہو وہ (درجہ بدرجہ اہل استحقاق یعنی) ماں باپ اور قریب کے رشتے داروں کو اور یتیموں کو اور محتاجوں کو اور مسافروں کو (سب کو دو) اور جو بھلائی تم کرو گے خدا اس کو جانتا ہے",
       "english":"They ask thee, (O Muhammad), what they shall spend. Say: that which ye spend for good (must go) to parents and near kindred and orphans and the needy and the wayfarer. And whatsoever good ye do, lo! Allah is Aware of it."
       },{
       "arabic":"﴿2 كُتِبَ عَلَيۡکُمُ الۡقِتَالُ وَهُوَ كُرۡهٌ لَّـكُمۡ‌ۚ وَعَسٰۤى اَنۡ تَكۡرَهُوۡا شَيۡـًٔـا وَّهُوَ خَيۡرٌ لَّـکُمۡ‌ۚ وَعَسٰۤى اَنۡ تُحِبُّوۡا شَيۡـًٔـا وَّهُوَ شَرٌّ لَّـكُمۡؕ وَاللّٰهُ يَعۡلَمُ وَاَنۡتُمۡ لَا تَعۡلَمُوۡنَ",
        "urdu":"(مسلمانو) تم پر (خدا کے رستے میں) لڑنا فرض کردیا گیا ہے وہ تمہیں ناگوار تو ہوگا مگر عجب نہیں کہ ایک چیز تم کو بری لگے اور وہ تمہارے حق میں بھلی ہو اور عجب نہیں کہ ایک چیز تم کو بھلی لگے اور وہ تمہارے لئے مضر ہو۔ اور ان باتوں کو) خدا ہی بہتر جانتا ہے اور تم نہیں جانتے",
       "english":"Warfare is ordained for you, though it is hateful unto you; but it may happen that ye hate a thing which is good for you, and it may happen that ye love a thing which is bad for you. Allah knoweth, ye know not."
       },{
       "arabic":"﴿2 يَسۡــَٔلُوۡنَكَ عَنِ الشَّهۡرِ الۡحَـرَامِ قِتَالٍ فِيۡهِ‌ؕ قُلۡ قِتَالٌ فِيۡهِ كَبِيۡرٌ‌ؕ وَصَدٌّ عَنۡ سَبِيۡلِ اللّٰهِ وَ کُفۡرٌۢ بِهٖ وَالۡمَسۡجِدِ الۡحَـرَامِ وَاِخۡرَاجُ اَهۡلِهٖ مِنۡهُ اَكۡبَرُ عِنۡدَ اللّٰهِ‌‌ۚ وَالۡفِتۡنَةُ اَکۡبَرُ مِنَ الۡقَتۡلِ‌ؕ وَلَا يَزَالُوۡنَ يُقَاتِلُوۡنَكُمۡ حَتّٰى يَرُدُّوۡكُمۡ عَنۡ دِيۡنِکُمۡ اِنِ اسۡتَطَاعُوۡا‌ؕ وَمَنۡ يَّرۡتَدِدۡ مِنۡكُمۡ عَنۡ دِيۡنِهٖ فَيَمُتۡ وَهُوَ کَافِرٌ فَاُولٰٓٮِٕكَ حَبِطَتۡ اَعۡمَالُهُمۡ فِىۡ الدُّنۡيَا وَالۡاٰخِرَةِ‌‌ۚ وَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ‌‌ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ",
        "urdu":"(اے محمدﷺ) لوگ تم سے عزت والے مہینوں میں لڑائی کرنے کے بارے میں دریافت کرتے ہیں کہہ دو کہ ان میں لڑنا بڑا (گناہ) ہےاور خدا کی راہ سے روکنا اور اس سے کفر کرنا اور مسجد حرام (یعنی خانہ کعبہ میں جانے) سے (بند کرنا)۔ اور اہل مسجد کو اس میں سے نکال دینا (جو یہ کفار کرتے ہیں) خدا کے نزدیک اس سے بھی زیادہ (گناہ) ہے۔ اور فتنہ انگیزی خونریزی سے بھی بڑھ کر ہے۔ اور یہ لوگ ہمیشہ تم سے لڑتے رہیں گے یہاں تک کہ اگر مقدور رکھیں تو تم کو تمہارے دین سے پھیر دیں۔ اور جو کوئی تم میں سے اپنے دین سے پھر کر (کافر ہو) جائے گا اور کافر ہی مرے گا تو ایسے لوگوں کے اعمال دنیا اور آخرت دونوں میں برباد ہوجائیں گے اور یہی لوگ دوزخ (میں جانے) والے ہیں جس میں ہمیشہ رہیں گے",
       "english":"They question thee (O Muhammad) with regard to warfare in the sacred month. Say: Warfare therein is a great (transgression), but to turn (men) from the way of Allah, and to disbelieve in Him and in the Inviolable Place of Worship, and to expel His people thence, is a greater with Allah; for persecution is worse than killing. And they will not cease from fighting against you till they have made you renegades from your religion, if they can. And whoso becometh a renegade and dieth in his disbelief: such are they whose works have fallen both in the world and the Hereafter. Such are rightful owners of the Fire: they will abide therein."
       },{
       "arabic":"﴿2 اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَاجَرُوۡا وَجَاهَدُوۡا فِىۡ سَبِيۡلِ اللّٰهِۙ اُولٰٓٮِٕكَ يَرۡجُوۡنَ رَحۡمَتَ اللّٰهِؕ وَاللّٰهُ غَفُوۡرٌ رَّحِيۡمٌ",
        "urdu":"جو لوگ ایمان لائے اور خدا کے لئے وطن چھوڑ گئے اور (کفار سے) جنگ کرتے رہے وہی خدا کی رحمت کے امیدوار ہیں۔ اور خدا بخشنے والا (اور) رحمت کرنے والا ہے",
       "english":"Lo! those who believe, and those who emigrate (to escape the persecution) and strive in the way of Allah, these have hope of Allah's mercy. Allah is Forgiving, Merciful."
       },{
       "arabic":"﴿2 يَسۡـَٔـلُوۡنَكَ عَنِ الۡخَمۡرِ وَالۡمَيۡسِرِ‌ؕ قُلۡ فِيۡهِمَآ اِثۡمٌ کَبِيۡرٌ وَّمَنَافِعُ لِلنَّاسِ وَاِثۡمُهُمَآ اَکۡبَرُ مِنۡ نَّفۡعِهِمَاؕ وَيَسۡـَٔـلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَؕ قُلِ الۡعَفۡوَ‌ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّکُمۡ تَتَفَكَّرُوۡنَۙ",
        "urdu":"(اے پیغمبر) لوگ تم سے شراب اور جوئے کا حکم دریافت کرتے ہیں۔ کہہ دو کہ ان میں نقصان بڑے ہیں اور لوگوں کے لئے کچھ فائدے بھی ہیں مگر ان کے نقصان فائدوں سے کہیں زیادہ ہیں اور یہ بھی تم سے پوچھتے ہیں کہ (خدا کی راہ میں) کون سا مال خرچ کریں۔ کہہ دو کہ جو ضرورت سے زیادہ ہو۔ اس طرح خدا تمہارے لئے اپنے احکام کھول کھول کر بیان فرماتا ہے تاکہ تم سوچو",
       "english":"They question thee about strong drink and games of chance. Say: In both is great sin, and (some) utility for men; but the sin of them is greater than their usefulness. And they ask thee what they ought to spend. Say: that which is superfluous. Thus Allah maketh plain to you (His) revelations, that haply ye may reflect."
       },{
       "arabic":"﴿2 فِىۡ الدُّنۡيَا وَالۡاٰخِرَةِؕ وَيَسۡـَٔـلُوۡنَكَ عَنِ الۡيَتٰمٰىؕ قُلۡ اِصۡلَاحٌ لَّهُمۡ خَيۡرٌؕ وَّاِنۡ تُخَالِطُوۡهُمۡ فَاِخۡوَانُكُمۡ‌ؕ وَاللّٰهُ يَعۡلَمُ الۡمُفۡسِدَ مِنَ الۡمُصۡلِحِ‌ؕ وَلَوۡ شَآءَ اللّٰهُ لَاَعۡنَتَكُمۡؕ اِنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ",
        "urdu":"(یعنی) دنیا اور آخرت (کی باتوں) میں (غور کرو)۔ اور تم سے یتیموں کے بارے میں دریافت کرتے ہیں کہہ دو کہ ان کی (حالت کی) اصلاح بہت اچھا کام ہے۔ اور اگر تم ان سے مل جل کر رہنا (یعنی خرچ اکھٹا رکھنا) چاہو تو وہ تمہارے بھائی ہیں اور خدا خوب جانتا ہے کہ خرابی کرنے والا کون ہے اور اصلاح کرنے والا کون۔ اور اگر خدا چاہتا تو تم کو تکلیف میں ڈال دیتا۔بےشک خدا غالب (اور) حکمت والا ہے",
       "english":"Upon the world and the Hereafter. And they question thee concerning orphans. Say: To improve their lot is best. And if ye mingle your affairs with theirs, then (they are) your brothers. Allah knoweth him who spoileth from him who improveth. Had Allah willed He could have overburdened you. Allah is Mighty, Wise."
       },{
       "arabic":"﴿2 وَلَا تَنۡكِحُوۡا الۡمُشۡرِكٰتِ حَتّٰى يُؤۡمِنَّ‌ؕ وَلَاَمَةٌ مُّؤۡمِنَةٌ خَيۡرٌ مِّنۡ مُّشۡرِكَةٍ وَّلَوۡ اَعۡجَبَتۡكُمۡ‌ۚ وَلَا تُنۡكِحُوۡا الۡمُشۡرِكِيۡنَ حَتّٰى يُؤۡمِنُوۡا‌ؕ وَلَعَبۡدٌ مُّؤۡمِنٌ خَيۡرٌ مِّنۡ مُّشۡرِكٍ وَّلَوۡ اَعۡجَبَكُمۡ‌‌ۚ اُولٰٓٮِٕكَ يَدۡعُوۡنَ اِلَى النَّارِۖۚ وَاللّٰهُ يَدۡعُوۡٓا اِلَى الۡجَـنَّةِ وَالۡمَغۡفِرَةِ بِاِذۡنِهٖ‌ۚ وَيُبَيِّنُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَذَكَّرُوۡنَ",
        "urdu":"اور (مومنو) مشرک عورتوں سے جب تک کہ ایمان نہ لائیں نکاح نہ کرنا۔ کیونکہ مشرک عورت خواہ تم کو کیسی ہی بھلی لگے اس سے مومن لونڈی بہتر ہے۔ اور (اسی طرح) مشرک مرد جب تک ایمان نہ لائیں مومن عورتوں کو ان کو زوجیت میں نہ دینا کیونکہ مشرک (مرد) سے خواہ وہ تم کو کیسا ہی بھلا لگے مومن غلام بہتر ہے۔ یہ (مشرک لوگوں کو) دوزخ کی طرف بلاتے ہیں۔ اور خدا اپنی مہربانی سے بہشت اور بخشش کی طرف بلاتا ہے۔ اور اپنے حکم لوگوں سے کھول کھول کر بیان کرتا ہے تاکہ نصیحت حاصل کریں",
       "english":"Wed not idolatresses till they believe; for lo! a believing bondwoman is better than an idolatress though she please you; and give not your daughters in marriage to idolaters till they believe, for lo! a believing slave is better than an idolater though he please you. These invite unto the Fire, and Allah inviteth unto the Garden, and unto forgiveness by His grace, and expoundeth His revelations to mankind that haply they may remember."
       },{
       "arabic":"﴿2 وَ يَسۡـَٔـلُوۡنَكَ عَنِ الۡمَحِيۡضِ‌ۙ قُلۡ هُوَ اَذًى فَاعۡتَزِلُوۡا النِّسَآءَ فِىۡ الۡمَحِيۡضِ‌ۙ وَلَا تَقۡرَبُوۡهُنَّ حَتّٰى يَطۡهُرۡنَ‌‌ۚ فَاِذَا تَطَهَّرۡنَ فَاۡتُوۡهُنَّ مِنۡ حَيۡثُ اَمَرَكُمُ اللّٰهُ‌ؕ اِنَّ اللّٰهَ يُحِبُّ التَّوَّابِيۡنَ وَيُحِبُّ الۡمُتَطَهِّرِيۡنَ",
        "urdu":"اور تم سے حیض کے بارے میں دریافت کرتے ہیں۔ کہہ دو کہ وہ تو نجاست ہے۔ سو ایام حیض میں عورتوں سے کنارہ کش رہو۔ اور جب تک پاک نہ ہوجائیں ان سے مقاربت نہ کرو۔ ہاں جب پاک ہوجائیں تو جس طریق سے خدا نے ارشاد فرمایا ہے ان کے پاس جاؤ۔ کچھ شک نہیں کہ خدا توبہ کرنے والوں اور پاک صاف رہنے والوں کو دوست رکھتا ہے",
       "english":"They question thee (O Muhammad) concerning menstruation. Say: It is an illness, so let women alone at such times and go not in unto them till they are cleansed. And when they have purified themselves, then go in unto them as Allah hath enjoined upon you. Truly Allah loveth those who turn unto Him, and loveth those who have a care for cleanness."
       },{
       "arabic":"﴿2 نِسَآؤُكُمۡ حَرۡثٌ لَّـكُمۡ فَاۡتُوۡا حَرۡثَكُمۡ اَنّٰى شِئۡتُمۡ‌  وَقَدِّمُوۡا لِاَنۡفُسِكُمۡ‌ؕ وَاتَّقُوۡا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ مُّلٰقُوۡهُ‌ؕ وَ بَشِّرِ الۡمُؤۡمِنِيۡنَ",
        "urdu":"تمہاری عورتیں تمہارای کھیتی ہیں تو اپنی کھیتی میں جس طرح چاہو جاؤ۔ اور اپنے لئے (نیک عمل) آگے بھیجو۔ اور خدا سے ڈرتے رہو اور جان رکھو کہ (ایک دن) تمہیں اس کے روبرو حاضر ہونا ہے اور (اے پیغمبر) ایمان والوں کو بشارت سنا دو",
       "english":"Your women are a tilth for you (to cultivate) so go to your tilth as ye will, and send (good deeds) before you for your souls, and fear Allah, and know that ye will (one day) meet Him. Give glad tidings to believers, (O Muhammad)."
       },{
       "arabic":"﴿2 وَلَا تَجۡعَلُوۡا اللّٰهَ عُرۡضَةً لِّاَيۡمَانِکُمۡ اَنۡ تَبَرُّوۡا وَتَتَّقُوۡا وَتُصۡلِحُوۡا بَيۡنَ النَّاسِ‌ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ",
        "urdu":"اور خدا (کے نام کو) اس بات کا حیلہ نہ بنانا کہ (اس کی) قسمیں کھا کھا کر سلوک کرنے اورپرہیزگاری کرنے اور لوگوں میں صلح و سازگاری کرانے سے رک جاؤ۔ اور خدا سب کچھ سنتا اور جانتا ہے",
       "english":"And make not Allah, by your oaths, a hindrance to your being righteous and observing your duty unto Him and making peace among mankind. Allah is Hearer, Knower."
       },{
       "arabic":"﴿2 لَّا يُؤَاخِذُكُمُ اللّٰهُ بِاللَّغۡوِ فِىۡٓ اَيۡمَانِكُمۡ وَلٰـكِنۡ يُّؤَاخِذُكُمۡ بِمَا كَسَبَتۡ قُلُوۡبُكُمۡ‌ؕ وَاللّٰهُ غَفُوۡرٌ حَلِيۡمٌ",
        "urdu":"خدا تمہاری لغو قسموں پر تم سے مواخذہ نہ کرے گا۔ لیکن جو قسمیں تم قصد دلی سے کھاؤ گے ان پر مواخذہ کرے گا۔ اور خدا بخشنے والا بردبار ہے",
       "english":"Allah will not take you to task for that which is unintentional in your oaths. But He will take you to task for that which your hearts have garnered. Allah is Forgiving, Clement."
       },{
       "arabic":"﴿2 لِّـلَّذِيۡنَ يُؤۡلُوۡنَ مِنۡ نِّسَآٮِٕهِمۡ تَرَبُّصُ اَرۡبَعَةِ اَشۡهُرٍ‌‌ۚ فَاِنۡ فَآءُوۡ فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ",
        "urdu":"جو لوگ اپنی عورتوں کے پاس جانے سے قسم کھالیں ان کو چار مہینے تک انتظار کرنا چاہیئے۔ اگر (اس عرصے میں قسم سے) رجوع کرلیں تو خدا بخشنے والا مہربان ہے",
       "english":"Those who forswear their wives must wait four months; then, if they change their mind, lo! Allah is Forgiving, Merciful."
       },{
       "arabic":"﴿2 وَاِنۡ عَزَمُوۡا الطَّلَاقَ فَاِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ",
        "urdu":"اور اگر طلاق کا ارادہ کرلیں تو بھی خدا سنتا (اور) جانتا ہے",
       "english":"And if they decide upon divorce (let them remember that) Allah is Hearer, Knower."
       },{
       "arabic":"﴿2 وَالۡمُطَلَّقٰتُ يَتَرَبَّصۡنَ بِاَنۡفُسِهِنَّ ثَلٰثَةَ قُرُوۡٓءٍ‌ؕ وَلَا يَحِلُّ لَهُنَّ اَنۡ يَّكۡتُمۡنَ مَا خَلَقَ اللّٰهُ فِىۡٓ اَرۡحَامِهِنَّ اِنۡ كُنَّ يُؤۡمِنَّ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ‌ؕ وَبُعُوۡلَتُهُنَّ اَحَقُّ بِرَدِّهِنَّ فِىۡ ذٰلِكَ اِنۡ اَرَادُوۡٓا اِصۡلٰحًا‌ؕ وَلَهُنَّ مِثۡلُ الَّذِىۡ عَلَيۡهِنَّ بِالۡمَعۡرُوۡفِ‌ وَلِلرِّجَالِ عَلَيۡهِنَّ دَرَجَةٌ‌ؕ وَاللّٰهُ عَزِيۡزٌ حَكِيۡمٌ",
        "urdu":"اور طلاق والی عورتیں تین حیض تک اپنی تئیں روکے رہیں۔ اور اگر وہ خدا اور روز قیامت پر ایمان رکھتی ہیں تو ان کا جائز نہیں کہ خدا نے جو کچھ ان کے شکم میں پیدا کیا ہے اس کو چھپائیں۔ اور ان کے خاوند اگر پھر موافقت چاہیں تو اس (مدت) میں وہ ان کو اپنی زوجیت میں لے لینے کے زیادہ حقدار ہیں۔ اور عورتوں کا حق (مردوں پر) ویسا ہی ہے جیسے دستور کے مطابق (مردوں کا حق) عورتوں پر ہے۔ البتہ مردوں کو عورتوں پر فضیلت ہے۔ اور خدا غالب (اور) صاحب حکمت ہے",
       "english":"Women who are divorced shall wait, keeping themselves apart, three (monthly) courses. And it is not lawful for them that they should conceal that which Allah hath created in their wombs if they are believers in Allah and the Last Day. And their husbands would do better to take them back in that case if they desire a reconciliation. And they (women) have rights similar to those (of men) over them in kindness, and men are a degree above them. Allah is Mighty, Wise."
       },{
       "arabic":"﴿2 الطَّلَاقُ مَرَّتٰنِ‌ فَاِمۡسَاكٌۢ بِمَعۡرُوۡفٍ اَوۡ تَسۡرِيۡحٌۢ بِاِحۡسَانٍ‌ ؕوَلَا يَحِلُّ لَـکُمۡ اَنۡ تَاۡخُذُوۡا مِمَّآ اٰتَيۡتُمُوۡهُنَّ شَيۡـًٔـا اِلَّاۤ اَنۡ يَّخَافَآ اَلَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِ‌ؕ فَاِنۡ خِفۡتُمۡ اَلَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِۙ فَلَا جُنَاحَ عَلَيۡهِمَا فِيۡمَا افۡتَدَتۡ بِهٖؕ‌ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَعۡتَدُوۡهَا‌ۚ‌ وَمَنۡ يَّتَعَدَّ حُدُوۡدَ اللّٰهِ فَاُولٰٓٮِٕكَ هُمُ الظّٰلِمُوۡنَ",
        "urdu":"طلاق (صرف) دوبار ہے (یعنی جب دو دفعہ طلاق دے دی جائے تو) پھر (عورتوں کو) یا تو بطریق شائستہ (نکاح میں) رہنے دینا یا بھلائی کے ساتھ چھوڑ دینا۔ اور یہ جائز نہیں کہ جو مہر تم ان کو دے چکے ہو اس میں سے کچھ واپس لے لو۔ ہاں اگر زن و شوہر کو خوف ہو کہ وہ خدا کی حدوں کو قائم نہیں رکھ سکیں گے تو اگر عورت (خاوند کے ہاتھ سے) رہائی پانے کے بدلے میں کچھ دے ڈالے تو دونوں پر کچھ گناہ نہیں۔ یہ خدا کی (مقرر کی ہوئی) حدیں ہیں ان سے باہر نہ نکلنا۔ اور جو لوگ خدا کی حدوں سے باہر نکل جائیں گے وہ گنہگار ہوں گے",
       "english":"Divorce must be pronounced twice and then (a woman) must be retained in honour or released in kindness. And it is not lawful for you that ye take from women aught of that which ye have given them; except (in the case) when both fear that they may not be able to keep within the limits (imposed by) Allah. And if ye fear that they may not be able to keep the limits of Allah, in that case it is no sin for either of them if the woman ransom herself. These are the limits (imposed by) Allah. Transgress them not. For whoso transgresseth Allah's limits: such are wrong-doers."
       },{
       "arabic":"﴿2 فَاِنۡ طَلَّقَهَا فَلَا تَحِلُّ لَهٗ مِنۡۢ بَعۡدُ حَتّٰى تَنۡكِحَ زَوۡجًا غَيۡرَهٗ‌ؕ فَاِنۡ طَلَّقَهَا فَلَا جُنَاحَ عَلَيۡهِمَآ اَنۡ يَّتَرَاجَعَآ اِنۡ ظَنَّآ اَنۡ يُّقِيۡمَا حُدُوۡدَ اللّٰهِ‌ؕ وَتِلۡكَ حُدُوۡدُ اللّٰهِ يُبَيِّنُهَا لِقَوۡمٍ يَّعۡلَمُوۡنَ",
        "urdu":"پھر اگر شوہر (دو طلاقوں کے بعد تیسری) طلاق عورت کو دے دے تو اس کے بعد جب تک عورت کسی دوسرے شخص سے نکاح نہ کرلے اس (پہلے شوہر) پر حلال نہ ہوگی۔ ہاں اگر دوسرا خاوند بھی طلاق دے دے اورعورت اور پہلا خاوند پھر ایک دوسرے کی طرف رجوع کرلیں تو ان پر کچھ گناہ نہیں بشرطیکہ دونوں یقین کریں کہ خدا کی حدوں کو قائم رکھ سکیں گے اور یہ خدا کی حدیں ہیں ان کو وہ ان لوگوں کے لئے بیان فرماتا ہے جو دانش رکھتے ہیں",
       "english":"And if he hath divorced her (the third time), then she is not lawful unto him thereafter until she hath wedded another husband. Then if he (the other husband) divorce her it is no sin for both of them that they come together again if they consider that they are able to observe the limits of Allah. These are the limits of Allah. He manifesteth them for people who have knowledge."
       },{
       "arabic":"﴿2 وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَاَمۡسِكُوۡهُنَّ بِمَعۡرُوۡفٍ اَوۡ سَرِّحُوۡهُنَّ بِمَعۡرُوۡفٍ‌ وَّلَا تُمۡسِكُوۡهُنَّ ضِرَارًا لِّتَعۡتَدُوۡا‌ۚ وَمَنۡ يَّفۡعَلۡ ذٰلِكَ فَقَدۡ ظَلَمَ نَفۡسَهٗ‌ؕ وَلَا تَتَّخِذُوۡٓا اٰيٰتِ اللّٰهِ هُزُوًا‌ وَّاذۡكُرُوۡا نِعۡمَتَ اللّٰهِ عَلَيۡكُمۡ وَمَآ اَنۡزَلَ عَلَيۡكُمۡ مِّنَ الۡكِتٰبِ وَالۡحِكۡمَةِ يَعِظُكُمۡ بِهٖ‌ؕ وَاتَّقُوۡا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ",
        "urdu":"اور جب تم عورتوں کو (دو دفعہ) طلاق دے چکو اور ان کی عدت پوری ہوجائے تو انہیں یا تو حسن سلوک سے نکاح میں رہنے دو یا بطریق شائستہ رخصت کردو اور اس نیت سے ان کو نکاح میں نہ رہنے دینا چاہئے کہ انہیں تکلیف دو اور ان پر زیادتی کرو۔ اور جو ایسا کرے گا وہ اپنا ہی نقصان کرے گا اور خدا کے احکام کو ہنسی (اور کھیل) نہ بناؤ اور خدا نے تم کو جو نعمتیں بخشی ہیں اور تم پر جو کتاب اور دانائی کی باتیں نازل کی ہیں جن سے وہ تمہیں نصیحت فرماتا ہے ان کو یاد کرو۔ اور خدا سے ڈرتے رہو اور جان رکھوکہ خدا ہر چیز سے واقف ہے",
       "english":"When ye have divorced women, and they have reached their term, then retain them in kindness or release them in kindness. Retain them not to their hurt so that ye transgress (the limits). He who doeth that hath wronged his soul. Make not the revelations of Allah a laughing-stock (by your behaviour), but remember Allah's grace upon you and that which He hath revealed unto you of the Scripture and of wisdom, whereby He doth exhort you. Observe your duty to Allah and know that Allah is Aware of all things."
       },{
       "arabic":"﴿2 وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَلَا تَعۡضُلُوۡهُنَّ اَنۡ يَّنۡكِحۡنَ اَزۡوَاجَهُنَّ اِذَا تَرَضَوۡا بَيۡنَهُمۡ بِالۡمَعۡرُوۡفِ‌ؕ ذٰلِكَ يُوۡعَظُ بِهٖ مَنۡ كَانَ مِنۡكُمۡ يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِؕ ذٰلِكُمۡ اَزۡکٰى لَـكُمۡ وَاَطۡهَرُؕ‌ وَاللّٰهُ يَعۡلَمُ وَاَنۡتُمۡ لَا تَعۡلَمُوۡنَ",
        "urdu":"اور جب تم عورتوں کو طلاق دے چکو اور ان کی عدت پوری ہوجائے تو ان کو دوسرے شوہروں کے ساتھ جب وہ آپس میں جائز طور پر راضی ہوجائیں نکاح کرنے سے مت روکو۔ اس (حکم) سے اس شخص کو نصیحت کی جاتی ہے جو تم میں خدا اور روز آخرت پر یقین رکھتا ہے۔ یہ تمہارے لئے نہایت خوب اور بہت پاکیزگی کی بات ہے اور خدا جانتا ہے اور تم نہیں جانتے",
       "english":"And when ye have divorced women and they reach their term, place not difficulties in the way of their marrying their husbands if it is agreed between them in kindness. This is an admonition for him among you who believeth in Allah and the Last Day. That is more virtuous for you, and cleaner. Allah knoweth; ye know not."
        },{
       "arabic":"﴿2 وَالۡوَالِدٰتُ يُرۡضِعۡنَ اَوۡلَادَهُنَّ حَوۡلَيۡنِ كَامِلَيۡنِ‌ لِمَنۡ اَرَادَ اَنۡ يُّتِمَّ الرَّضَاعَةَ‌ؕ وَعَلَى الۡمَوۡلُوۡدِ لَهٗ رِزۡقُهُنَّ وَكِسۡوَتُهُنَّ بِالۡمَعۡرُوۡفِ‌ؕ لَا تُكَلَّفُ نَفۡسٌ اِلَّا وُسۡعَهَاۚ لَا تُضَآرَّ وَالِدَةٌۢ بِوَلَدِهَا وَلَا مَوۡلُوۡدٌ لَّهٗ بِوَلَدِهٖ وَعَلَى الۡوَارِثِ مِثۡلُ ذٰلِكَۚ فَاِنۡ اَرَادَا فِصَالاً عَنۡ تَرَاضٍ مِّنۡهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَيۡهِمَا‌ؕ وَاِنۡ اَرَدتُّمۡ اَنۡ تَسۡتَرۡضِعُوۡٓا اَوۡلَادَكُمۡ فَلَا جُنَاحَ عَلَيۡكُمۡ اِذَا سَلَّمۡتُمۡ مَّآ اٰتَيۡتُمۡ بِالۡمَعۡرُوۡفِ‌ؕ وَاتَّقُوۡا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ",
        "urdu":"اور مائیں اپنے بچوں کو پورے دو سال دودھ پلائیں یہ (حکم) اس شخص کے لئے ہے جو پوری مدت تک دودھ پلوانا چاہے۔ اور دودھ پلانے والی ماؤں کا کھانا اور کپڑا دستور کے مطابق باپ کے ذمے ہوگا۔ کسی شخص کو اس کی طاقت سے زیادہ تکلیف نہیں دی جاتی (تو یاد رکھو کہ) نہ تو ماں کو اس کے بچے کے سبب نقصان پہنچایا جائے اور نہ باپ کو اس کی اولاد کی وجہ سے نقصان پہنچایا جائے اور اسی طرح (نان نفقہ) بچے کے وارث کے ذمے ہے۔ اور اگر دونوں (یعنی ماں باپ) آپس کی رضامندی اور صلاح سے بچے کا دودھ چھڑانا چاہیں تو ان پر کچھ گناہ نہیں۔ اور اگر تم اپنی اولاد کو دودھ پلوانا چاہو تو تم پر کچھ گناہ نہیں بشرطیکہ تم دودھ پلانے والیوں کو دستور کے مطابق ان کا حق جو تم نے دینا کیا تھا دے دو اور خدا سے ڈرتے رہو اور جان رکھو کہ جو کچھ تم کرتے ہو خدا اس کو دیکھ رہا ہے",
       "english":"Mothers shall suckle their children for two whole years; (that is) for those who wish to complete the suckling. The duty of feeding and clothing nursing mothers in a seemly manner is upon the father of the child. No-one should be charged beyond his capacity. A mother should not be made to suffer because of her child, nor should he to whom the child is born (be made to suffer) because of his child. And on the (father's) heir is incumbent the like of that (which was incumbent on the father). If they desire to wean the child by mutual consent and (after) consultation, it is no sin for them; and if ye wish to give your children out to nurse, it is no sin for you, provide that ye pay what is due from you in kindness. Observe your duty to Allah, and know that Allah is Seer of what ye do."
       },{
       "arabic":"﴿2 وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡكُمۡ وَيَذَرُوۡنَ اَزۡوَاجًا يَّتَرَبَّصۡنَ بِاَنۡفُسِهِنَّ اَرۡبَعَةَ اَشۡهُرٍ وَّعَشۡرًا‌‌ۚ فَاِذَا بَلَغۡنَ اَجَلَهُنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ بِالۡمَعۡرُوۡفِؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ",
        "urdu":"اور جو لوگ تم میں سے مرجائیں اور عورتیں چھوڑ جائیں تو عورتیں چار مہینے دس دن اپنے آپ کو روکے رہیں۔ اور جب (یہ) عدت پوری کرچکیں اور اپنے حق میں پسندیدہ کام (یعنی نکاح) کرلیں تو ان پر کچھ گناہ نہیں۔ اور خدا تمہارے سب کاموں سے واقف ہے",
       "english":"Such of you as die and leave behind them wives, they (the wives) shall wait, keeping themselves apart, four months and ten days. And when they reach the term (prescribed for them) then there is no sin for you in aught that they may do with themselves in decency. Allah is informed of what ye do."
       },{
       "arabic":"﴿2 وَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا عَرَّضۡتُمۡ بِهٖ مِنۡ خِطۡبَةِ النِّسَآءِ اَوۡ اَکۡنَنۡتُمۡ فِىۡٓ اَنۡفُسِكُمۡ‌ؕ عَلِمَ اللّٰهُ اَنَّكُمۡ سَتَذۡكُرُوۡنَهُنَّ وَلٰـكِنۡ لَّا تُوَاعِدُوۡهُنَّ سِرًّا اِلَّاۤ اَنۡ تَقُوۡلُوۡا قَوۡلاً مَّعۡرُوۡفًا‌ؕ وَلَا تَعۡزِمُوۡا عُقۡدَةَ النِّکَاحِ حَتّٰى يَبۡلُغَ الۡكِتٰبُ اَجَلَهٗ‌ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ يَعۡلَمُ مَا فِىۡٓ اَنۡفُسِكُمۡ فَاحۡذَرُوۡهُ‌ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ غَفُوۡرٌ حَلِيۡمٌ",
        "urdu":"اور اگر تم کنائے کی باتوں میں عورتوں کو نکاح کا پیغام بھیجو یا (نکاح کی خواہش کو) اپنے دلوں میں مخفی رکھو تو تو تم پر کچھ گناہ نہیں۔ خدا کو معلوم ہے کہ تم ان سے (نکاح کا) ذکر کرو گے۔ مگر (ایام عدت میں) اس کے سوا کہ دستور کے مطابق کوئی بات کہہ دو پوشیدہ طور پر ان سے قول واقرار نہ کرنا۔ اور جب تک عدت پوری نہ ہولے نکاح کا پختہ ارادہ نہ کرنا۔ اور جان رکھو کہ جو کچھ تمہارے دلوں میں ہے خدا کو سب معلوم ہے تو اس سے ڈرتے رہو اور جان رکھو کہ خدا بخشنے والا اور حلم والا ہے",
       "english":"There is no sin for you in that which ye proclaim or hide in your minds concerning your troth with women. Allah knoweth that ye will remember them. But plight not your troth with women except by uttering a recognised form of words. And do not consummate the marriage until (the term) prescribed is run. Know that Allah knoweth what is in your minds, so beware of Him; and know that Allah is Forgiving, Clement."
       },{
       "arabic":"﴿2 لَا جُنَاحَ عَلَيۡكُمۡ اِنۡ طَلَّقۡتُمُ النِّسَآءَ مَا لَمۡ تَمَسُّوۡهُنَّ اَوۡ تَفۡرِضُوۡا لَهُنَّ فَرِيۡضَةًۖۚ وَّمَتِّعُوۡهُنَّ‌ۚ عَلَى الۡمُوۡسِعِ قَدَرُهٗ وَ عَلَى الۡمُقۡتِرِ قَدَرُهٗ‌ۚ مَتَاعًاۢ بِالۡمَعۡرُوۡفِ‌‌ۚ حَقًّا عَلَى الۡمُحۡسِنِيۡنَ",
        "urdu":"اور اگر تم عورتوں کو ان کے پاس جانے یا ان کا مہر مقرر کرنے سے پہلے طلاق دے دو تو تم پر کچھ گناہ نہیں۔ ہاں ان کو دستور کے مطابق کچھ خرچ ضرور دو (یعنی) مقدور والا اپنے مقدور کے مطابق دے اور تنگدست اپنی حیثیت کے مطابق۔ نیک لوگوں پر یہ ایک طرح کا حق ہے",
       "english":"It is no sin for you if ye divorce women while yet ye have not touched them, nor appointed unto them a portion. Provide for them, the rich according to his means, and the straitened according to his means, a fair provision. (This is) a bounden duty for those who do good."
       },{
       "arabic":"﴿2 وَاِنۡ طَلَّقۡتُمُوۡهُنَّ مِنۡ قَبۡلِ اَنۡ تَمَسُّوۡهُنَّ وَقَدۡ فَرَضۡتُمۡ لَهُنَّ فَرِيۡضَةً فَنِصۡفُ مَا فَرَضۡتُمۡ اِلَّاۤ اَنۡ يَّعۡفُوۡنَ اَوۡ يَعۡفُوَا الَّذِىۡ بِيَدِهٖ عُقۡدَةُ النِّكَاحِ‌ؕ وَاَنۡ تَعۡفُوۡٓا اَقۡرَبُ لِلتَّقۡوٰى‌ؕ وَ لَا تَنۡسَوُا الۡفَضۡلَ بَيۡنَكُمۡ‌ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ",
        "urdu":"اور اگر تم عورتوں کو ان کے پاس جانے سے پہلے طلاق دے دو لیکن مہر مقرر کرچکے ہو تو آدھا مہر دینا ہوگا۔ ہاں اگر عورتیں مہر بخش دیں یا مرد جن کے ہاتھ میں عقد نکاح ہے (اپنا حق) چھوڑ دیں۔ (اور پورا مہر دے دیں تو ان کو اختیار ہے) اور اگر تم مرد لوگ ہ اپنا حق چھوڑ دو تو یہ پرہیزگاری کی بات ہے۔ اور آپس میں بھلائی کرنے کو فراموش نہ کرنا۔ کچھ شک نہیں کہ خدا تمہارے سب کاموں کو دیکھ رہا ہے",
       "english":"If ye divorce them before ye have touched them and ye have appointed unto them a portion, then (pay the) half of that which ye appointed, unless they (the women) agree to forgo it, or he agreeth to forgo it in whose hand is the marriage tie. To forgo is nearer to piety. And forget not kindness among yourselves. Allah is Seer of what ye do."
       },{
       "arabic":"﴿2 حَافِظُوۡا عَلَى الصَّلَوٰتِ وَالصَّلٰوةِ الۡوُسۡطٰى وَقُوۡمُوۡا لِلّٰهِ قٰنِتِيۡنَ",
        "urdu":"(مسلمانو) سب نمازیں خصوصاً بیچ کی نماز (یعنی نماز عصر) پورے التزام کے ساتھ ادا کرتے رہو۔ اور خدا کے آگے ادب سے کھڑے رہا کرو",
       "english":"Be guardians of your prayers, and of the midmost prayer, and stand up with devotion to Allah."
       },{
       "arabic":"﴿2 فَاِنۡ خِفۡتُمۡ فَرِجَالاً اَوۡ رُكۡبَانًا‌‌ۚ فَاِذَآ اَمِنۡتُمۡ فَاذۡکُرُوۡا اللّٰهَ کَمَا عَلَّمَکُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَ",
        "urdu":"اگر تم خوف کی حالت میں ہو تو پیادے یا سوار (جس حال میں ہو نماز پڑھ لو) پھر جب امن (واطمینان) ہوجائے تو جس طریق سے خدا نے تم کو سکھایا ہے جو تم پہلے نہیں جانتے تھے خدا کو یاد کرو",
       "english":"And if ye go in fear, then (pray) standing or on horseback. And when ye are again in safety, remember Allah, as He hath taught you that which (heretofore) ye knew not."
       },{
       "arabic":"﴿2 وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡکُمۡ وَيَذَرُوۡنَ اَزۡوَاجًاۖۚ وَّصِيَّةً لِّاَزۡوَاجِهِمۡ مَّتَاعًا اِلَى الۡحَـوۡلِ غَيۡرَ اِخۡرَاجٍ‌‌ۚ فَاِنۡ خَرَجۡنَ فَلَا جُنَاحَ عَلَيۡکُمۡ فِىۡ مَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ مِنۡ مَّعۡرُوۡفٍؕ وَاللّٰهُ عَزِيۡزٌ حَکِيۡمٌ",
        "urdu":"اور جو لوگ تم میں سے مرجائیں اور عورتیں چھوڑ جائیں وہ اپنی عورتوں کے حق میں وصیت کرجائیں کہ ان کو ایک سال تک خرچ دیا جائے اور گھر سے نہ نکالی جائیں۔ ہاں اگر وہ خود گھر سے نکل جائیں اور اپنے حق میں پسندیدہ کام (یعنی نکاح) کرلیں تو تم پر کچھ گناہ نہیں۔ اور خدا زبردست حکمت والا ہے",
       "english":"(In the case of) those of you who are about to die and leave behind them wives, they should bequeath unto their wives a provision for the year without turning them out, but if they go out (of their own accord) there is no sin for you in that which they do of themselves within their rights. Allah is Mighty, Wise."
       },{
       "arabic":"﴿2 وَلِلۡمُطَلَّقٰتِ مَتَاعٌۢ بِالۡمَعۡرُوۡفِ‌ؕ حَقًّا عَلَى الۡمُتَّقِيۡنَ",
        "urdu":"اور مطلقہ عورتوں کو بھی دستور کے مطابق نان و نفقہ دینا چاہیئے پرہیزگاروں پر (یہ بھی) حق ہے",
       "english":"For divorced women a provision in kindness: a duty for those who ward off (evil)."
       },{
       "arabic":"﴿2 كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ",
        "urdu":"اسی طرح خدا اپنے احکام تمہارے لئے بیان فرماتا ہے تاکہ تم سمجھو",
       "english":"Thus Allah expoundeth unto you His revelations so that ye may understand."
       },{
       "arabic":"﴿2 اَلَمۡ تَرَ اِلَى الَّذِيۡنَ خَرَجُوۡا مِنۡ دِيَارِهِمۡ وَهُمۡ اُلُوۡفٌ حَذَرَ الۡمَوۡتِ فَقَالَ لَهُمُ اللّٰهُ مُوۡتُوۡا ثُمَّ اَحۡيَاھُمۡ‌ؕ اِنَّ اللّٰهَ لَذُوۡ فَضۡلٍ عَلَى النَّاسِ وَلٰـكِنَّ اَکۡثَرَ النَّاسِ لَا يَشۡکُرُوۡنَ",
        "urdu":"بھلا تم نے ان لوگوں کو نہیں دیکھا جو (شمار میں) ہزاروں ہی تھے اور موت کے ڈر سے اپنے گھروں سے نکل بھاگے تھے۔ تو خدا نے ان کو حکم دیا کہ مرجاؤ۔ پھر ان کو زندہ بھی کردیا۔ کچھ شک نہیں کہ خدا لوگوں پر مہربانی رکھتا ہے۔ لیکن اکثر لوگ شکر نہیں کرتے",
       "english":"Bethink thee (O Muhammad) of those of old, who went forth from their habitations in their thousands, fearing death, and Allah said unto them: Die; and then He brought them back to life. Lo! Allah is a Lord of Kindness to mankind, but most of mankind give not thanks."
       },{
       "arabic":"﴿2 وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ",
        "urdu":"اور (مسلمانو) خدا کی راہ میں جہاد کرو اور جان رکھو کہ خدا (سب کچھ) جانتا ہے",
       "english":"Fight in the way of Allah, and know that Allah is Hearer, Knower."
       },{
       "arabic":"﴿2 مَنۡ ذَا الَّذِىۡ يُقۡرِضُ اللّٰهَ قَرۡضًا حَسَنًا فَيُضٰعِفَهٗ لَهٗۤ اَضۡعَافًا کَثِيۡرَةً‌ؕ وَاللّٰهُ يَقۡبِضُ وَيَبۡصُۜطُ وَ اِلَيۡهِ تُرۡجَعُوۡنَ",
        "urdu":"کوئی ہے کہ خدا کو قرض حسنہ دے کہ وہ اس کے بدلے اس کو کئی حصے زیادہ دے گا۔ اور خدا ہی روزی کو تنگ کرتا اور (وہی اسے) کشادہ کرتا ہے۔ اور تم اسی کی طرف لوٹ کر جاؤ گے",
       "english":"Who is it that will lend unto Allah a goodly loan, so that He may give it increase manifold? Allah straiteneth and enlargeth. Unto Him ye will return."
       },{
       "arabic":"﴿2 اَلَمۡ تَرَ اِلَى الۡمَلَاِ مِنۡۢ بَنِىۡٓ اِسۡرَآءِيۡلَ مِنۡۢ بَعۡدِ مُوۡسٰى‌ۘ اِذۡ قَالُوۡا لِنَبِىٍّ لَّهُمُ ابۡعَثۡ لَنَا مَلِکًا نُّقَاتِلۡ فِىۡ سَبِيۡلِ اللّٰهِ‌ؕ قَالَ هَلۡ عَسَيۡتُمۡ اِنۡ کُتِبَ عَلَيۡکُمُ الۡقِتَالُ اَلَّا تُقَاتِلُوۡاؕ قَالُوۡا وَمَا لَنَآ اَلَّا نُقَاتِلَ فِىۡ سَبِيۡلِ اللّٰهِ وَقَدۡ اُخۡرِجۡنَا مِنۡ دِيَارِنَا وَاَبۡنَآٮِٕنَا‌ؕ فَلَمَّا کُتِبَ عَلَيۡهِمُ الۡقِتَالُ تَوَلَّوۡا اِلَّا قَلِيۡلًا مِّنۡهُمۡ‌ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ",
        "urdu":"بھلا تم نے بنی اسرائیل کی ایک جماعت کو نہیں دیکھا جس نے موسیٰ کے بعد اپنے پیغمبر سے کہا کہ آپ ہمارے لئے ایک بادشاہ مقرر کردیں تاکہ ہم خدا کی راہ میں جہاد کریں۔ پیغمبر نے کہا کہ اگر تم کو جہاد کا حکم دیا جائے تو عجب نہیں کہ لڑنے سے پہلو تہی کرو۔ وہ کہنے لگے کہ ہم راہ خدا میں کیوں نہ لڑیں گے جب کہ ہم وطن سے (خارج) اور بال بچوں سے جدا کردیئے گئے۔ لیکن جب ان کو جہاد کا حکم دیا گیا تو چند اشخاص کے سوا سب پھر گئے۔ اور خدا ظالموں سے خوب واقف ہے",
       "english":"Bethink thee of the leaders of the Children of Israel after Moses, how they said unto a prophet whom they had: Set up for us a king and we will fight in Allah's way. He said: Would ye then refrain from fighting if fighting were prescribed for you? They said: Why should we not fight in Allah's way when we have been driven from our dwellings with our children? Yet, when fighting was prescribed for them, they turned away, all save a few of them. Allah is aware of evil-doers."
       },{
       "arabic":"﴿2 وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اللّٰهَ قَدۡ بَعَثَ لَـکُمۡ طَالُوۡتَ مَلِكًا‌ؕ قَالُوۡٓا اَنّٰى يَكُوۡنُ لَهُ الۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ اَحَقُّ بِالۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةً مِّنَ الۡمَالِ‌ؕ قَالَ اِنَّ اللّٰهَ اصۡطَفٰٮهُ عَلَيۡکُمۡ وَزَادَهٗ بَسۡطَةً فِىۡ الۡعِلۡمِ وَ الۡجِسۡمِ‌ؕ وَاللّٰهُ يُؤۡتِىۡ مُلۡکَهٗ مَنۡ يَّشَآءُ‌ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ",
        "urdu":"اور پیغمبر نے ان سے (یہ بھی) کہا کہ خدا نے تم پر طالوت کو بادشاہ مقرر فرمایا ہے۔ وہ بولے کہ اسے ہم پر بادشاہی کا حق کیونکر ہوسکتا ہےبادشاہی کے مستحق تو ہم ہیں اور اس کے پاس تو بہت سی دولت بھی نہیں۔ پیغمبر نے کہا کہ خدا نےاس کو تم پر فضیلت دی ہے اور (بادشاہی کے لئے) منتخب فرمایا ہے اس نے اسے علم بھی بہت سا بخشا ہے اور تن و توش بھی (بڑا عطا کیا ہے) اور خدا (کو اختیار ہے) جسے چاہے بادشاہی بخشے۔ وہ بڑا کشائش والا اور دانا ہے",
       "english":"Their Prophet said unto them: Lo! Allah hath raised up Saul to be a king for you. They said: How can he have kingdom over us when we are more deserving of the kingdom than he is, since he hath not been given wealth enough? He said: Lo! Allah hath chosen him above you, and hath increased him abundantly in wisdom and stature. Allah bestoweth His Sovereignty on whom He will. Allah is All-Embracing, All-Knowing."
       },{
       "arabic":"﴿2 وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اٰيَةَ مُلۡکِهٖۤ اَنۡ يَّاۡتِيَکُمُ التَّابُوۡتُ فِيۡهِ سَکِيۡنَةٌ مِّنۡ رَّبِّکُمۡ وَبَقِيَّةٌ مِّمَّا تَرَكَ اٰلُ مُوۡسٰى وَاٰلُ هٰرُوۡنَ تَحۡمِلُهُ الۡمَلٰٓٮِٕكَةُ‌ؕ اِنَّ فِىۡ ذٰلِكَ لَاٰيَةً لَّـکُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ",
        "urdu":"اور پیغمبر نے ان سے کہا کہ ان کی بادشاہی کی نشانی یہ ہے کہ تمہارے پاس ایک صندوق آئے گا جس کو فرشتے اٹھائے ہوئے ہوں گے اس میں تمہارے پروردگار کی طرف سے تسلی (بخشنے والی چیز) ہوگی اور کچھ اور چیزیں بھی ہوں گی جو موسیٰ اور ہارون چھوڑ گئے تھے۔ اگر تم ایمان رکھتے ہو تو یہ تمہارے لئے ایک بڑی نشانی ہے",
       "english":"And their Prophet said unto them: Lo! the token of his kingdom is that there shall come unto you the ark wherein is peace of reassurance from your Lord, and a remnant of that which the house of Moses and the house of Aaron left behind, the angels bearing it. Lo! herein shall be a token for you if (in truth) ye are believers."
       },{
       "arabic":"﴿2 فَلَمَّا فَصَلَ طَالُوۡتُ بِالۡجُـنُوۡدِۙ قَالَ اِنَّ اللّٰهَ مُبۡتَلِيۡکُمۡ بِنَهَرٍ‌ۚ فَمَنۡ شَرِبَ مِنۡهُ فَلَيۡسَ مِنِّىۡ‌ۚ وَمَنۡ لَّمۡ يَطۡعَمۡهُ فَاِنَّهٗ مِنِّىۡٓ اِلَّا مَنِ اغۡتَرَفَ غُرۡفَةًۢ بِيَدِهٖ‌‌ۚ فَشَرِبُوۡا مِنۡهُ اِلَّا قَلِيۡلاً مِّنۡهُمۡ‌ؕ فَلَمَّا جَاوَزَهٗ هُوَ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗۙ قَالُوۡا لَا طَاقَةَ لَنَا الۡيَوۡمَ بِجَالُوۡتَ وَجُنُوۡدِهٖ‌ؕ قَالَ الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوۡا اللّٰهِۙ کَمۡ مِّنۡ فِئَةٍ قَلِيۡلَةٍ غَلَبَتۡ فِئَةً کَثِيۡرَةًۢ بِاِذۡنِ اللّٰهِ‌ؕ وَاللّٰهُ مَعَ الصّٰبِرِيۡنَ",
        "urdu":"غرض جب طالوت فوجیں لے کر روانہ ہوا تو اس نے (ان سے) کہا کہ خدا ایک نہر سے تمہاری آزمائش کرنے والا ہے۔ جو شخص اس میں سے پانی پی لے گا (اس کی نسبت تصور کیا جائے گا کہ) وہ میرا نہیں۔ اور جو نہ پئے گا وہ (سمجھا جائے گا کہ) میرا ہے۔ ہاں اگر کوئی ہاتھ سے چلو بھر پانی پی لے (تو خیر۔ جب وہ لوگ نہر پر پہنچے) تو چند شخصوں کے سوا سب نے پانی پی لیا۔ پھر جب طالوت اور مومن لوگ جو اس کے ساتھ تھے نہر کے پار ہوگئے۔ تو کہنے لگے کہ آج ہم میں جالوت اور اس کے لشکر سے مقابلہ کرنے کی طاقت نہیں۔ جو لوگ یقین رکھتے تھے کہ ان کو خدا کے روبرو حاضر ہونا ہے وہ کہنے لگے کہ بسااوقات تھوڑی سی جماعت نے خدا کے حکم سے بڑی جماعت پر فتح حاصل کی ہے اور خدا استقلال رکھنے والوں کے ساتھ ہے",
       "english":"And when Saul set out with the army, he said: Lo! Allah will try you by (the ordeal of) a river. Whosoever therefore drinketh thereof he is not of me, and whosoever tasteth it not he is of me, save him who taketh (thereof) in the hollow of his hand. But they drank thereof, all save a few of them. And after he had crossed (the river), he and those who believed with him, they said: We have no power this day against Goliath and his hosts. But those who knew that they would meet Allah exclaimed: How many a little company hath overcome a mighty host by Allah's leave! Allah is with the steadfast."
       },{
       "arabic":"﴿2 وَلَمَّا بَرَزُوۡا لِجَـالُوۡتَ وَجُنُوۡدِهٖ قَالُوۡا رَبَّنَآ اَفۡرِغۡ عَلَيۡنَا صَبۡرًا وَّثَبِّتۡ اَقۡدَامَنَا وَانصُرۡنَا عَلَى الۡقَوۡمِ الۡکٰفِرِيۡنَؕ",
        "urdu":"اور جب وہ لوگ جالوت اور اس کے لشکر کے مقابل آئے تو (خدا سے) دعا کی کہ اے پروردگار ہم پر صبر کے دہانے کھول دے اور ہمیں (لڑائی میں) ثابت قدم رکھ اور (لشکر) کفار پر فتحیاب کر",
       "english":"And when they went into the field against Goliath and his hosts they said: Our Lord! Bestow on us endurance, make our foothold sure, and give us help against the disbelieving folk."
       },{
       "arabic":"﴿2 فَهَزَمُوۡهُمۡ بِاِذۡنِ اللّٰهِۙ وَقَتَلَ دَاوٗدُ جَالُوۡتَ وَاٰتٰٮهُ اللّٰهُ الۡمُلۡكَ وَالۡحِکۡمَةَ وَعَلَّمَهٗ مِمَّا يَشَآءُ‌ؕ وَلَوۡلَا دَفۡعُ اللّٰهِ النَّاسَ بَعۡضَهُمۡ بِبَعۡضٍ لَّفَسَدَتِ الۡاَرۡضُ وَلٰـکِنَّ اللّٰهَ ذُوۡ فَضۡلٍ عَلَى الۡعٰلَمِيۡنَ",
        "urdu":"تو طالوت کی فوج نے خدا کے حکم سے ان کو ہزیمت دی۔ اور داؤد نے جالوت کو قتل کر ڈالا۔ اور خدا نے اس کو بادشاہی اور دانائی بخشی اور جو کچھ چاہا سکھایا۔ اور خدا لوگوں کو ایک دوسرے (پر چڑھائی اور حملہ کرنے) سے ہٹاتا نہ رہتا تو ملک تباہ ہوجاتا لیکن خدا اہل عالم پر بڑا مہربان ہے",
       "english":"So they routed them by Allah's leave and David slew Goliath; and Allah gave him the kingdom and wisdom, and taught him of that which He willeth. And if Allah had not repelled some men by others the earth would have been corrupted. But Allah is a Lord of Kindness to (His) creatures."
       },{
       "arabic":"﴿2 تِلۡكَ اٰيٰتُ اللّٰهِ نَـتۡلُوۡهَا عَلَيۡكَ بِالۡحَـقِّ‌ؕ وَاِنَّكَ لَمِنَ الۡمُرۡسَلِيۡنَ",
        "urdu":"یہ خدا کی آیتیں ہیں جو ہم تم کو سچائی کے ساتھ پڑھ کر سناتے ہیں (اور اے محمدﷺ) تم بلاشبہ پیغمبروں میں سے ہو",
       "english":"These are the portents of Allah which We recite unto thee (Muhammad) with truth, and lo! thou art of the number of (Our) messengers;"
       },{
       "arabic":"﴿2 تِلۡكَ الرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلٰى بَعۡضٍ‌ۘ مِنۡهُمۡ مَّنۡ كَلَّمَ اللّٰهُ‌ وَرَفَعَ بَعۡضَهُمۡ دَرَجٰتٍ‌ؕ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ‌ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلَ الَّذِيۡنَ مِنۡۢ بَعۡدِهِمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ وَلٰـكِنِ اخۡتَلَفُوۡا فَمِنۡهُمۡ مَّنۡ اٰمَنَ وَمِنۡهُمۡ مَّنۡ كَفَرَ‌ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلُوۡا وَلٰـكِنَّ اللّٰهَ يَفۡعَلُ مَا يُرِيۡدُ",
        "urdu":"یہ پیغمبر (جو ہم وقتاً فوقتاً بھیجتے رہیں ہیں) ان میں سے ہم نے بعض کو بعض پر فضیلت دی ہے۔ بعض ایسے ہیں جن سے خدا نے گفتگو فرمائی اور بعض کے (دوسرے امور میں) مرتبے بلند کئے۔ اور عیسیٰ بن مریم کو ہم نے کھلی ہوئی نشانیاں عطا کیں اور روح القدس سے ان کو مدد دی۔ اور اگر خداچاہتا تو ان سے پچھلے لوگ اپنے پاس کھلی نشانیاں آنے کے بعد آپس میں نہ لڑتے لیکن انہوں نے اختلاف کیا تو ان میں سے بعض تو ایمان لے آئے اور بعض کافر ہی رہے۔ اور اگر خدا چاہتا تو یہ لوگ باہم جنگ و قتال نہ کرتے۔ لیکن خدا جو چاہتا ہے کرتا ہے",
       "english":"Of those messengers, some of whom We have caused to excel others, and of whom there are some unto whom Allah spake, while some of them He exalted (above others) in degree; and We gave Jesus, son of Mary, clear proofs (of Allah's Sovereignty) and We supported him with the holy Spirit. And if Allah had so wiled it, those who followed after them would not have fought one with another after the clear proofs had come unto them. But they differed, some of them believing and some disbelieving. And if Allah had so willed it, they would not have fought one with another; but Allah doeth what He will."
       },{
       "arabic":"﴿2 يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِمَّا رَزَقۡنٰكُمۡ مِّنۡ قَبۡلِ اَنۡ يَّاۡتِىَ يَوۡمٌ لَّا بَيۡعٌ فِيۡهِ وَلَا خُلَّةٌ وَّلَا شَفَاعَةٌ‌ؕ وَالۡكٰفِرُوۡنَ هُمُ الظّٰلِمُوۡنَ",
        "urdu":"اے ایمان والو جو (مال) ہم نے تم کو دیا ہے اس میں سے اس دن کے آنے سے پہلے پہلے خرچ کرلو جس میں نہ (اعمال کا) سودا ہو اور نہ دوستی اور سفارش ہو سکے اور کفر کرنے والے لوگ ظالم ہیں",
       "english":"O ye who believe! spend of that wherewith We have provided you ere a day come when there will be no trafficking, nor friendship, nor intercession. The disbelievers, they are the wrong-doers."
       },{
       "arabic":"﴿2 اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَـىُّ الۡقَيُّوۡمُۚ  لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ‌ؕ لَهٗ مَا فِىۡ السَّمٰوٰتِ وَمَا فِىۡ الۡاَرۡضِ‌ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ‌ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ‌ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ‌‌ۚ وَلَا يَـٔـُوۡدُهٗ حِفۡظُهُمَا ‌ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ",
        "urdu":"خدا (وہ معبود برحق ہے کہ) اس کے سوا کوئی عبادت کے لائق نہیں زندہ ہمیشہ رہنے والا اسے نہ اونگھ آتی ہے نہ نیند جو کچھ آسمانوں میں اور جو کچھ زمین میں ہیں سب اسی کا ہے کون ہے جو اس کی اجازت کے بغیر اس سے (کسی کی) سفارش کر سکے جو کچھ لوگوں کے روبرو ہو رہا ہے اور جو کچھ ان کے پیچھے ہوچکا ہے اسے سب معلوم ہے اور وہ اس کی معلومات میں سے کسی چیز پر دسترس حاصل نہیں کر سکتے ہاں جس قدر وہ چاہتا ہے (اسی قدر معلوم کرا دیتا ہے) اس کی بادشاہی (اور علم) آسمان اور زمین سب پر حاوی ہے اور اسے ان کی حفاظت کچھ بھی دشوار نہیں وہ بڑا عالی رتبہ اور جلیل القدر ہے",
       "english":"Allah! There is no deity save Him, the Alive, the Eternal. Neither slumber nor sleep overtaketh Him. Unto Him belongeth whatsoever is in the heavens and whatsoever is in the earth. Who is he that intercedeth with Him save by His leave? He knoweth that which is in front of them and that which is behind them, while they encompass nothing of His knowledge save what He will. His throne includeth the heavens and the earth, and He is never weary of preserving them. He is the Sublime, the Tremendous."
        },{
       "arabic":"﴿2 لَاۤ اِكۡرَاهَ فِىۡ الدِّيۡنِ‌ۙ قَد تَّبَيَّنَ الرُّشۡدُ مِنَ الۡغَىِّ‌ۚ فَمَنۡ يَّكۡفُرۡ بِالطَّاغُوۡتِ وَيُؤۡمِنۡۢ بِاللّٰهِ فَقَدِ اسۡتَمۡسَكَ بِالۡعُرۡوَةِ الۡوُثۡقٰى لَا انْفِصَامَ لَهَا‌‌ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ",
        "urdu":"دین (اسلام) میں زبردستی نہیں ہے ہدایت (صاف طور پر ظاہر اور) گمراہی سے الگ ہو چکی ہے تو جو شخص بتوں سے اعتقاد نہ رکھے اور خدا پر ایمان لائے اس نے ایسی مضبوط رسی ہاتھ میں پکڑ لی ہے جو کبھی ٹوٹنے والی نہیں اور خدا (سب کچھ) سنتا اور (سب کچھ) جانتا ہے",
       "english":"There is no compulsion in religion. The right direction is henceforth distinct from error. And he who rejecteth false deities and believeth in Allah hath grasped a firm handhold which will never break. Allah is Hearer, Knower."
       },{
       "arabic":"﴿2 اَللّٰهُ وَلِىُّ الَّذِيۡنَ اٰمَنُوۡا يُخۡرِجُهُمۡ مِّنَ الظُّلُمٰتِ اِلَى النُّوۡرِ‌ؕ وَالَّذِيۡنَ كَفَرُوۡۤا اَوۡلِيٰٓــُٔهُمُ الطَّاغُوۡتُ يُخۡرِجُوۡنَهُمۡ مِّنَ النُّوۡرِ اِلَى الظُّلُمٰتِ‌ؕ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ‌‌ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ ",
        "urdu":"جو لوگ ایمان لائے ہیں ان کا دوست خدا ہے کہ اُن کو اندھیرے سے نکال کر روشنی میں لے جاتا ہے اور جو کافر ہیں ان کے دوست شیطان ہیں کہ ان کو روشنی سے نکال کر اندھیرے میں لے جاتے ہیں یہی لوگ اہل دوزخ ہیں کہ اس میں ہمیشہ رہیں گے",
       "english":"Allah is the Protecting Guardian of those who believe. He bringeth them out of darkness into light. As for those who disbelieve, their patrons are false deities. They bring them out of light into darkness. Such are rightful owners of the Fire. They will abide therein."
       },{
       "arabic":"﴿2 اَلَمۡ تَرَ اِلَى الَّذِىۡ حَآجَّ اِبۡرٰهٖمَ فِىۡ رَبِّهٖۤ اَنۡ اٰتٰٮهُ اللّٰهُ الۡمُلۡكَ‌ۘ اِذۡ قَالَ اِبۡرٰهٖمُ رَبِّىَ الَّذِىۡ يُحۡىٖ وَيُمِيۡتُۙ قَالَ اَنَا اُحۡىٖ وَاُمِيۡتُ‌ؕ قَالَ اِبۡرٰهٖمُ فَاِنَّ اللّٰهَ يَاۡتِىۡ بِالشَّمۡسِ مِنَ الۡمَشۡرِقِ فَاۡتِ بِهَا مِنَ الۡمَغۡرِبِ فَبُهِتَ الَّذِىۡ كَفَرَ‌ؕ وَاللّٰهُ لَا يَهۡدِىۡ الۡقَوۡمَ الظّٰلِمِيۡنَ‌ۚ",
        "urdu":"بھلا تم نے اس شخص کو نہیں دیکھا جو اس (غرور کے) سبب سے کہ خدا نے اس کو سلطنت بخشی تھی ابراہیم سے پروردگار کے بارے میں جھگڑنے لگا۔ جب ابراہیم نے کہا میرا پروردگار تو وہ ہے جو جلاتا اور مارتا ہے۔ وہ بولا کہ جلا اور مار تو میں بھی سکتا ہوں۔ ابراہیم نے کہا کہ خدا تو سورج کو مشرق سے نکالتا ہے آپ اسے مغرب سے نکال دیجیئے (یہ سن کر) کافر حیران رہ گیا اور خدا بےانصافوں کو ہدایت نہیں دیا کرتا",
       "english":"Bethink thee of him who had an argument with Abraham about his Lord, because Allah had given him the kingdom; how, when Abraham said: My Lord is He Who giveth life and causeth death, he answered: I give life and cause death. Abraham said: Lo! Allah causeth the sun to rise in the East, so do thou cause it to come up from the West. Thus was the disbeliever abashed. And Allah guideth not wrongdoing folk."
       },{
       "arabic":"﴿2 اَوۡ كَالَّذِىۡ مَرَّ عَلٰى قَرۡيَةٍ وَّ هِىَ خَاوِيَةٌ عَلٰى عُرُوۡشِهَا‌ۚ قَالَ اَنّٰى يُحۡىٖ هٰذِهِ اللّٰهُ بَعۡدَ مَوۡتِهَا‌ۚ فَاَمَاتَهُ اللّٰهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهٗ‌ؕ قَالَ كَمۡ لَبِثۡتَ‌ؕ قَالَ لَبِثۡتُ يَوۡمًا اَوۡ بَعۡضَ يَوۡمٍ‌ؕ قَالَ بَل لَّبِثۡتَ مِائَةَ عَامٍ فَانظُرۡ اِلٰى طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡ‌ۚ وَانْظُرۡ اِلٰى حِمَارِكَ وَلِنَجۡعَلَكَ اٰيَةً لِّلنَّاسِ‌ وَانْظُرۡ اِلَى الۡعِظَامِ كَيۡفَ نُـنۡشِزُهَا ثُمَّ نَكۡسُوۡهَا لَحۡمًا‌ؕ فَلَمَّا تَبَيَّنَ لَهٗۙ قَالَ اَعۡلَمُ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ",
        "urdu":"یا اسی طرح اس شخص کو (نہیں دیکھا) جسے ایک گاؤں میں جو اپنی چھتوں پر گرا پڑا تھا اتفاق گزر ہوا۔ تو اس نے کہا کہ خدا اس (کے باشندوں) کو مرنے کے بعد کیونکر زندہ کرے گا۔ تو خدا نے اس کی روح قبض کرلی (اور) سو برس تک (اس کو مردہ رکھا) پھر اس کو جلا اٹھایا اور پوچھا تم کتنا عرصہ (مرے)رہے ہو اس نے جواب دیا کہ ایک دن یا اس سے بھی کم۔ خدا نے فرمایا (نہیں) بلکہ سو برس (مرے) رہے ہو۔ اور اپنے کھانے پینے کی چیزوں کو دیکھو کہ (اتنی مدت میں مطلق) سڑی بسی نہیں اور اپنے گدھے کو بھی دیکھو (جو مرا پڑا ہے) غرض (ان باتوں سے) یہ ہے کہ ہم تم کو لوگوں کے لئے (اپنی قدرت کی) نشانی بنائیں اور (ہاں گدھے) کی ہڈیوں کو دیکھو کہ ہم ان کو کیونکر جوڑے دیتے اور ان پر (کس طرح) گوشت پوست چڑھا دیتے ہیں۔ جب یہ واقعات اس کے مشاہدے میں آئے تو بول اٹھا کہ میں یقین کرتا ہوں کہ خدا ہر چیز پر قادر ہے",
       "english":"Or (bethink thee of) the like of him who, passing by a township which had fallen into utter ruin, exclaimed: How shall Allah give this township life after its death? And Allah made him die a hundred years, then brought him back to life. He said: How long hast thou tarried? (The man) said: I have tarried a day or part of a day. (He) said: Nay, but thou hast tarried for a hundred years. Just look at thy food and drink which have not rotted! Look at thine ass! And, that We may make thee a token unto mankind, look at the bones, how We adjust them and then cover them with flesh! And when (the matter) became clear unto him, he said: I know now that Allah is Able to do all things."
       },{
       "arabic":"﴿2 وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اَرِنِىۡ كَيۡفَ تُحۡىِ الۡمَوۡتٰىؕ قَالَ اَوَلَمۡ تُؤۡمِنۡ‌ؕ قَالَ بَلٰى وَلٰـكِنۡ لِّيَطۡمَٮِٕنَّ قَلۡبِىۡ‌ؕ قَالَ فَخُذۡ اَرۡبَعَةً مِّنَ الطَّيۡرِ فَصُرۡهُنَّ اِلَيۡكَ ثُمَّ اجۡعَلۡ عَلٰى كُلِّ جَبَلٍ مِّنۡهُنَّ جُزۡءًا ثُمَّ ادۡعُهُنَّ يَاۡتِيۡنَكَ سَعۡيًا‌ؕ وَاعۡلَمۡ اَنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ",
        "urdu":"اور جب ابراہیم نے (خدا سے) کہا کہ اے پروردگار مجھے دکھا کہ تو مردوں کو کیونکر زندہ کرے گا۔ خدا نے فرمایا کیا تم نے (اس بات کو) باور نہیں کیا۔ انہوں نے کہا کیوں نہیں۔ لیکن (میں دیکھنا) اس لئے (چاہتا ہوں) کہ میرا دل اطمینان کامل حاصل کرلے۔ خدا نے فرمایا کہ چار جانور پکڑوا کر اپنے پاس منگا لو (اور ٹکڑے ٹکڑے کرادو) پھر ان کا ایک ٹکڑا ہر ایک پہاڑ پر رکھوا دو پھر ان کو بلاؤ تو وہ تمہارے پاس دوڑتے چلے آئیں گے۔ اور جان رکھو کہ خدا غالب اور صاحب حکمت ہے۔",
       "english":"And when Abraham said (unto his Lord): My Lord! Show me how Thou givest life to the dead, He said: Dost thou not believe? Abraham said: Yea, but (I ask) in order that my heart may be at ease. (His Lord) said: Take four of the birds and cause them to incline unto thee, then place a part of them on each hill, then call them, they will come to thee in haste, and know that Allah is Mighty, Wise."
       },{
       "arabic":"﴿2 مَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ كَمَثَلِ حَبَّةٍ اَنۡۢبَتَتۡ سَبۡعَ سَنَابِلَ فِىۡ كُلِّ سُنۡۢبُلَةٍ مِّائَةُ حَبَّةٍ‌ؕ وَاللّٰهُ يُضٰعِفُ لِمَنۡ يَّشَآءُ‌ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ",
        "urdu":"جو لوگ اپنا مال خدا کی راہ میں خرچ کرتے ہیں ان (کے مال) کی مثال اس دانے کی سی ہے جس سے سات بالیں اگیں اور ہر ایک بال میں سو سو دانے ہوں اور خدا جس (کے مال) کو چاہتا ہے زیادہ کرتا ہے۔ وہ بڑی کشائش والا اور سب کچھ جاننے والا ہے",
       "english":"The likeness of those who spend their wealth in Allah's way is as the likeness of a grain which groweth seven ears, in every ear a hundred grains. Allah giveth increase manifold to whom He will. Allah is All-Embracing, All-Knowing."
       },{
       "arabic":"﴿2 الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ ثُمَّ لَا يُتۡبِعُوۡنَ مَاۤ اَنۡفَقُوۡا مَنًّا وَّلَاۤ اَذًى‌ۙ لَّهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ‌ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ",
        "urdu":"جو لوگ اپنا مال خدا کے رستے میں صرف کرتے ہیں پھر اس کے بعد نہ اس خرچ کا (کسی پر) احسان رکھتے ہیں اور نہ (کسی کو) تکلیف دیتے ہیں۔ ان کا صلہ ان کے پروردگار کے پاس (تیار) ہے۔ اور (قیامت کے روز) نہ ان کو کچھ خوف ہوگا اور نہ وہ غمگین ہوں گے",
       "english":"Those who spend their wealth for the cause of Allah and afterward make not reproach and injury to follow that which they have spent; their reward is with their Lord, and there shall no fear come upon them, neither shall they grieve."
       },{
       "arabic":"﴿2 قَوۡلٌ مَّعۡرُوۡفٌ وَّمَغۡفِرَةٌ خَيۡرٌ مِّنۡ صَدَقَةٍ يَّتۡبَعُهَاۤ اَذًى‌ؕ وَاللّٰهُ غَنِىٌّ حَلِيۡمٌ",
        "urdu":"جس خیرات دینے کے بعد (لینے والے کو) ایذا دی جائے اس سے تو نرم بات کہہ دینی اور (اس کی بے ادبی سے) درگزر کرنا بہتر ہے اور خدا بےپروا اور بردبار ہے",
       "english":"A kind word with forgiveness is better than almsgiving followed by injury. Allah is Absolute, Clement."
       },{
       "arabic":"﴿2 يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تُبۡطِلُوۡا صَدَقٰتِكُمۡ بِالۡمَنِّ وَالۡاَذٰىۙ كَالَّذِىۡ يُنۡفِقُ مَالَهٗ رِئَآءَ النَّاسِ وَلَا يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ‌ؕ فَمَثَلُهٗ كَمَثَلِ صَفۡوَانٍ عَلَيۡهِ تُرَابٌ فَاَصَابَهٗ وَابِلٌ فَتَرَكَهٗ صَلۡدًا‌ؕ لَا يَقۡدِرُوۡنَ عَلٰى شَىۡءٍ مِّمَّا كَسَبُوۡا‌ؕ وَاللّٰهُ لَا يَهۡدِىۡ الۡقَوۡمَ الۡـكٰفِرِيۡنَ",
        "urdu":"مومنو! اپنے صدقات (وخیرات)احسان رکھنے اور ایذا دینے سے اس شخص کی طرح برباد نہ کردینا۔ جو لوگوں کو دکھاوے کے لئے مال خرچ کرتا ہے اور خدا اور روز آخرت پر ایمان نہیں رکھتا۔ تو اس (کے مال) کی مثال اس چٹان کی سی ہے جس پر تھوڑی سی مٹی پڑی ہو اور اس پر زور کا مینہ برس کر اسے صاف کر ڈالے۔ (اسی طرح) یہ (ریاکار) لوگ اپنے اعمال کا کچھ بھی صلہ حاصل نہیں کرسکیں گے۔ اور خدا ایسے ناشکروں کو ہدایت نہیں دیا کرتا",
       "english":"O ye who believe! Render not vain your almsgiving by reproach and injury, like him who spendeth his wealth only to be seen of men and believeth not in Allah and the Last Day. His likeness is as the likeness of a rock whereon is dust of earth; a rainstorm smiteth it, leaving it smooth and bare. They have no control of aught of that which they have gained. Allah guideth not the disbelieving folk."
       },{
       "arabic":"﴿2 وَمَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ وَ تَثۡبِيۡتًا مِّنۡ اَنۡفُسِهِمۡ كَمَثَلِ جَنَّةٍۢ بِرَبۡوَةٍ اَصَابَهَا وَابِلٌ فَاٰتَتۡ اُكُلَهَا ضِعۡفَيۡنِ‌ۚ فَاِنۡ لَّمۡ يُصِبۡهَا وَابِلٌ فَطَلٌّ‌ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ",
        "urdu":"اور جو لوگ خدا کی خوشنودی حاصل کرنے کے لئے خلوص نیت سے اپنا مال خرچ کرتے ہیں ان کی مثال ایک باغ کی سی ہے جو اونچی جگہ پر واقع ہو(جب) اس پر مینہ پڑے تو دگنا پھل لائے۔ اور اگر مینہ نہ بھی پڑے تو خیر پھوار ہی سہی اور خدا تمہارے کاموں کو دیکھ رہا ہے",
       "english":"And the likeness of those who spend their wealth in search of Allah's pleasure, and for the strengthening of their souls, is as the likeness of a garden on a height. The rainstorm smiteth it and it bringeth forth its fruit twofold. And if the rainstorm smite it not, then the shower. Allah is Seer of what ye do."
       },{
       "arabic":"﴿2 اَيَوَدُّ اَحَدُكُمۡ اَنۡ تَكُوۡنَ لَهٗ جَنَّةٌ مِّنۡ نَّخِيۡلٍ وَّاَعۡنَابٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُۙ لَهٗ فِيۡهَا مِنۡ كُلِّ الثَّمَرٰتِۙ وَاَصَابَهُ الۡكِبَرُ وَلَهٗ ذُرِّيَّةٌ ضُعَفَآءُۖۚ فَاَصَابَهَاۤ اِعۡصَارٌ فِيۡهِ نَارٌ فَاحۡتَرَقَتۡ‌ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّكُمۡ تَتَفَكَّرُوۡنَ",
        "urdu":"بھلا تم میں کوئی یہ چاہتا ہے کہ اس کا کھجوروں اور انگوروں کا باغ ہو جس میں نہریں بہہ رہی ہوں اور اس میں اس کے لئے ہر قسم کے میوے موجود ہوں اور اسے بڑھاپا آپکڑے اور اس کے ننھے ننھے بچے بھی ہوں۔ تو (ناگہاں) اس باغ پر آگ کا بھرا ہوا بگولا چلے اور وہ جل کر (راکھ کا ڈھیر ہو) جائے۔ اس طرح خدا تم سے اپنی آیتیں کھول کھول کر بیان فرماتا ہے تاکہ تم سوچو (اور سمجھو)",
       "english":"Would any of you like to have a garden of palm-trees and vines, with rivers flowing underneath it, with all kinds of fruit for him therein; and old age hath stricken him and he hath feeble offspring; and a fiery whirlwind striketh it and it is (all) consumed by fire. Thus Allah maketh plain His revelations unto you, in order that ye may give thought."
       },{
       "arabic":"﴿2 يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِنۡ طَيِّبٰتِ مَا كَسَبۡتُمۡ وَمِمَّاۤ اَخۡرَجۡنَا لَـكُمۡ مِّنَ الۡاَرۡضِ وَلَا تَيَمَّمُوۡا الۡخَبِيۡثَ مِنۡهُ تُنۡفِقُوۡنَ وَلَسۡتُمۡ بِاٰخِذِيۡهِ اِلَّاۤ اَنۡ تُغۡمِضُوۡا فِيۡهِ‌ؕ وَاعۡلَمُوۡۤا اَنَّ اللّٰهَ غَنِىٌّ حَمِيۡدٌ",
        "urdu":"مومنو! جو پاکیزہ اور عمدہ مال تم کماتے ہوں اور جو چیزیں ہم تمہارے لئے زمین سےنکالتے ہیں ان میں سے (راہ خدا میں) خرچ کرو۔ اور بری اور ناپاک چیزیں دینے کا قصد نہ کرنا کہ (اگر وہ چیزیں تمہیں دی جائیں تو) بجز اس کے کہ (لیتے وقت) آنکھیں بند کرلو ان کو کبھی نہ لو۔ اور جان رکھو کہ خدا بےپروا (اور) قابل ستائش ہے",
       "english":"O ye who believe! Spend of the good things which ye have earned, and of that which We bring forth from the earth for you, and seek not the bad (with intent) to spend thereof (in charity) when ye would not take it for yourselves save with disdain; and know that Allah is Absolute, Owner of Praise."
       },{
       "arabic":"﴿2 الشَّيۡطٰنُ يَعِدُكُمُ الۡـفَقۡرَ وَيَاۡمُرُكُمۡ بِالۡفَحۡشَآءِ‌ۚ وَاللّٰهُ يَعِدُكُمۡ مَّغۡفِرَةً مِّنۡهُ وَفَضۡلًاؕ وَاللّٰهُ وٰسِعٌ عَلِيۡمٌۚۙ‌ۖ",
        "urdu":"(اور دیکھنا) شیطان (کا کہنا نہ ماننا وہ) تمہیں تنگ دستی کا خوف دلاتا اور بےحیائی کے کام کر نے کو کہتا ہے۔ اور خدا تم سے اپنی بخشش اور رحمت کا وعدہ کرتا ہے۔ اور خدا بڑی کشائش والا (اور) سب کچھ جاننے والا ہے",
       "english":"The devil promiseth you destitution and enjoineth on you lewdness. But Allah promiseth you forgiveness from Himself with bounty. Allah is All-Embracing, All-knowing."
       },{
       "arabic":"﴿2 يُؤۡتِىۡ الۡحِكۡمَةَ مَنۡ يَّشَآءُ‌‌ۚ وَمَنۡ يُّؤۡتَ الۡحِكۡمَةَ فَقَدۡ اُوۡتِىَ خَيۡرًا كَثِيۡرًا‌ؕ وَمَا يَذَّكَّرُ اِلَّاۤ اُولُوۡا الۡاَلۡبَابِ",
        "urdu":"وہ جس کو چاہتا ہے دانائی بخشتا ہے۔ اور جس کو دانائی ملی بےشک اس کو بڑی نعمت ملی۔ اور نصیحت تو وہی لوگ قبول کرتے ہیں جو عقلمند ہیں",
       "english":"He giveth wisdom unto whom He will, and he unto whom wisdom is given, he truly hath received abundant good. But none remember except men of understanding."
       },{
       "arabic":"﴿2 وَمَاۤ اَنۡفَقۡتُمۡ مِّنۡ نَّفَقَةٍ اَوۡ نَذَرۡتُمۡ مِّنۡ نَّذۡرٍ فَاِنَّ اللّٰهَ يَعۡلَمُهٗؕ وَمَا لِلظّٰلِمِيۡنَ مِنۡ اَنۡصَارٍ",
        "urdu":"اور تم (خدا کی راہ میں) جس طرح کا خرچ کرو یا کوئی نذر مانو خدا اس کو جانتا ہے اور ظالموں کا کوئی مددگار نہیں",
       "english":"Whatever alms ye spend or vow ye vow, lo! Allah knoweth it. Wrong-doers have no helpers."
       },{
       "arabic":"﴿2 اِنۡ تُبۡدُوۡا الصَّدَقٰتِ فَنِعِمَّا هِىَ‌ۚ وَاِنۡ تُخۡفُوۡهَا وَ تُؤۡتُوۡهَا الۡفُقَرَآءَ فَهُوَ خَيۡرٌ لَّكُمۡ‌ؕ وَيُكَفِّرُ عَنۡكُمۡ مِّنۡ سَيِّاٰتِكُمۡ‌ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ",
        "urdu":"اگر تم خیرات ظاہر دو تو وہ بھی خوب ہے اور اگر پوشیدہ دو اور دو بھی اہل حاجت کو تو وہ خوب تر ہے اور (اس طرح کا دینا) تمہارے گناہوں کو بھی دور کردے گا۔ اور خدا کو تمہارے سب کاموں کی خبر ہے",
       "english":"If ye publish your almsgiving, it is well, but if ye hide it and give it to the poor, it will be better for you, and will atone for some of your ill-deeds. Allah is Informed of what ye do."
       },{
       "arabic":"﴿2 لَيۡسَ عَلَيۡكَ هُدٰٮهُمۡ وَلٰـكِنَّ اللّٰهَ يَهۡدِىۡ مَنۡ يَّشَآءُ‌ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَلِاَنۡفُسِكُمۡ‌ؕ وَمَا تُنۡفِقُوۡنَ اِلَّا ابۡتِغَآءَ وَجۡهِ اللّٰهِ‌ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ يُّوَفَّ اِلَيۡكُمۡ وَاَنۡتُمۡ لَا تُظۡلَمُوۡنَ",
        "urdu":"(اے محمدﷺ) تم ان لوگوں کی ہدایت کے ذمہ دار نہیں ہو بلکہ خدا ہی جس کو چاہتا ہے ہدایت بخشتا ہے۔ اور (مومنو) تم جو مال خرچ کرو گے تو اس کا فائدہ تمہیں کو ہے اور تم جو خرچ کرو گے خدا کی خوشنودی کے لئے کرو گے۔ اور جو مال تم خرچ کرو گے وہ تمہیں پورا پورا دے دیا جائے گا اور تمہارا کچھ نقصان نہیں کیا جائے گا،",
       "english":"The guiding of them is not thy duty (O Muhammad), but Allah guideth whom He will. And whatsoever good thing ye spend, it is for yourselves, when ye spend not save in search of Allah's Countenance; and whatsoever good thing ye spend, it will be repaid to you in full, and ye will not be wronged."
       },{
       "arabic":"﴿2 لِلۡفُقَرَآءِ الَّذِيۡنَ اُحۡصِرُوۡا فِىۡ سَبِيۡلِ اللّٰهِ لَا يَسۡتَطِيۡعُوۡنَ ضَرۡبًا فِىۡ الۡاَرۡضِ يَحۡسَبُهُمُ الۡجَاهِلُ اَغۡنِيَآءَ مِنَ التَّعَفُّفِ‌ۚ تَعۡرِفُهُمۡ بِسِيۡمٰهُمۡ‌ۚ لَا يَسۡـَٔـلُوۡنَ النَّاسَ اِلۡحَــافًا‌ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ",
        "urdu":"(اور ہاں تم جو خرچ کرو گے تو) ان حاجتمندوں کے لئے جو خدا کی راہ میں رکے بیٹھے ہیں اور ملک میں کسی طرف جانے کی طاقت نہیں رکھتے (اور مانگنے سے عار رکھتے ہیں) یہاں تک کہ نہ مانگنے کی وجہ سے ناواقف شخص ان کو غنی خیال کرتا ہے اور تم قیافے سے ان کو صاف پہچان لو (کہ حاجتمند ہیں اور شرم کے سبب) لوگوں سے (منہ پھوڑ کر اور) لپٹ کر نہیں مانگ سکتے اور تم جو مال خرچ کرو گے کچھ شک نہیں کہ خدا اس کو جانتا ہے",
       "english":"(Alms are) for the poor who are straitened for the cause of Allah, who cannot travel in the land (for trade). The unthinking man accounteth them wealthy because of their restraint. Thou shalt know them by their mark: They do not beg of men with importunity. And whatsoever good thing ye spend, lo! Allah knoweth it."
       },{
       "arabic":"﴿2 الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ بِالَّيۡلِ وَالنَّهَارِ سِرًّا وَّعَلَانِيَةً فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ‌ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَؔ",
        "urdu":"جو لوگ اپنا مال رات اور دن اور پوشیدہ اور ظاہر (راہ خدا میں) خرچ کرتے رہتے ہیں ان کا صلہ پروردگار کے پاس ہے اور ان کو (قیامت کے دن) نہ کسی طرح کا خوف ہوگا اور نہ غم",
       "english":"Those who spend their wealth by night and day, by stealth and openly, verily their reward is with their Lord, and their shall no fear come upon them neither shall they grieve."
       },{
       "arabic":"﴿2 الَّذِيۡنَ يَاۡكُلُوۡنَ الرِّبٰوا لَا يَقُوۡمُوۡنَ اِلَّا كَمَا يَقُوۡمُ الَّذِىۡ يَتَخَبَّطُهُ الشَّيۡطٰنُ مِنَ الۡمَسِّ‌ؕ ذٰلِكَ بِاَنَّهُمۡ قَالُوۡۤا اِنَّمَا الۡبَيۡعُ مِثۡلُ الرِّبٰوا‌ۘ‌ وَاَحَلَّ اللّٰهُ الۡبَيۡعَ وَحَرَّمَ الرِّبٰوا‌ؕ فَمَنۡ جَآءَهٗ مَوۡعِظَةٌ مِّنۡ رَّبِّهٖ فَانۡتَهٰى فَلَهٗ مَا سَلَفَ وَاَمۡرُهٗۤ اِلَى اللّٰهِ‌ؕ وَمَنۡ عَادَ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ‌ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ",
        "urdu":"جو لوگ سود کھاتے ہیں وہ (قبروں سے) اس طرح (حواس باختہ) اٹھیں گے جیسے کسی کو جن نے لپٹ کر دیوانہ بنا دیا ہو یہ اس لئے کہ وہ کہتے ہیں کہ سودا بیچنا بھی تو (نفع کے لحاظ سے) ویسا ہی ہے جیسے سود (لینا) حالانکہ سودے کو خدا نے حلال کیا ہے اور سود کو حرام۔ تو جس شخص کے پاس خدا کی نصیحت پہنچی اور وہ (سود لینے سے) باز آگیا تو جو پہلے ہوچکا وہ اس کا۔ اور (قیامت میں) اس کا معاملہ خدا کے سپرد اور جو پھر لینے لگا تو ایسے لوگ دوزخی ہیں کہ ہمیشہ دوزخ میں (جلتے) رہیں گے",
       "english":"Those who swallow usury cannot rise up save as he ariseth whom the devil hath prostrated by (his) touch. That is because they say: Trade is just like usury; whereas Allah permitteth trading and forbiddeth usury. He unto whom an admonition from his Lord cometh, and (he) refraineth (in obedience thereto), he shall keep (the profits of) that which is past, and his affair (henceforth) is with Allah. As for him who returneth (to usury) - Such are rightful owners of the Fire. They will abide therein."
       },{
       "arabic":"﴿2 يَمۡحَقُ اللّٰهُ الرِّبٰوا وَيُرۡبِىۡ الصَّدَقٰتِ‌ؕ وَاللّٰهُ لَا يُحِبُّ كُلَّ كَفَّارٍ اَثِيۡمٍ",
        "urdu":"خدا سود کو نابود (یعنی بےبرکت) کرتا اور خیرات (کی برکت) کو بڑھاتا ہے اور خدا کسی ناشکرے گنہگار کو دوست نہیں رکھتا",
       "english":"Allah hath blighted usury and made almsgiving fruitful. Allah loveth not the impious and guilty."
       },{
       "arabic":"﴿2 اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوۡا الصّٰلِحٰتِ وَاَقَامُوۡا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ لَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ‌ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ",
        "urdu":"جو لوگ ایمان لائے اور نیک عمل کرتے اور نماز پڑھتے اور زکوٰة دیتے رہے ان کو ان کے کاموں کا صلہ خدا کے ہاں ملے گا اور (قیامت کے دن) ان کو نہ کچھ خوف ہوا اور نہ وہ غمناک ہوں گے",
       "english":"Lo! those who believe and do good works and establish worship and pay the poor-due, their reward is with their Lord and there shall no fear come upon them neither shall they grieve."
       },{
       "arabic":"﴿2 يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا اتَّقُوۡا اللّٰهَ وَذَرُوۡا مَا بَقِىَ مِنَ الرِّبٰٓوا اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ",
        "urdu":"مومنو! خدا سے ڈرو اور اگر ایمان رکھتے ہو تو جتنا سود باقی رہ گیا ہے اس کو چھوڑ دو",
       "english":"O ye who believe! Observe your duty to Allah, and give up what remaineth (due to you) from usury, if ye are (in truth) believers."
       },{
       "arabic":"﴿2 فَاِنۡ لَّمۡ تَفۡعَلُوۡا فَاۡذَنُوۡا بِحَرۡبٍ مِّنَ اللّٰهِ وَرَسُوۡلِهٖ‌ۚ وَاِنۡ تُبۡتُمۡ فَلَـكُمۡ رُءُوۡسُ اَمۡوَالِكُمۡ‌ۚ لَا تَظۡلِمُوۡنَ وَلَا تُظۡلَمُوۡنَ",
        "urdu":"اگر ایسا نہ کرو گے تو خبردار ہوجاؤ (کہ تم) خدا اور رسول سے جنگ کرنے کے لئے (تیار ہوتے ہو) اور اگر توبہ کرلو گے (اور سود چھوڑ دو گے) تو تم کو اپنی اصل رقم لینے کا حق ہے جس میں نہ اوروں کا نقصان اور تمہارا نقصان",
       "english":"And if ye do not, then be warned of war (against you) from Allah and His messenger. And if ye repent, then ye have your principal (without interest). Wrong not, and ye shall not be wronged."
       },{
       "arabic":"﴿2 وَاِنۡ كَانَ ذُوۡ عُسۡرَةٍ فَنَظِرَةٌ اِلٰى مَيۡسَرَةٍ‌ؕ وَاَنۡ تَصَدَّقُوۡا خَيۡرٌ لَّـكُمۡ‌ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ",
        "urdu":"اور اگر قرض لینے والا تنگ دست ہو تو (اسے) کشائش (کے حاصل ہونے) تک مہلت (دو) اور اگر (زر قرض) بخش ہی دو توتمہارے لئے زیادہ اچھا ہے بشرطیکہ سمجھو",
       "english":"And if the debtor is in straitened circumstances, then (let there be) postponement to (the time of) ease; and that ye remit the debt as almsgiving would be better for you if ye did but know."
       },{
       "arabic":"﴿2 وَاتَّقُوۡا يَوۡمًا تُرۡجَعُوۡنَ فِيۡهِ اِلَى اللّٰهِ ثُمَّ تُوَفّٰى كُلُّ نَفۡسٍ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُوۡنَ",
        "urdu":"اور اس دن سے ڈرو جب کہ تم خدا کے حضور میں لوٹ کر جاؤ گے اور ہر شخص اپنے اعمال کا پورا پورا بدلہ پائے گا۔ اور کسی کا کچھ نقصان نہ ہوگا",
       "english":"And guard yourselves against a day in which ye will be brought back to Allah. Then every soul will be paid in full that which it hath earned, and they will not be wronged."
       },{
       "arabic":"﴿2 يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا تَدَايَنۡتُمۡ بِدَيۡنٍ اِلٰٓى اَجَلٍ مُّسَمًّى فَاكۡتُبُوۡهُ‌ؕ وَلۡيَكۡتُب بَّيۡنَكُمۡ كَاتِبٌۢ بِالۡعَدۡلِ‌ وَلَا يَاۡبَ كَاتِبٌ اَنۡ يَّكۡتُبَ كَمَا عَلَّمَهُ اللّٰهُ‌ فَلۡيَكۡتُبۡ ‌ۚوَلۡيُمۡلِلِ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ وَلَا يَبۡخَسۡ مِنۡهُ شَيۡـًٔـا‌ؕ فَاِنۡ كَانَ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ سَفِيۡهًا اَوۡ ضَعِيۡفًا اَوۡ لَا يَسۡتَطِيۡعُ اَنۡ يُّمِلَّ هُوَ فَلۡيُمۡلِلۡ وَلِيُّهٗ بِالۡعَدۡلِ‌ؕ وَاسۡتَشۡهِدُوۡا شَهِيۡدَيۡنِ مِنۡ رِّجَالِكُمۡ‌ۚ فَاِنۡ لَّمۡ يَكُوۡنَا رَجُلَيۡنِ فَرَجُلٌ وَّامۡرَاَتٰنِ مِمَّنۡ تَرۡضَوۡنَ مِنَ الشُّهَدَآءِ اَنۡ تَضِلَّ اِحۡدٰٮهُمَا فَتُذَكِّرَ اِحۡدٰٮهُمَا الۡاُخۡرٰى‌ؕ وَ لَا يَاۡبَ الشُّهَدَآءُ اِذَا مَا دُعُوۡا‌ؕ وَلَا تَسۡـَٔـمُوۡۤا اَنۡ تَكۡتُبُوۡهُ صَغِيۡرًا اَوۡ كَبِيۡرًا اِلٰٓى اَجَلِهٖ‌ؕ ذٰلِكُمۡ اَقۡسَطُ عِنۡدَ اللّٰهِ وَاَقۡوَمُ لِلشَّهٰدَةِ وَاَدۡنىٰۤ اَلَّا تَرۡتَابُوۡٓا‌ۚ اِلَّاۤ اَنۡ تَكُوۡنَ تِجَارَةً حَاضِرَةً تُدِيۡرُوۡنَهَا بَيۡنَكُمۡ فَلَيۡسَ عَلَيۡكُمۡ جُنَاحٌ اَلَّا تَكۡتُبُوۡهَا‌ؕ وَاَشۡهِدُوۡۤا اِذَا تَبَايَعۡتُمۡ‌ؕ وَلَا يُضَآرَّ كَاتِبٌ وَّلَا شَهِيۡدٌ‌ؕ وَاِنۡ تَفۡعَلُوۡا فَاِنَّهٗ فُسُوۡقٌۢ بِكُمۡؕ وَ اتَّقُوۡا اللّٰهَ‌ؕ وَيُعَلِّمُكُمُ اللّٰهُ‌ؕ وَاللّٰهُ بِكُلِّ شَىۡءٍ عَلِيۡمٌ",
        "urdu":"مومنو! جب تم آپس میں کسی میعاد معین کے لئے قرض کا معاملہ کرنے لگو تو اس کو لکھ لیا کرو اور لکھنے والا تم میں (کسی کا نقصان نہ کرے بلکہ) انصاف سے لکھے نیز لکھنے والا جیسا اسے خدا نے سکھایا ہے لکھنے سے انکار بھی نہ کرے اور دستاویز لکھ دے۔ اور جو شخص قرض لے وہی (دستاویز کا) مضمون بول کر لکھوائے اور خدا سے کہ اس کا مالک ہے خوف کرے اور زر قرض میں سے کچھ کم نہ لکھوائے۔ اور اگر قرض لینے والا بےعقل یا ضعیف ہو یا مضمون لکھوانے کی قابلیت نہ رکھتا ہو تو جو اس کا ولی ہو وہ انصاف کے ساتھ مضمون لکھوائے۔ اور اپنے میں سے دو مردوں کو (ایسے معاملے کے) گواہ کرلیا کرو۔ اور اگر دو مرد نہ ہوں تو ایک مرد اور دو عورتیں جن کو تم گواہ پسند کرو (کافی ہیں) کہ اگر ان میں سے ایک بھول جائے گی تو دوسری اسے یاد دلادے گی۔ اور جب گواہ (گواہی کے لئے طلب کئے جائیں تو انکار نہ کریں۔ اور قرض تھوڑا ہو یا بہت اس (کی دستاویز) کے لکھنے میں کاہلی نہ کرنا۔ یہ بات خدا کے نزدیک نہایت قرین انصاف ہے اور شہادت کے لئے بھی یہ بہت درست طریقہ ہے۔ اس سے تمہیں کسی طرح کا شک وہ شبہ بھی نہیں پڑے گا۔ ہاں اگر سودا دست بدست ہو جو تم آپس میں لیتے دیتے ہو تو اگر (ایسے معاملے کی) دستاویز نہ لکھوتو تم پر کچھ گناہ نہیں۔ اور جب خرید وفروخت کیا کرو تو بھی گواہ کرلیا کرو۔ اور کاتب دستاویز اور گواہ (معاملہ کرنے والوں کا) کسی طرح نقصان نہ کریں۔ اگر تم (لوگ) ایسا کرو تو یہ تمہارے لئے گناہ کی بات ہے۔ اور خدا سے ڈرو اور (دیکھو کہ) وہ تم کو (کیسی مفید باتیں) سکھاتا ہے اور خدا ہر چیز سے واقف ہے",
        "english":"O ye who believe! When ye contract a debt for a fixed term, record it in writing. Let a scribe record it in writing between you in (terms of) equity. No scribe should refuse to write as Allah hath taught him, so let him write, and let him who incurreth the debt dictate, and let him observe his duty to Allah his Lord, and diminish naught thereof. But if he who oweth the debt is of low understanding, or weak, or unable himself to dictate, then let the guardian of his interests dictate in (terms of) equity. And call to witness, from among your men, two witnesses. And if two men be not (at hand) then a man and two women, of such as ye approve as witnesses, so that if the one erreth (through forgetfulness) the other will remember. And the witnesses must not refuse when they are summoned. Be not averse to writing down (the contract) whether it be small or great, with (record of) the term thereof. That is more equitable in the sight of Allah and more sure for testimony, and the best way of avoiding doubt between you; save only in the case when it is actual merchandise which ye transfer among yourselves from hand to hand. In that case it is no sin for you if ye write it not. And have witnesses when ye sell one to another, and let no harm be done to scribe or witness. If ye do (harm to them) lo! it is a sin in you. Observe your duty to Allah. Allah is teaching you. And Allah is knower of all things."
       },{
       "arabic":"﴿2 وَاِنۡ كُنۡتُمۡ عَلٰى سَفَرٍ وَّلَمۡ تَجِدُوۡا كَاتِبًا فَرِهٰنٌ مَّقۡبُوۡضَةٌ‌ؕ فَاِنۡ اَمِنَ بَعۡضُكُمۡ بَعۡضًا فَلۡيُؤَدِّ الَّذِىۡ اؤۡتُمِنَ اَمَانَتَهٗ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ‌ؕ وَلَا تَكۡتُمُوۡا الشَّهَادَةَ‌ؕ وَمَنۡ يَّكۡتُمۡهَا فَاِنَّهٗۤ اٰثِمٌ قَلۡبُهٗ‌ؕ وَ اللّٰهُ بِمَا تَعۡمَلُوۡنَ عَلِيۡمٌ",
        "urdu":"اور اگر تم سفر پر ہواور (دستاویز) لکھنے والا مل نہ سکے تو (کوئی چیز) رہن یا قبضہ رکھ کر (قرض لے لو) اور اگر کوئی کسی کو امین سمجھے (یعنی رہن کے بغیر قرض دیدے) تو امانتدار کو چاہیئے کہ صاحب امانت کی امانت ادا کردے اور خدا سے جو اس کا پروردگار ہے ڈرے۔اور (دیکھنا) شہادت کو مت چھپانا۔ جو اس کو چھپائے گا وہ دل کا گنہگار ہوگا۔ اور خدا تمہارے سب کاموں سے واقف ہے",
       "english":"If ye be on a journey and cannot find a scribe, then a pledge in hand (shall suffice). And if one of you entrusteth to another let him who is trusted deliver up that which is entrusted to him (according to the pact between them) and let him observe his duty to Allah his Lord. Hide not testimony. He who hideth it, verily his heart is sinful. Allah is Aware of what ye do."
       },{
       "arabic":"﴿2 لِلَّهِ مَا فِىۡ السَّمٰوٰتِ وَمَا فِىۡ الۡاَرۡضِ‌ؕ وَاِنۡ تُبۡدُوۡا مَا فِىۡۤ اَنۡفُسِكُمۡ اَوۡ تُخۡفُوۡهُ يُحَاسِبۡكُمۡ بِهِ اللّٰهُ‌ؕ فَيَغۡفِرُ لِمَنۡ يَّشَآءُ وَيُعَذِّبُ مَنۡ يَّشَآءُ‌ؕ وَاللّٰهُ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ",
        "urdu":"جو کچھ آسمانوں میں اور جو کچھ زمین میں ہے سب خدا ہی کا ہے۔ تم اپنے دلوں کی بات کو ظاہر کرو گے تو یا چھپاؤ گے تو خدا تم سے اس کا حساب لے گا پھر وہ جسے چاہے مغفرت کرے اور جسے چاہے عذاب دے۔ اور خدا ہر چیز پر قادر ہے",
       "english":"Unto Allah (belongeth) whatsoever is in the heavens and whatsoever is in the earth; and whether ye make known what is in your minds or hide it, Allah will bring you to account for it. He will forgive whom He will and He will punish whom He will. Allah is Able to do all things."
       },{
       "arabic":"﴿2 اٰمَنَ الرَّسُوۡلُ بِمَاۤ اُنۡزِلَ اِلَيۡهِ مِنۡ رَّبِّهٖ وَ الۡمُؤۡمِنُوۡنَ‌ؕ كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰٓٮِٕكَتِهٖ وَكُتُبِه وَرُسُلِهٖ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡ رُّسُلِهٖ‌ وَقَالُوۡا سَمِعۡنَا وَاَطَعۡنَا‌ غُفۡرَانَكَ رَبَّنَا وَاِلَيۡكَ الۡمَصِيۡرُ",
        "urdu":"رسول (خدا) اس کتاب پر جو ان کے پروردگار کی طرف سے ان پر نازل ہوئی ایمان رکھتے ہیں اور مومن بھی۔ سب خدا پر اور اس کے فرشتوں پر اور اس کی کتابوں پر اور اس کے پیغمبروں پر ایمان رکھتے ہیں (اورکہتے ہیں کہ) ہم اس کے پیغمبروں سے کسی میں کچھ فرق نہیں کرتے اور وہ (خدا سے) عرض کرتے ہیں کہ ہم نے (تیرا حکم) سنا اور قبول کیا۔ اے پروردگار ہم تیری بخشش مانگتے ہیں اور تیری ہی طرف لوٹ کر جانا ہے",
       "english":"The messenger believeth in that which hath been revealed unto him from his Lord and (so do) believers. Each one believeth in Allah and His angels and His scriptures and His messengers - We make no distinction between any of His messengers - and they say: We hear, and we obey. (Grant us) Thy forgiveness, our Lord. Unto Thee is the journeying."
       },{
       "arabic":"﴿2 لَا يُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّا وُسۡعَهَا‌ؕ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا اكۡتَسَبَتۡ‌ؕ رَبَّنَا لَا تُؤَاخِذۡنَاۤ اِنۡ نَّسِيۡنَاۤ اَوۡ اَخۡطَاۡنَا‌ۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَاۤ اِصۡرًا كَمَا حَمَلۡتَهٗ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَا‌‌ۚرَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهٖ‌ۚ وَاعۡفُ عَنَّا وَاغۡفِرۡ لَنَا وَارۡحَمۡنَا اَنۡتَ مَوۡلٰٮنَا فَانصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ",
        "urdu":"خدا کسی شخص کو اس کی طاقت سے زیادہ تکلیف نہیں دیتا۔ اچھے کام کرے گا تو اس کو ان کا فائدہ ملے گا برے کرے گا تو اسے ان کا نقصان پہنچے گا۔ اے پروردگار اگر ہم سے بھول یا چوک ہوگئی ہو تو ہم سے مؤاخذہ نہ کیجیو۔ اے پروردگار ہم پر ایسا بوجھ نہ ڈالیو جیسا تو نے ہم سے پہلے لوگوں پر ڈالا تھا۔ اے پروردگار جتنا بوجھ اٹھانے کی ہم میں طاقت نہیں اتنا ہمارے سر پر نہ رکھیو۔ اور (اے پروردگار) ہمارے گناہوں سے درگزر کر اور ہمیں بخش دے۔ اور ہم پر رحم فرما۔ تو ہی ہمارا مالک ہے اور ہم کو کافروں پر غالب فرما",
       "english":"Allah tasketh not a soul beyond its scope. For it (is only) that which it hath earned, and against it (only) that which it hath deserved. Our Lord! Condemn us not if we forget, or miss the mark! Our Lord! Lay not on us such a burden as thou didst lay on those before us! Our Lord! Impose not on us that which we have not the strength to bear! Pardon us, absolve us and have mercy on us, Thou, our Protector, and give us victory over the disbelieving folk."
       }]
    }
]
